RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
            __RW uint32_t TSYN_TXBUF_BIN0_TX_TIMESTAMP_L; /* 0x218F8:  */
            __RW uint32_t TSYN_TXBUF_BIN0_TX_TIMESTAMP_H; /* 0x218FC:  */
        } BIN[8];
        __R  uint8_t  RESERVED10[4];           /* 0x22000 - 0x22003: Reserved */
        __R  uint32_t TSN_SHAPER_HWCFG1;       /* 0x22004:  */
        __R  uint8_t  RESERVED11[4];           /* 0x22008 - 0x2200B: Reserved */
        __RW uint32_t TSN_SHAPER_TQAV;         /* 0x2200C:  */
        __R  uint32_t TSN_SHAPER_TQEM;         /* 0x22010:  */
        __RW uint32_t TSN_SHAPER_FPST;         /* 0x22014:  */
        __RW uint32_t TSN_SHAPER_MMCT;         /* 0x22018:  */
        __RW uint32_t TSN_SHAPER_HOLDADV;      /* 0x2201C:  */
        __R  uint8_t  RESERVED12[224];         /* 0x22020 - 0x220FF: Reserved */
        __RW uint32_t MXSDU[8];                /* 0x22100 - 0x2211C:  */
        __RW uint32_t TXSEL[8];                /* 0x22120 - 0x2213C:  */
        __RW uint32_t IDSEL[8];                /* 0x22140 - 0x2215C:  */
        __R  uint8_t  RESERVED13[1696];        /* 0x22160 - 0x227FF: Reserved */
        __RW uint32_t PORT1_QCH0_CFG;          /* 0x22800: qch channel0 control */
        __RW uint32_t PORT1_QCH1_CFG;          /* 0x22804: qch channel1 control */
        __RW uint32_t PORT1_QCH2_CFG;          /* 0x22808: qch channel2 control */
        __RW uint32_t PORT1_QCH3_CFG;          /* 0x2280C: qch channel3 control */
        __RW uint32_t PORT1_QCH_ERR_CFG;       /* 0x22810: qch clear */
        __R  uint8_t  RESERVED14[2028];        /* 0x22814 - 0x22FFF: Reserved */
        __RW uint32_t TSN_SHAPER_TAS_CRSR;     /* 0x23000:  */
        __RW uint32_t TSN_SHAPER_TAS_ACYCLETM; /* 0x23004:  */
        __RW uint32_t TSN_SHAPER_TAS_ABASETM_L;/* 0x23008:  */
        __RW uint32_t TSN_SHAPER_TAS_ABASETM_H;/* 0x2300C:  */
        __RW uint32_t TSN_SHAPER_TAS_LISTLEN;  /* 0x23010:  */
        __R  uint32_t TSN_SHAPER_TAS_OCYCLETM; /* 0x23014:  */
        __R  uint32_t TSN_SHAPER_TAS_OBASETM_L;/* 0x23018:  */
        __R  uint32_t TSN_SHAPER_TAS_OBASETM_H;/* 0x2301C:  */
        __RW uint32_t MXTK[8];                 /* 0x23020 - 0x2303C:  */
        __RW uint32_t TXOV[8];                 /* 0x23040 - 0x2305C:  */
        __R  uint8_t  RESERVED15[1952];        /* 0x23060 - 0x237FF: Reserved */
        struct {
            __RW uint32_t TSN_SHAPER_ACLIST_ENTRY0_L; /* 0x23800:  */
            __RW uint32_t TSN_SHAPER_ACLIST_ENTRY0_H; /* 0x23804:  */
        } SHACL[256];
        __R  uint8_t  RESERVED16[45056];       /* 0x24000 - 0x2EFFF: Reserved */
        __R  uint32_t TSN_EP_VER;              /* 0x2F000:  */
        __RW uint32_t TSN_EP_CTRL;             /* 0x2F004:  */
        __R  uint8_t  RESERVED17[8];           /* 0x2F008 - 0x2F00F: Reserved */
        __RW uint32_t TSN_EP_TXUF;             /* 0x2F010:  */
        __R  uint32_t TSN_EP_IPCFG;            /* 0x2F014:  */
        __R  uint8_t  RESERVED18[8];           /* 0x2F018 - 0x2F01F: Reserved */
        __R  uint32_t TSN_EP_TSF_D0;           /* 0x2F020:  */
        __R  uint32_t TSN_EP_TSF_D1;           /* 0x2F024:  */
        __R  uint32_t TSN_EP_TSF_D2;           /* 0x2F028:  */
        __RW uint32_t TSN_EP_TSF_SR;           /* 0x2F02C:  */
        __RW uint32_t TSN_EP_MMS_CTRL;         /* 0x2F030:  */
        __R  uint32_t TSN_EP_MMS_STS;          /* 0x2F034:  */
        __RW uint32_t TSN_EP_MMS_VTIME;        /* 0x2F038:  */
        __RW uint32_t TSN_EP_MMS_STAT;         /* 0x2F03C:  */
        __W  uint32_t TSN_EP_PTP_UPTM_NS;      /* 0x2F040:  */
        __W  uint32_t TSN_EP_PTP_UPTM_S;       /* 0x2F044:  */
        __R  uint32_t TSN_EP_PTP_SR;           /* 0x2F048:  */
        __R  uint8_t  RESERVED19[4020];        /* 0x2F04C - 0x2FFFF: Reserved */
        __RW uint32_t SW_CTRL_PORT_MAIN_TAGGING; /* 0x30000: PVID Tagging Register */
        __RW uint32_t SW_CTRL_PORT_MAIN_ENNABLE; /* 0x30004: Port Module Enable Register */
        __R  uint8_t  RESERVED20[8184];        /* 0x30008 - 0x31FFF: Reserved */
        __RW uint32_t SW_CTRL_EGRESS_ECSR_QDROP; /* 0x32000:  */
        __R  uint8_t  RESERVED21[8188];        /* 0x32004 - 0x33FFF: Reserved */
        struct {
            __R  uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_FDMEM_CNT_BYTE; /* 0x34000:  */
            __R  uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_FDMEM_STS; /* 0x34004:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_ERROR_FLAG; /* 0x34008:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_IE_ERROR_FLAG; /* 0x3400C:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_IN_CONFIG; /* 0x34010:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_OUT_CONFIG; /* 0x34014:  */
            __W  uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_RESET; /* 0x34018:  */
            __R  uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_PARAM; /* 0x3401C:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_STRFWD; /* 0x34020:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_PORTMASK; /* 0x34024:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_MIRROR; /* 0x34028:  */
            __RW uint32_t SW_CTRL_IGRESS_RX_FDFIFO_E_MIRROR_TX; /* 0x3402C:  */
            __R  uint8_t  RESERVED0[208];      /* 0x34030 - 0x340FF: Reserved */
        } RXFIFO[2];
        __R  uint8_t  RESERVED22[15876];       /* 0x34200 - 0x38003: Reserved */
        __RW uint32_t SW_CTRL_MONITOR_CTRL;    /* 0x38004:  */
        __W  uint32_t SW_CTRL_MONITOR_RESET;   /* 0x38008:  */
        __R  uint32_t SW_CTRL_MONITOR_PARAM;   /* 0x3800C:  */
        __R  uint32_t MONITOR_TX_COUNTER_TX_FGOOD; /* 0x38010:  */
        __R  uint8_t  RESERVED23[4];           /* 0x38014 - 0x38017: Reserved */
        __R  uint32_t MONITOR_TX_COUNTER_TX_FERROR; /* 0x38018:  */
        __R  uint8_t  RESERVED24[4];           /* 0x3801C - 0x3801F: Reserved */
        __R  uint32_t MONITOR_TX_COUNTER_TX_DROP_OVFL; /* 0x38020:  */
        __R  uint8_t  RESERVED25[28];          /* 0x38024 - 0x3803F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_FGOOD; /* 0x38040:  */
        __R  uint8_t  RESERVED26[4];           /* 0x38044 - 0x38047: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_FERROR; /* 0x38048:  */
        __R  uint8_t  RESERVED27[4];           /* 0x3804C - 0x3804F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_KNOWN; /* 0x38050:  */
        __R  uint8_t  RESERVED28[4];           /* 0x38054 - 0x38057: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_UNKNOWN; /* 0x38058:  */
        __R  uint8_t  RESERVED29[4];           /* 0x3805C - 0x3805F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_UC;/* 0x38060:  */
        __R  uint8_t  RESERVED30[4];           /* 0x38064 - 0x38067: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_INTERN; /* 0x38068:  */
        __R  uint8_t  RESERVED31[4];           /* 0x3806C - 0x3806F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_BC;/* 0x38070:  */
        __R  uint8_t  RESERVED32[4];           /* 0x38074 - 0x38077: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_MULTI; /* 0x38078:  */
        __R  uint8_t  RESERVED33[4];           /* 0x3807C - 0x3807F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_VLAN; /* 0x38080:  */
        __R  uint8_t  RESERVED34[4];           /* 0x38084 - 0x38087: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_DROP_OVFL; /* 0x38088:  */
        __R  uint8_t  RESERVED35[4];           /* 0x3808C - 0x3808F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_DROP_LU; /* 0x38090:  */
        __R  uint8_t  RESERVED36[4];           /* 0x38094 - 0x38097: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_DROP_ERR; /* 0x38098:  */
        __R  uint8_t  RESERVED37[4];           /* 0x3809C - 0x3809F: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_DROP_VLAN; /* 0x380A0:  */
        __R  uint8_t  RESERVED38[4];           /* 0x380A4 - 0x380A7: Reserved */
        __R  uint32_t MONITOR_RX_COUNTER_RX_FPE_FGOOD; /* 0x380A8:  */
        __R  uint8_t  RESERVED39[16212];       /* 0x380AC - 0x3BFFF: Reserved */
        __RW uint32_t GPR_CTRL0;               /* 0x3C000: control register0 */
        __R  uint8_t  RESERVED40[4];           /* 0x3C004 - 0x3C007: Reserved */
        __RW uint32_t GPR_CTRL2;               /* 0x3C008: control register2 */
        __R  uint8_t  RESERVED41[16372];       /* 0x3C00C - 0x3FFFF: Reserved */
    } TSNPORT[3];
} TSW_Type;


/* Bitfield definition for register: LU_MAIN_CTRL */
/*
 * BYP_EN (R/W)
 *
 * MAC lookup bypass
 */
#define TSW_LU_MAIN_CTRL_BYP_EN_MASK (0x1U)
#define TSW_LU_MAIN_CTRL_BYP_EN_SHIFT (0U)
#define TSW_LU_MAIN_CTRL_BYP_EN_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_CTRL_BYP_EN_SHIFT) & TSW_LU_MAIN_CTRL_BYP_EN_MASK)
#define TSW_LU_MAIN_CTRL_BYP_EN_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_CTRL_BYP_EN_MASK) >> TSW_LU_MAIN_CTRL_BYP_EN_SHIFT)

/* Bitfield definition for register: LU_MAIN_HITMEM */
/*
 * CAMMEMCLR (R/W)
 *
 * clear the cam memory
 */
#define TSW_LU_MAIN_HITMEM_CAMMEMCLR_MASK (0x2U)
#define TSW_LU_MAIN_HITMEM_CAMMEMCLR_SHIFT (1U)
#define TSW_LU_MAIN_HITMEM_CAMMEMCLR_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_HITMEM_CAMMEMCLR_SHIFT) & TSW_LU_MAIN_HITMEM_CAMMEMCLR_MASK)
#define TSW_LU_MAIN_HITMEM_CAMMEMCLR_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_HITMEM_CAMMEMCLR_MASK) >> TSW_LU_MAIN_HITMEM_CAMMEMCLR_SHIFT)

