RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * HITMEMCLR (R/W)
 *
 * clears the hit memory
 */
#define TSW_LU_MAIN_HITMEM_HITMEMCLR_MASK (0x1U)
#define TSW_LU_MAIN_HITMEM_HITMEMCLR_SHIFT (0U)
#define TSW_LU_MAIN_HITMEM_HITMEMCLR_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_HITMEM_HITMEMCLR_SHIFT) & TSW_LU_MAIN_HITMEM_HITMEMCLR_MASK)
#define TSW_LU_MAIN_HITMEM_HITMEMCLR_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_HITMEM_HITMEMCLR_MASK) >> TSW_LU_MAIN_HITMEM_HITMEMCLR_SHIFT)

/* Bitfield definition for register: LU_MAIN_PARAM */
/*
 * NSTR (RO)
 *
 * number of supported streams
 */
#define TSW_LU_MAIN_PARAM_NSTR_MASK (0xFF00U)
#define TSW_LU_MAIN_PARAM_NSTR_SHIFT (8U)
#define TSW_LU_MAIN_PARAM_NSTR_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_PARAM_NSTR_MASK) >> TSW_LU_MAIN_PARAM_NSTR_SHIFT)

/*
 * ADDRW_ENTRY (RO)
 *
 * bit width of entry address vector
 */
#define TSW_LU_MAIN_PARAM_ADDRW_ENTRY_MASK (0xFFU)
#define TSW_LU_MAIN_PARAM_ADDRW_ENTRY_SHIFT (0U)
#define TSW_LU_MAIN_PARAM_ADDRW_ENTRY_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_PARAM_ADDRW_ENTRY_MASK) >> TSW_LU_MAIN_PARAM_ADDRW_ENTRY_SHIFT)

/* Bitfield definition for register: LU_MAIN_BYPASS */
/*
 * HIT (R/W)
 *
 * set hit bit to frame, only for debugging
 */
#define TSW_LU_MAIN_BYPASS_HIT_MASK (0x1000000UL)
#define TSW_LU_MAIN_BYPASS_HIT_SHIFT (24U)
#define TSW_LU_MAIN_BYPASS_HIT_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_BYPASS_HIT_SHIFT) & TSW_LU_MAIN_BYPASS_HIT_MASK)
#define TSW_LU_MAIN_BYPASS_HIT_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_BYPASS_HIT_MASK) >> TSW_LU_MAIN_BYPASS_HIT_SHIFT)

/*
 * UTAG (R/W)
 *
 * set internal user tag field
 */
#define TSW_LU_MAIN_BYPASS_UTAG_MASK (0xE00000UL)
#define TSW_LU_MAIN_BYPASS_UTAG_SHIFT (21U)
#define TSW_LU_MAIN_BYPASS_UTAG_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_BYPASS_UTAG_SHIFT) & TSW_LU_MAIN_BYPASS_UTAG_MASK)
#define TSW_LU_MAIN_BYPASS_UTAG_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_BYPASS_UTAG_MASK) >> TSW_LU_MAIN_BYPASS_UTAG_SHIFT)

/*
 * HIT_VLAN (R/W)
 *
 * mark frame to be vlan-tagged
 */
#define TSW_LU_MAIN_BYPASS_HIT_VLAN_MASK (0x100000UL)
#define TSW_LU_MAIN_BYPASS_HIT_VLAN_SHIFT (20U)
#define TSW_LU_MAIN_BYPASS_HIT_VLAN_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_BYPASS_HIT_VLAN_SHIFT) & TSW_LU_MAIN_BYPASS_HIT_VLAN_MASK)
#define TSW_LU_MAIN_BYPASS_HIT_VLAN_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_BYPASS_HIT_VLAN_MASK) >> TSW_LU_MAIN_BYPASS_HIT_VLAN_SHIFT)

/*
 * DROP (R/W)
 *
 * mark frame to be dropped
 */
#define TSW_LU_MAIN_BYPASS_DROP_MASK (0x80000UL)
#define TSW_LU_MAIN_BYPASS_DROP_SHIFT (19U)
#define TSW_LU_MAIN_BYPASS_DROP_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_BYPASS_DROP_SHIFT) & TSW_LU_MAIN_BYPASS_DROP_MASK)
#define TSW_LU_MAIN_BYPASS_DROP_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_BYPASS_DROP_MASK) >> TSW_LU_MAIN_BYPASS_DROP_SHIFT)

/*
 * QUEUE (R/W)
 *
 * number of configured buffer depth
 */
#define TSW_LU_MAIN_BYPASS_QUEUE_MASK (0x70000UL)
#define TSW_LU_MAIN_BYPASS_QUEUE_SHIFT (16U)
#define TSW_LU_MAIN_BYPASS_QUEUE_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_BYPASS_QUEUE_SHIFT) & TSW_LU_MAIN_BYPASS_QUEUE_MASK)
#define TSW_LU_MAIN_BYPASS_QUEUE_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_BYPASS_QUEUE_MASK) >> TSW_LU_MAIN_BYPASS_QUEUE_SHIFT)

/*
 * DEST (R/W)
 *
 * target destination ports of frame
 */
#define TSW_LU_MAIN_BYPASS_DEST_MASK (0xFFFFU)
#define TSW_LU_MAIN_BYPASS_DEST_SHIFT (0U)
#define TSW_LU_MAIN_BYPASS_DEST_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_BYPASS_DEST_SHIFT) & TSW_LU_MAIN_BYPASS_DEST_MASK)
#define TSW_LU_MAIN_BYPASS_DEST_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_BYPASS_DEST_MASK) >> TSW_LU_MAIN_BYPASS_DEST_SHIFT)

/* Bitfield definition for register: LU_MAIN_PCP_REMAP */
/*
 * PCP7 (R/W)
 *
 * queue value for PCP=7
 */
#define TSW_LU_MAIN_PCP_REMAP_PCP7_MASK (0xE00000UL)
#define TSW_LU_MAIN_PCP_REMAP_PCP7_SHIFT (21U)
#define TSW_LU_MAIN_PCP_REMAP_PCP7_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_PCP_REMAP_PCP7_SHIFT) & TSW_LU_MAIN_PCP_REMAP_PCP7_MASK)
#define TSW_LU_MAIN_PCP_REMAP_PCP7_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_PCP_REMAP_PCP7_MASK) >> TSW_LU_MAIN_PCP_REMAP_PCP7_SHIFT)

/*
 * PCP6 (R/W)
 *
 * queue value for PCP=6
 */
#define TSW_LU_MAIN_PCP_REMAP_PCP6_MASK (0x1C0000UL)
#define TSW_LU_MAIN_PCP_REMAP_PCP6_SHIFT (18U)
#define TSW_LU_MAIN_PCP_REMAP_PCP6_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_PCP_REMAP_PCP6_SHIFT) & TSW_LU_MAIN_PCP_REMAP_PCP6_MASK)
#define TSW_LU_MAIN_PCP_REMAP_PCP6_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_PCP_REMAP_PCP6_MASK) >> TSW_LU_MAIN_PCP_REMAP_PCP6_SHIFT)

/*
 * PCP5 (R/W)
 *
 * queue value for PCP=5
 */
#define TSW_LU_MAIN_PCP_REMAP_PCP5_MASK (0x38000UL)
#define TSW_LU_MAIN_PCP_REMAP_PCP5_SHIFT (15U)
#define TSW_LU_MAIN_PCP_REMAP_PCP5_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_PCP_REMAP_PCP5_SHIFT) & TSW_LU_MAIN_PCP_REMAP_PCP5_MASK)
#define TSW_LU_MAIN_PCP_REMAP_PCP5_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_PCP_REMAP_PCP5_MASK) >> TSW_LU_MAIN_PCP_REMAP_PCP5_SHIFT)

/*
 * PCP4 (R/W)
 *
 * queue value for PCP=4
 */
#define TSW_LU_MAIN_PCP_REMAP_PCP4_MASK (0x7000U)
#define TSW_LU_MAIN_PCP_REMAP_PCP4_SHIFT (12U)
#define TSW_LU_MAIN_PCP_REMAP_PCP4_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_PCP_REMAP_PCP4_SHIFT) & TSW_LU_MAIN_PCP_REMAP_PCP4_MASK)
#define TSW_LU_MAIN_PCP_REMAP_PCP4_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_PCP_REMAP_PCP4_MASK) >> TSW_LU_MAIN_PCP_REMAP_PCP4_SHIFT)

/*
 * PCP3 (R/W)
 *
 * queue value for PCP=3
 */
#define TSW_LU_MAIN_PCP_REMAP_PCP3_MASK (0xE00U)
#define TSW_LU_MAIN_PCP_REMAP_PCP3_SHIFT (9U)
#define TSW_LU_MAIN_PCP_REMAP_PCP3_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_PCP_REMAP_PCP3_SHIFT) & TSW_LU_MAIN_PCP_REMAP_PCP3_MASK)
#define TSW_LU_MAIN_PCP_REMAP_PCP3_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_PCP_REMAP_PCP3_MASK) >> TSW_LU_MAIN_PCP_REMAP_PCP3_SHIFT)

/*
 * PCP2 (R/W)
 *
 * queue value for PCP=2
 */
#define TSW_LU_MAIN_PCP_REMAP_PCP2_MASK (0x1C0U)
#define TSW_LU_MAIN_PCP_REMAP_PCP2_SHIFT (6U)
#define TSW_LU_MAIN_PCP_REMAP_PCP2_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_PCP_REMAP_PCP2_SHIFT) & TSW_LU_MAIN_PCP_REMAP_PCP2_MASK)
#define TSW_LU_MAIN_PCP_REMAP_PCP2_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_PCP_REMAP_PCP2_MASK) >> TSW_LU_MAIN_PCP_REMAP_PCP2_SHIFT)

