RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * PCP1 (R/W)
 *
 * queue value for PCP=1
 */
#define TSW_LU_MAIN_PCP_REMAP_PCP1_MASK (0x38U)
#define TSW_LU_MAIN_PCP_REMAP_PCP1_SHIFT (3U)
#define TSW_LU_MAIN_PCP_REMAP_PCP1_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_PCP_REMAP_PCP1_SHIFT) & TSW_LU_MAIN_PCP_REMAP_PCP1_MASK)
#define TSW_LU_MAIN_PCP_REMAP_PCP1_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_PCP_REMAP_PCP1_MASK) >> TSW_LU_MAIN_PCP_REMAP_PCP1_SHIFT)

/*
 * PCP0 (R/W)
 *
 * queue value for PCP=0
 */
#define TSW_LU_MAIN_PCP_REMAP_PCP0_MASK (0x7U)
#define TSW_LU_MAIN_PCP_REMAP_PCP0_SHIFT (0U)
#define TSW_LU_MAIN_PCP_REMAP_PCP0_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_PCP_REMAP_PCP0_SHIFT) & TSW_LU_MAIN_PCP_REMAP_PCP0_MASK)
#define TSW_LU_MAIN_PCP_REMAP_PCP0_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_PCP_REMAP_PCP0_MASK) >> TSW_LU_MAIN_PCP_REMAP_PCP0_SHIFT)

/* Bitfield definition for register: LU_MAIN_VERSION */
/*
 * VER_HI (RO)
 *
 * major version
 */
#define TSW_LU_MAIN_VERSION_VER_HI_MASK (0xFF000000UL)
#define TSW_LU_MAIN_VERSION_VER_HI_SHIFT (24U)
#define TSW_LU_MAIN_VERSION_VER_HI_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_VERSION_VER_HI_MASK) >> TSW_LU_MAIN_VERSION_VER_HI_SHIFT)

/*
 * VER_LO (RO)
 *
 * minor version
 */
#define TSW_LU_MAIN_VERSION_VER_LO_MASK (0xFF0000UL)
#define TSW_LU_MAIN_VERSION_VER_LO_SHIFT (16U)
#define TSW_LU_MAIN_VERSION_VER_LO_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_VERSION_VER_LO_MASK) >> TSW_LU_MAIN_VERSION_VER_LO_SHIFT)

/*
 * VER_REV (RO)
 *
 * revision number
 */
#define TSW_LU_MAIN_VERSION_VER_REV_MASK (0xFFU)
#define TSW_LU_MAIN_VERSION_VER_REV_SHIFT (0U)
#define TSW_LU_MAIN_VERSION_VER_REV_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_VERSION_VER_REV_MASK) >> TSW_LU_MAIN_VERSION_VER_REV_SHIFT)

/* Bitfield definition for register: LU_MAIN_INTF_ACTION */
/*
 * UTAG (R/W)
 *
 * TSN user sideband information from ALMEM
 */
#define TSW_LU_MAIN_INTF_ACTION_UTAG_MASK (0x1C00000UL)
#define TSW_LU_MAIN_INTF_ACTION_UTAG_SHIFT (22U)
#define TSW_LU_MAIN_INTF_ACTION_UTAG_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_INTF_ACTION_UTAG_SHIFT) & TSW_LU_MAIN_INTF_ACTION_UTAG_MASK)
#define TSW_LU_MAIN_INTF_ACTION_UTAG_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_INTF_ACTION_UTAG_MASK) >> TSW_LU_MAIN_INTF_ACTION_UTAG_SHIFT)

/*
 * QSEL (R/W)
 *
 * Define the traffic queue selection:
 * 00 – use PCP field of VLAN, untagged frames use PCP of PVID
 * 01 – use PCP field with global remapping list
 * 10 – reserved
 * 11 – use value QUEUE of Action List
 */
#define TSW_LU_MAIN_INTF_ACTION_QSEL_MASK (0x300000UL)
#define TSW_LU_MAIN_INTF_ACTION_QSEL_SHIFT (20U)
#define TSW_LU_MAIN_INTF_ACTION_QSEL_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_INTF_ACTION_QSEL_SHIFT) & TSW_LU_MAIN_INTF_ACTION_QSEL_MASK)
#define TSW_LU_MAIN_INTF_ACTION_QSEL_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_INTF_ACTION_QSEL_MASK) >> TSW_LU_MAIN_INTF_ACTION_QSEL_SHIFT)

/*
 * DROP (R/W)
 *
 * 1 if frame should be dropped.
 */
#define TSW_LU_MAIN_INTF_ACTION_DROP_MASK (0x80000UL)
#define TSW_LU_MAIN_INTF_ACTION_DROP_SHIFT (19U)
#define TSW_LU_MAIN_INTF_ACTION_DROP_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_INTF_ACTION_DROP_SHIFT) & TSW_LU_MAIN_INTF_ACTION_DROP_MASK)
#define TSW_LU_MAIN_INTF_ACTION_DROP_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_INTF_ACTION_DROP_MASK) >> TSW_LU_MAIN_INTF_ACTION_DROP_SHIFT)

/*
 * QUEUE (R/W)
 *
 * Select the Priority Queue for TSN TX, only used if QSEL=11
 */
#define TSW_LU_MAIN_INTF_ACTION_QUEUE_MASK (0x70000UL)
#define TSW_LU_MAIN_INTF_ACTION_QUEUE_SHIFT (16U)
#define TSW_LU_MAIN_INTF_ACTION_QUEUE_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_INTF_ACTION_QUEUE_SHIFT) & TSW_LU_MAIN_INTF_ACTION_QUEUE_MASK)
#define TSW_LU_MAIN_INTF_ACTION_QUEUE_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_INTF_ACTION_QUEUE_MASK) >> TSW_LU_MAIN_INTF_ACTION_QUEUE_SHIFT)

/*
 * DEST (R/W)
 *
 * Select the destination ports of forwarded frame. It is coded in onehot/select way,
 * where 0 is always route to null. Every bit is mapped to a port.
 * 00000 – to null (frame to clear)
 * 00001 – to port 0 (CPU Port)
 * 00010 – to port 1
 * 00100 – to port 2
 * 01000 – to port 3
 */
#define TSW_LU_MAIN_INTF_ACTION_DEST_MASK (0xFFFFU)
#define TSW_LU_MAIN_INTF_ACTION_DEST_SHIFT (0U)
#define TSW_LU_MAIN_INTF_ACTION_DEST_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_INTF_ACTION_DEST_SHIFT) & TSW_LU_MAIN_INTF_ACTION_DEST_MASK)
#define TSW_LU_MAIN_INTF_ACTION_DEST_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_INTF_ACTION_DEST_MASK) >> TSW_LU_MAIN_INTF_ACTION_DEST_SHIFT)

/* Bitfield definition for register: LU_MAIN_BC_ACTION */
/*
 * UTAG (R/W)
 *
 * TSN user sideband information from ALMEM
 */
#define TSW_LU_MAIN_BC_ACTION_UTAG_MASK (0x1C00000UL)
#define TSW_LU_MAIN_BC_ACTION_UTAG_SHIFT (22U)
#define TSW_LU_MAIN_BC_ACTION_UTAG_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_BC_ACTION_UTAG_SHIFT) & TSW_LU_MAIN_BC_ACTION_UTAG_MASK)
#define TSW_LU_MAIN_BC_ACTION_UTAG_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_BC_ACTION_UTAG_MASK) >> TSW_LU_MAIN_BC_ACTION_UTAG_SHIFT)

/*
 * QSEL (R/W)
 *
 * Define the traffic queue selection:
 * 00 – use PCP field of VLAN, untagged frames use PCP of PVID
 * 01 – use PCP field with global remapping list
 * 10 – reserved
 * 11 – use value QUEUE of Action List
 */
#define TSW_LU_MAIN_BC_ACTION_QSEL_MASK (0x300000UL)
#define TSW_LU_MAIN_BC_ACTION_QSEL_SHIFT (20U)
#define TSW_LU_MAIN_BC_ACTION_QSEL_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_BC_ACTION_QSEL_SHIFT) & TSW_LU_MAIN_BC_ACTION_QSEL_MASK)
#define TSW_LU_MAIN_BC_ACTION_QSEL_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_BC_ACTION_QSEL_MASK) >> TSW_LU_MAIN_BC_ACTION_QSEL_SHIFT)

/*
 * DROP (R/W)
 *
 * 1 if frame should be dropped.
 */
#define TSW_LU_MAIN_BC_ACTION_DROP_MASK (0x80000UL)
#define TSW_LU_MAIN_BC_ACTION_DROP_SHIFT (19U)
#define TSW_LU_MAIN_BC_ACTION_DROP_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_BC_ACTION_DROP_SHIFT) & TSW_LU_MAIN_BC_ACTION_DROP_MASK)
#define TSW_LU_MAIN_BC_ACTION_DROP_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_BC_ACTION_DROP_MASK) >> TSW_LU_MAIN_BC_ACTION_DROP_SHIFT)

/*
 * QUEUE (R/W)
 *
 * Select the Priority Queue for TSN TX, only used if QSEL=11
 */
#define TSW_LU_MAIN_BC_ACTION_QUEUE_MASK (0x70000UL)
#define TSW_LU_MAIN_BC_ACTION_QUEUE_SHIFT (16U)
#define TSW_LU_MAIN_BC_ACTION_QUEUE_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_BC_ACTION_QUEUE_SHIFT) & TSW_LU_MAIN_BC_ACTION_QUEUE_MASK)
#define TSW_LU_MAIN_BC_ACTION_QUEUE_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_BC_ACTION_QUEUE_MASK) >> TSW_LU_MAIN_BC_ACTION_QUEUE_SHIFT)

