RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * DEST (R/W)
 *
 * Select the destination ports of forwarded frame. It is coded in onehot/select way,
 * where 0 is always route to null. Every bit is mapped to a port.
 * 00000 – to null (frame to clear)
 * 00001 – to port 0 (CPU Port)
 * 00010 – to port 1
 * 00100 – to port 2
 * 01000 – to port 3
 */
#define TSW_LU_MAIN_BC_ACTION_DEST_MASK (0xFFFFU)
#define TSW_LU_MAIN_BC_ACTION_DEST_SHIFT (0U)
#define TSW_LU_MAIN_BC_ACTION_DEST_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_BC_ACTION_DEST_SHIFT) & TSW_LU_MAIN_BC_ACTION_DEST_MASK)
#define TSW_LU_MAIN_BC_ACTION_DEST_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_BC_ACTION_DEST_MASK) >> TSW_LU_MAIN_BC_ACTION_DEST_SHIFT)

/* Bitfield definition for register: LU_MAIN_NN_ACTION */
/*
 * UTAG (R/W)
 *
 * TSN user sideband information from ALMEM
 */
#define TSW_LU_MAIN_NN_ACTION_UTAG_MASK (0x1C00000UL)
#define TSW_LU_MAIN_NN_ACTION_UTAG_SHIFT (22U)
#define TSW_LU_MAIN_NN_ACTION_UTAG_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_NN_ACTION_UTAG_SHIFT) & TSW_LU_MAIN_NN_ACTION_UTAG_MASK)
#define TSW_LU_MAIN_NN_ACTION_UTAG_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_NN_ACTION_UTAG_MASK) >> TSW_LU_MAIN_NN_ACTION_UTAG_SHIFT)

/*
 * QSEL (R/W)
 *
 * Define the traffic queue selection:
 * 00 – use PCP field of VLAN, untagged frames use PCP of PVID
 * 01 – use PCP field with global remapping list
 * 10 – reserved
 * 11 – use value QUEUE of Action List
 */
#define TSW_LU_MAIN_NN_ACTION_QSEL_MASK (0x300000UL)
#define TSW_LU_MAIN_NN_ACTION_QSEL_SHIFT (20U)
#define TSW_LU_MAIN_NN_ACTION_QSEL_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_NN_ACTION_QSEL_SHIFT) & TSW_LU_MAIN_NN_ACTION_QSEL_MASK)
#define TSW_LU_MAIN_NN_ACTION_QSEL_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_NN_ACTION_QSEL_MASK) >> TSW_LU_MAIN_NN_ACTION_QSEL_SHIFT)

/*
 * DROP (R/W)
 *
 * 1 if frame should be dropped.
 */
#define TSW_LU_MAIN_NN_ACTION_DROP_MASK (0x80000UL)
#define TSW_LU_MAIN_NN_ACTION_DROP_SHIFT (19U)
#define TSW_LU_MAIN_NN_ACTION_DROP_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_NN_ACTION_DROP_SHIFT) & TSW_LU_MAIN_NN_ACTION_DROP_MASK)
#define TSW_LU_MAIN_NN_ACTION_DROP_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_NN_ACTION_DROP_MASK) >> TSW_LU_MAIN_NN_ACTION_DROP_SHIFT)

/*
 * QUEUE (R/W)
 *
 * Select the Priority Queue for TSN TX, only used if QSEL=11
 */
#define TSW_LU_MAIN_NN_ACTION_QUEUE_MASK (0x70000UL)
#define TSW_LU_MAIN_NN_ACTION_QUEUE_SHIFT (16U)
#define TSW_LU_MAIN_NN_ACTION_QUEUE_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_NN_ACTION_QUEUE_SHIFT) & TSW_LU_MAIN_NN_ACTION_QUEUE_MASK)
#define TSW_LU_MAIN_NN_ACTION_QUEUE_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_NN_ACTION_QUEUE_MASK) >> TSW_LU_MAIN_NN_ACTION_QUEUE_SHIFT)

/*
 * DEST (R/W)
 *
 * Select the destination ports of forwarded frame. It is coded in onehot/select way,
 * where 0 is always route to null. Every bit is mapped to a port.
 * 00000 – to null (frame to clear)
 * 00001 – to port 0 (CPU Port)
 * 00010 – to port 1
 * 00100 – to port 2
 * 01000 – to port 3
 */
#define TSW_LU_MAIN_NN_ACTION_DEST_MASK (0xFFFFU)
#define TSW_LU_MAIN_NN_ACTION_DEST_SHIFT (0U)
#define TSW_LU_MAIN_NN_ACTION_DEST_SET(x) (((uint32_t)(x) << TSW_LU_MAIN_NN_ACTION_DEST_SHIFT) & TSW_LU_MAIN_NN_ACTION_DEST_MASK)
#define TSW_LU_MAIN_NN_ACTION_DEST_GET(x) (((uint32_t)(x) & TSW_LU_MAIN_NN_ACTION_DEST_MASK) >> TSW_LU_MAIN_NN_ACTION_DEST_SHIFT)

/* Bitfield definition for register: APB2AXIS_CAM_STS */
/*
 * BUSY (RO)
 *
 * the controller is writing data and/or data is pending
 */
#define TSW_APB2AXIS_CAM_STS_BUSY_MASK (0x2U)
#define TSW_APB2AXIS_CAM_STS_BUSY_SHIFT (1U)
#define TSW_APB2AXIS_CAM_STS_BUSY_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_CAM_STS_BUSY_MASK) >> TSW_APB2AXIS_CAM_STS_BUSY_SHIFT)

/*
 * RDY (RO)
 *
 * the new data is written to data register
 */
#define TSW_APB2AXIS_CAM_STS_RDY_MASK (0x1U)
#define TSW_APB2AXIS_CAM_STS_RDY_SHIFT (0U)
#define TSW_APB2AXIS_CAM_STS_RDY_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_CAM_STS_RDY_MASK) >> TSW_APB2AXIS_CAM_STS_RDY_SHIFT)

/* Bitfield definition for register: APB2AXIS_CAM_REQ_CNT */
/*
 * WRCNT (RO)
 *
 * number of streams in queue
 */
#define TSW_APB2AXIS_CAM_REQ_CNT_WRCNT_MASK (0xFFU)
#define TSW_APB2AXIS_CAM_REQ_CNT_WRCNT_SHIFT (0U)
#define TSW_APB2AXIS_CAM_REQ_CNT_WRCNT_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_CAM_REQ_CNT_WRCNT_MASK) >> TSW_APB2AXIS_CAM_REQ_CNT_WRCNT_SHIFT)

/* Bitfield definition for register: APB2AXIS_CAM_FILLSTS */
/*
 * FULL (RO)
 *
 * frame was dropped because the internal descriptor FIFO is full
 */
#define TSW_APB2AXIS_CAM_FILLSTS_FULL_MASK (0x10U)
#define TSW_APB2AXIS_CAM_FILLSTS_FULL_SHIFT (4U)
#define TSW_APB2AXIS_CAM_FILLSTS_FULL_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_CAM_FILLSTS_FULL_MASK) >> TSW_APB2AXIS_CAM_FILLSTS_FULL_SHIFT)

/*
 * EMPTY (RO)
 *
 * FD FIFO failure, internal controller lost synchronization
 */
#define TSW_APB2AXIS_CAM_FILLSTS_EMPTY_MASK (0x1U)
#define TSW_APB2AXIS_CAM_FILLSTS_EMPTY_SHIFT (0U)
#define TSW_APB2AXIS_CAM_FILLSTS_EMPTY_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_CAM_FILLSTS_EMPTY_MASK) >> TSW_APB2AXIS_CAM_FILLSTS_EMPTY_SHIFT)

/* Bitfield definition for register: APB2AXIS_CAM_RESET */
/*
 * RESET (W1C)
 *
 * resets controller and clears all pending stream data
 */
#define TSW_APB2AXIS_CAM_RESET_RESET_MASK (0x1U)
#define TSW_APB2AXIS_CAM_RESET_RESET_SHIFT (0U)
#define TSW_APB2AXIS_CAM_RESET_RESET_SET(x) (((uint32_t)(x) << TSW_APB2AXIS_CAM_RESET_RESET_SHIFT) & TSW_APB2AXIS_CAM_RESET_RESET_MASK)
#define TSW_APB2AXIS_CAM_RESET_RESET_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_CAM_RESET_RESET_MASK) >> TSW_APB2AXIS_CAM_RESET_RESET_SHIFT)

/* Bitfield definition for register: APB2AXIS_CAM_PARAM */
/*
 * DEPTH (RO)
 *
 * number of configured buffer depth
 */
#define TSW_APB2AXIS_CAM_PARAM_DEPTH_MASK (0xFF00U)
#define TSW_APB2AXIS_CAM_PARAM_DEPTH_SHIFT (8U)
#define TSW_APB2AXIS_CAM_PARAM_DEPTH_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_CAM_PARAM_DEPTH_MASK) >> TSW_APB2AXIS_CAM_PARAM_DEPTH_SHIFT)

/*
 * WORDLEN_BYTE (RO)
 *
 * number of configured 32bit words for this controller
 */
#define TSW_APB2AXIS_CAM_PARAM_WORDLEN_BYTE_MASK (0xFFU)
#define TSW_APB2AXIS_CAM_PARAM_WORDLEN_BYTE_SHIFT (0U)
#define TSW_APB2AXIS_CAM_PARAM_WORDLEN_BYTE_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_CAM_PARAM_WORDLEN_BYTE_MASK) >> TSW_APB2AXIS_CAM_PARAM_WORDLEN_BYTE_SHIFT)

/* Bitfield definition for register: APB2AXI_CAM_REQDATA_0 */
/*
 * ENTRY_NUM (R/W)
 *
 * entry number
 */
#define TSW_APB2AXI_CAM_REQDATA_0_ENTRY_NUM_MASK (0xFFFF0000UL)
#define TSW_APB2AXI_CAM_REQDATA_0_ENTRY_NUM_SHIFT (16U)
#define TSW_APB2AXI_CAM_REQDATA_0_ENTRY_NUM_SET(x) (((uint32_t)(x) << TSW_APB2AXI_CAM_REQDATA_0_ENTRY_NUM_SHIFT) & TSW_APB2AXI_CAM_REQDATA_0_ENTRY_NUM_MASK)
#define TSW_APB2AXI_CAM_REQDATA_0_ENTRY_NUM_GET(x) (((uint32_t)(x) & TSW_APB2AXI_CAM_REQDATA_0_ENTRY_NUM_MASK) >> TSW_APB2AXI_CAM_REQDATA_0_ENTRY_NUM_SHIFT)

