RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * TYPE (R/W)
 *
 * select between set, clear or clear all
 */
#define TSW_APB2AXI_CAM_REQDATA_0_TYPE_MASK (0x300U)
#define TSW_APB2AXI_CAM_REQDATA_0_TYPE_SHIFT (8U)
#define TSW_APB2AXI_CAM_REQDATA_0_TYPE_SET(x) (((uint32_t)(x) << TSW_APB2AXI_CAM_REQDATA_0_TYPE_SHIFT) & TSW_APB2AXI_CAM_REQDATA_0_TYPE_MASK)
#define TSW_APB2AXI_CAM_REQDATA_0_TYPE_GET(x) (((uint32_t)(x) & TSW_APB2AXI_CAM_REQDATA_0_TYPE_MASK) >> TSW_APB2AXI_CAM_REQDATA_0_TYPE_SHIFT)

/*
 * CH (R/W)
 *
 * CAM APB2AXIS channel selection
 */
#define TSW_APB2AXI_CAM_REQDATA_0_CH_MASK (0x1U)
#define TSW_APB2AXI_CAM_REQDATA_0_CH_SHIFT (0U)
#define TSW_APB2AXI_CAM_REQDATA_0_CH_SET(x) (((uint32_t)(x) << TSW_APB2AXI_CAM_REQDATA_0_CH_SHIFT) & TSW_APB2AXI_CAM_REQDATA_0_CH_MASK)
#define TSW_APB2AXI_CAM_REQDATA_0_CH_GET(x) (((uint32_t)(x) & TSW_APB2AXI_CAM_REQDATA_0_CH_MASK) >> TSW_APB2AXI_CAM_REQDATA_0_CH_SHIFT)

/* Bitfield definition for register: APB2AXI_CAM_REQDATA_1 */
/*
 * DESTMAC_LO_PORT_VEC (R/W)
 *
 * dest-mac[31:0] when CH=0；PORT_VEC when CH=1
 */
#define TSW_APB2AXI_CAM_REQDATA_1_DESTMAC_LO_PORT_VEC_MASK (0xFFFFFFFFUL)
#define TSW_APB2AXI_CAM_REQDATA_1_DESTMAC_LO_PORT_VEC_SHIFT (0U)
#define TSW_APB2AXI_CAM_REQDATA_1_DESTMAC_LO_PORT_VEC_SET(x) (((uint32_t)(x) << TSW_APB2AXI_CAM_REQDATA_1_DESTMAC_LO_PORT_VEC_SHIFT) & TSW_APB2AXI_CAM_REQDATA_1_DESTMAC_LO_PORT_VEC_MASK)
#define TSW_APB2AXI_CAM_REQDATA_1_DESTMAC_LO_PORT_VEC_GET(x) (((uint32_t)(x) & TSW_APB2AXI_CAM_REQDATA_1_DESTMAC_LO_PORT_VEC_MASK) >> TSW_APB2AXI_CAM_REQDATA_1_DESTMAC_LO_PORT_VEC_SHIFT)

/* Bitfield definition for register: APB2AXI_CAM_REQDATA_2 */
/*
 * VID (R/W)
 *
 * VLAN-ID value (12 bit) for the VLAN_ID table. Use the fefault VLAN-ID(VID=1), if setup an entry for non-VLAN traffic.
 */
#define TSW_APB2AXI_CAM_REQDATA_2_VID_MASK (0xFFF0000UL)
#define TSW_APB2AXI_CAM_REQDATA_2_VID_SHIFT (16U)
#define TSW_APB2AXI_CAM_REQDATA_2_VID_SET(x) (((uint32_t)(x) << TSW_APB2AXI_CAM_REQDATA_2_VID_SHIFT) & TSW_APB2AXI_CAM_REQDATA_2_VID_MASK)
#define TSW_APB2AXI_CAM_REQDATA_2_VID_GET(x) (((uint32_t)(x) & TSW_APB2AXI_CAM_REQDATA_2_VID_MASK) >> TSW_APB2AXI_CAM_REQDATA_2_VID_SHIFT)

/*
 * DESTMAC_HI (R/W)
 *
 * dest-mac[47:32] when CH=0
 */
#define TSW_APB2AXI_CAM_REQDATA_2_DESTMAC_HI_MASK (0xFFFFU)
#define TSW_APB2AXI_CAM_REQDATA_2_DESTMAC_HI_SHIFT (0U)
#define TSW_APB2AXI_CAM_REQDATA_2_DESTMAC_HI_SET(x) (((uint32_t)(x) << TSW_APB2AXI_CAM_REQDATA_2_DESTMAC_HI_SHIFT) & TSW_APB2AXI_CAM_REQDATA_2_DESTMAC_HI_MASK)
#define TSW_APB2AXI_CAM_REQDATA_2_DESTMAC_HI_GET(x) (((uint32_t)(x) & TSW_APB2AXI_CAM_REQDATA_2_DESTMAC_HI_MASK) >> TSW_APB2AXI_CAM_REQDATA_2_DESTMAC_HI_SHIFT)

/* Bitfield definition for register: APB2AXIS_ALMEM_STS */
/*
 * BUSY (RO)
 *
 * the controller is writing data and/or data is pending
 */
#define TSW_APB2AXIS_ALMEM_STS_BUSY_MASK (0x2U)
#define TSW_APB2AXIS_ALMEM_STS_BUSY_SHIFT (1U)
#define TSW_APB2AXIS_ALMEM_STS_BUSY_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_ALMEM_STS_BUSY_MASK) >> TSW_APB2AXIS_ALMEM_STS_BUSY_SHIFT)

/*
 * RDY (RO)
 *
 * the new data is written to data register
 */
#define TSW_APB2AXIS_ALMEM_STS_RDY_MASK (0x1U)
#define TSW_APB2AXIS_ALMEM_STS_RDY_SHIFT (0U)
#define TSW_APB2AXIS_ALMEM_STS_RDY_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_ALMEM_STS_RDY_MASK) >> TSW_APB2AXIS_ALMEM_STS_RDY_SHIFT)

/* Bitfield definition for register: APB2AXIS_ALMEM_REQ_CNT */
/*
 * WRCNT (RO)
 *
 * number of streams in queue
 */
#define TSW_APB2AXIS_ALMEM_REQ_CNT_WRCNT_MASK (0xFFU)
#define TSW_APB2AXIS_ALMEM_REQ_CNT_WRCNT_SHIFT (0U)
#define TSW_APB2AXIS_ALMEM_REQ_CNT_WRCNT_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_ALMEM_REQ_CNT_WRCNT_MASK) >> TSW_APB2AXIS_ALMEM_REQ_CNT_WRCNT_SHIFT)

/* Bitfield definition for register: APB2AXIS_ALMEM_FILLSTS */
/*
 * FULL (RO)
 *
 * frame was dropped because the internal descriptor FIFO is full
 */
#define TSW_APB2AXIS_ALMEM_FILLSTS_FULL_MASK (0x10U)
#define TSW_APB2AXIS_ALMEM_FILLSTS_FULL_SHIFT (4U)
#define TSW_APB2AXIS_ALMEM_FILLSTS_FULL_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_ALMEM_FILLSTS_FULL_MASK) >> TSW_APB2AXIS_ALMEM_FILLSTS_FULL_SHIFT)

/*
 * EMPTY (RO)
 *
 * FD FIFO failure, internal controller lost synchronization
 */
#define TSW_APB2AXIS_ALMEM_FILLSTS_EMPTY_MASK (0x1U)
#define TSW_APB2AXIS_ALMEM_FILLSTS_EMPTY_SHIFT (0U)
#define TSW_APB2AXIS_ALMEM_FILLSTS_EMPTY_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_ALMEM_FILLSTS_EMPTY_MASK) >> TSW_APB2AXIS_ALMEM_FILLSTS_EMPTY_SHIFT)

/* Bitfield definition for register: APB2AXIS_ALMEM_RESET */
/*
 * RESET (W1C)
 *
 * resets controller and clears all pending stream data
 */
#define TSW_APB2AXIS_ALMEM_RESET_RESET_MASK (0x1U)
#define TSW_APB2AXIS_ALMEM_RESET_RESET_SHIFT (0U)
#define TSW_APB2AXIS_ALMEM_RESET_RESET_SET(x) (((uint32_t)(x) << TSW_APB2AXIS_ALMEM_RESET_RESET_SHIFT) & TSW_APB2AXIS_ALMEM_RESET_RESET_MASK)
#define TSW_APB2AXIS_ALMEM_RESET_RESET_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_ALMEM_RESET_RESET_MASK) >> TSW_APB2AXIS_ALMEM_RESET_RESET_SHIFT)

/* Bitfield definition for register: APB2AXIS_ALMEM_PARAM */
/*
 * DEPTH (RO)
 *
 * number of configured buffer depth
 */
#define TSW_APB2AXIS_ALMEM_PARAM_DEPTH_MASK (0xFF00U)
#define TSW_APB2AXIS_ALMEM_PARAM_DEPTH_SHIFT (8U)
#define TSW_APB2AXIS_ALMEM_PARAM_DEPTH_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_ALMEM_PARAM_DEPTH_MASK) >> TSW_APB2AXIS_ALMEM_PARAM_DEPTH_SHIFT)

/*
 * WORDLEN_BYTE (RO)
 *
 * number of configured 32bit words for this controller
 */
#define TSW_APB2AXIS_ALMEM_PARAM_WORDLEN_BYTE_MASK (0xFFU)
#define TSW_APB2AXIS_ALMEM_PARAM_WORDLEN_BYTE_SHIFT (0U)
#define TSW_APB2AXIS_ALMEM_PARAM_WORDLEN_BYTE_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_ALMEM_PARAM_WORDLEN_BYTE_MASK) >> TSW_APB2AXIS_ALMEM_PARAM_WORDLEN_BYTE_SHIFT)

/* Bitfield definition for register: APB2AXIS_ALMEM_REQDATA_0 */
/*
 * UTAG (R/W)
 *
 * user sideband information
 */
#define TSW_APB2AXIS_ALMEM_REQDATA_0_UTAG_MASK (0x1C00000UL)
#define TSW_APB2AXIS_ALMEM_REQDATA_0_UTAG_SHIFT (22U)
#define TSW_APB2AXIS_ALMEM_REQDATA_0_UTAG_SET(x) (((uint32_t)(x) << TSW_APB2AXIS_ALMEM_REQDATA_0_UTAG_SHIFT) & TSW_APB2AXIS_ALMEM_REQDATA_0_UTAG_MASK)
#define TSW_APB2AXIS_ALMEM_REQDATA_0_UTAG_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_ALMEM_REQDATA_0_UTAG_MASK) >> TSW_APB2AXIS_ALMEM_REQDATA_0_UTAG_SHIFT)

