RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * WORDLEN_BYTE (RO)
 *
 * number of configured 32bit for this controller
 */
#define TSW_AXIS2APB_ALMEM_PARAM_WORDLEN_BYTE_MASK (0xFFU)
#define TSW_AXIS2APB_ALMEM_PARAM_WORDLEN_BYTE_SHIFT (0U)
#define TSW_AXIS2APB_ALMEM_PARAM_WORDLEN_BYTE_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_ALMEM_PARAM_WORDLEN_BYTE_MASK) >> TSW_AXIS2APB_ALMEM_PARAM_WORDLEN_BYTE_SHIFT)

/* Bitfield definition for register: AXIS2APB_ALMEM_RESPDATA_0 */
/*
 * UTAG (R/W)
 *
 * user sideband information
 */
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_UTAG_MASK (0x1C00000UL)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_UTAG_SHIFT (22U)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_UTAG_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_ALMEM_RESPDATA_0_UTAG_SHIFT) & TSW_AXIS2APB_ALMEM_RESPDATA_0_UTAG_MASK)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_UTAG_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_ALMEM_RESPDATA_0_UTAG_MASK) >> TSW_AXIS2APB_ALMEM_RESPDATA_0_UTAG_SHIFT)

/*
 * QSEL (R/W)
 *
 * define the traffic queue selection
 */
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_QSEL_MASK (0x300000UL)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_QSEL_SHIFT (20U)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_QSEL_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_ALMEM_RESPDATA_0_QSEL_SHIFT) & TSW_AXIS2APB_ALMEM_RESPDATA_0_QSEL_MASK)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_QSEL_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_ALMEM_RESPDATA_0_QSEL_MASK) >> TSW_AXIS2APB_ALMEM_RESPDATA_0_QSEL_SHIFT)

/*
 * DROP (R/W)
 *
 * frame should dropped
 */
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_DROP_MASK (0x80000UL)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_DROP_SHIFT (19U)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_DROP_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_ALMEM_RESPDATA_0_DROP_SHIFT) & TSW_AXIS2APB_ALMEM_RESPDATA_0_DROP_MASK)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_DROP_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_ALMEM_RESPDATA_0_DROP_MASK) >> TSW_AXIS2APB_ALMEM_RESPDATA_0_DROP_SHIFT)

/*
 * QUEUE (R/W)
 *
 * select the priority queue if qsel=11
 */
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_QUEUE_MASK (0x70000UL)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_QUEUE_SHIFT (16U)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_QUEUE_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_ALMEM_RESPDATA_0_QUEUE_SHIFT) & TSW_AXIS2APB_ALMEM_RESPDATA_0_QUEUE_MASK)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_QUEUE_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_ALMEM_RESPDATA_0_QUEUE_MASK) >> TSW_AXIS2APB_ALMEM_RESPDATA_0_QUEUE_SHIFT)

/*
 * DEST (R/W)
 *
 * destination ports
 */
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_DEST_MASK (0xFFFFU)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_DEST_SHIFT (0U)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_DEST_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_ALMEM_RESPDATA_0_DEST_SHIFT) & TSW_AXIS2APB_ALMEM_RESPDATA_0_DEST_MASK)
#define TSW_AXIS2APB_ALMEM_RESPDATA_0_DEST_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_ALMEM_RESPDATA_0_DEST_MASK) >> TSW_AXIS2APB_ALMEM_RESPDATA_0_DEST_SHIFT)

/* Bitfield definition for register: AXIS2APB_ALMEM_RESPDATA_1 */
/*
 * WR_NRD (R/W)
 *
 * 1 for write and 0 for read
 */
#define TSW_AXIS2APB_ALMEM_RESPDATA_1_WR_NRD_MASK (0x80000000UL)
#define TSW_AXIS2APB_ALMEM_RESPDATA_1_WR_NRD_SHIFT (31U)
#define TSW_AXIS2APB_ALMEM_RESPDATA_1_WR_NRD_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_ALMEM_RESPDATA_1_WR_NRD_SHIFT) & TSW_AXIS2APB_ALMEM_RESPDATA_1_WR_NRD_MASK)
#define TSW_AXIS2APB_ALMEM_RESPDATA_1_WR_NRD_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_ALMEM_RESPDATA_1_WR_NRD_MASK) >> TSW_AXIS2APB_ALMEM_RESPDATA_1_WR_NRD_SHIFT)

/*
 * RESP (R/W)
 *
 * write response enable
 */
#define TSW_AXIS2APB_ALMEM_RESPDATA_1_RESP_MASK (0x40000000UL)
#define TSW_AXIS2APB_ALMEM_RESPDATA_1_RESP_SHIFT (30U)
#define TSW_AXIS2APB_ALMEM_RESPDATA_1_RESP_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_ALMEM_RESPDATA_1_RESP_SHIFT) & TSW_AXIS2APB_ALMEM_RESPDATA_1_RESP_MASK)
#define TSW_AXIS2APB_ALMEM_RESPDATA_1_RESP_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_ALMEM_RESPDATA_1_RESP_MASK) >> TSW_AXIS2APB_ALMEM_RESPDATA_1_RESP_SHIFT)

/*
 * ENTRY_NUM (R/W)
 *
 * define the entry number for reading and writing
 */
#define TSW_AXIS2APB_ALMEM_RESPDATA_1_ENTRY_NUM_MASK (0xFFFFU)
#define TSW_AXIS2APB_ALMEM_RESPDATA_1_ENTRY_NUM_SHIFT (0U)
#define TSW_AXIS2APB_ALMEM_RESPDATA_1_ENTRY_NUM_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_ALMEM_RESPDATA_1_ENTRY_NUM_SHIFT) & TSW_AXIS2APB_ALMEM_RESPDATA_1_ENTRY_NUM_MASK)
#define TSW_AXIS2APB_ALMEM_RESPDATA_1_ENTRY_NUM_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_ALMEM_RESPDATA_1_ENTRY_NUM_MASK) >> TSW_AXIS2APB_ALMEM_RESPDATA_1_ENTRY_NUM_SHIFT)

/* Bitfield definition for register array: HITMEM */
/*
 * HITMEM_REG (RW)
 *
 * Every bit represents a lookup entry starting with bit 0
 * as entry 0. The memory can be written and cleared by the host system via common memory-mapped
 * bus access.
 */
#define TSW_HITMEM_HITMEM_REG_MASK (0xFFFFFFFFUL)
#define TSW_HITMEM_HITMEM_REG_SHIFT (0U)
#define TSW_HITMEM_HITMEM_REG_SET(x) (((uint32_t)(x) << TSW_HITMEM_HITMEM_REG_SHIFT) & TSW_HITMEM_HITMEM_REG_MASK)
#define TSW_HITMEM_HITMEM_REG_GET(x) (((uint32_t)(x) & TSW_HITMEM_HITMEM_REG_MASK) >> TSW_HITMEM_HITMEM_REG_SHIFT)

/* Bitfield definition for register: APB2AXIS_LOOKUP_STS */
/*
 * BUSY (RO)
 *
 * the controller is writing data and/or data is pending
 */
#define TSW_APB2AXIS_LOOKUP_STS_BUSY_MASK (0x2U)
#define TSW_APB2AXIS_LOOKUP_STS_BUSY_SHIFT (1U)
#define TSW_APB2AXIS_LOOKUP_STS_BUSY_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_LOOKUP_STS_BUSY_MASK) >> TSW_APB2AXIS_LOOKUP_STS_BUSY_SHIFT)

/*
 * RDY (RO)
 *
 * the new data is written to data register
 */
#define TSW_APB2AXIS_LOOKUP_STS_RDY_MASK (0x1U)
#define TSW_APB2AXIS_LOOKUP_STS_RDY_SHIFT (0U)
#define TSW_APB2AXIS_LOOKUP_STS_RDY_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_LOOKUP_STS_RDY_MASK) >> TSW_APB2AXIS_LOOKUP_STS_RDY_SHIFT)

/* Bitfield definition for register: APB2AXIS_LOOKUP_REQ_CNT */
/*
 * WRCNT (RO)
 *
 * number of streams in queue
 */
#define TSW_APB2AXIS_LOOKUP_REQ_CNT_WRCNT_MASK (0xFFU)
#define TSW_APB2AXIS_LOOKUP_REQ_CNT_WRCNT_SHIFT (0U)
#define TSW_APB2AXIS_LOOKUP_REQ_CNT_WRCNT_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_LOOKUP_REQ_CNT_WRCNT_MASK) >> TSW_APB2AXIS_LOOKUP_REQ_CNT_WRCNT_SHIFT)

/* Bitfield definition for register: APB2AXIS_LOOKUP_FILLSTS */
/*
 * FULL (RO)
 *
 * FD FIFO full
 */
#define TSW_APB2AXIS_LOOKUP_FILLSTS_FULL_MASK (0x10U)
#define TSW_APB2AXIS_LOOKUP_FILLSTS_FULL_SHIFT (4U)
#define TSW_APB2AXIS_LOOKUP_FILLSTS_FULL_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_LOOKUP_FILLSTS_FULL_MASK) >> TSW_APB2AXIS_LOOKUP_FILLSTS_FULL_SHIFT)

