RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * EMPTY (RO)
 *
 * FD FIFO failure
 */
#define TSW_APB2AXIS_LOOKUP_FILLSTS_EMPTY_MASK (0x1U)
#define TSW_APB2AXIS_LOOKUP_FILLSTS_EMPTY_SHIFT (0U)
#define TSW_APB2AXIS_LOOKUP_FILLSTS_EMPTY_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_LOOKUP_FILLSTS_EMPTY_MASK) >> TSW_APB2AXIS_LOOKUP_FILLSTS_EMPTY_SHIFT)

/* Bitfield definition for register: APB2AXIS_LOOKUP_RESET */
/*
 * RESET (R/W)
 *
 * Resets controller and clears all pending stream data
 */
#define TSW_APB2AXIS_LOOKUP_RESET_RESET_MASK (0x1U)
#define TSW_APB2AXIS_LOOKUP_RESET_RESET_SHIFT (0U)
#define TSW_APB2AXIS_LOOKUP_RESET_RESET_SET(x) (((uint32_t)(x) << TSW_APB2AXIS_LOOKUP_RESET_RESET_SHIFT) & TSW_APB2AXIS_LOOKUP_RESET_RESET_MASK)
#define TSW_APB2AXIS_LOOKUP_RESET_RESET_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_LOOKUP_RESET_RESET_MASK) >> TSW_APB2AXIS_LOOKUP_RESET_RESET_SHIFT)

/* Bitfield definition for register: APB2AXIS_LOOKUP_PARAM */
/*
 * DEPTH (RO)
 *
 * number of configured buffer depth
 */
#define TSW_APB2AXIS_LOOKUP_PARAM_DEPTH_MASK (0xFF00U)
#define TSW_APB2AXIS_LOOKUP_PARAM_DEPTH_SHIFT (8U)
#define TSW_APB2AXIS_LOOKUP_PARAM_DEPTH_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_LOOKUP_PARAM_DEPTH_MASK) >> TSW_APB2AXIS_LOOKUP_PARAM_DEPTH_SHIFT)

/*
 * WORDLEN_BYTE (RO)
 *
 * number of configured 32bit for this controller
 */
#define TSW_APB2AXIS_LOOKUP_PARAM_WORDLEN_BYTE_MASK (0xFFU)
#define TSW_APB2AXIS_LOOKUP_PARAM_WORDLEN_BYTE_SHIFT (0U)
#define TSW_APB2AXIS_LOOKUP_PARAM_WORDLEN_BYTE_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_LOOKUP_PARAM_WORDLEN_BYTE_MASK) >> TSW_APB2AXIS_LOOKUP_PARAM_WORDLEN_BYTE_SHIFT)

/* Bitfield definition for register: APB2AXIS_LOOKUP_REQDATA_0 */
/*
 * DESTMAC (RW)
 *
 * Holding the first four bytes of requested MAC address.
 */
#define TSW_APB2AXIS_LOOKUP_REQDATA_0_DESTMAC_MASK (0xFFFFFFFFUL)
#define TSW_APB2AXIS_LOOKUP_REQDATA_0_DESTMAC_SHIFT (0U)
#define TSW_APB2AXIS_LOOKUP_REQDATA_0_DESTMAC_SET(x) (((uint32_t)(x) << TSW_APB2AXIS_LOOKUP_REQDATA_0_DESTMAC_SHIFT) & TSW_APB2AXIS_LOOKUP_REQDATA_0_DESTMAC_MASK)
#define TSW_APB2AXIS_LOOKUP_REQDATA_0_DESTMAC_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_LOOKUP_REQDATA_0_DESTMAC_MASK) >> TSW_APB2AXIS_LOOKUP_REQDATA_0_DESTMAC_SHIFT)

/* Bitfield definition for register: APB2AXIS_LOOKUP_REQDATA_1 */
/*
 * DESTMAC (RW)
 *
 * Holding the last two bytes of requested MAC address.
 */
#define TSW_APB2AXIS_LOOKUP_REQDATA_1_DESTMAC_MASK (0xFFFFU)
#define TSW_APB2AXIS_LOOKUP_REQDATA_1_DESTMAC_SHIFT (0U)
#define TSW_APB2AXIS_LOOKUP_REQDATA_1_DESTMAC_SET(x) (((uint32_t)(x) << TSW_APB2AXIS_LOOKUP_REQDATA_1_DESTMAC_SHIFT) & TSW_APB2AXIS_LOOKUP_REQDATA_1_DESTMAC_MASK)
#define TSW_APB2AXIS_LOOKUP_REQDATA_1_DESTMAC_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_LOOKUP_REQDATA_1_DESTMAC_MASK) >> TSW_APB2AXIS_LOOKUP_REQDATA_1_DESTMAC_SHIFT)

/* Bitfield definition for register: APB2AXIS_LOOKUP_REQDATA_3 */
/*
 * IS_VLAN (RW)
 *
 * Tell the LOOKUP module the requested traffic is VLAN tagged.
 */
#define TSW_APB2AXIS_LOOKUP_REQDATA_3_IS_VLAN_MASK (0x10000UL)
#define TSW_APB2AXIS_LOOKUP_REQDATA_3_IS_VLAN_SHIFT (16U)
#define TSW_APB2AXIS_LOOKUP_REQDATA_3_IS_VLAN_SET(x) (((uint32_t)(x) << TSW_APB2AXIS_LOOKUP_REQDATA_3_IS_VLAN_SHIFT) & TSW_APB2AXIS_LOOKUP_REQDATA_3_IS_VLAN_MASK)
#define TSW_APB2AXIS_LOOKUP_REQDATA_3_IS_VLAN_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_LOOKUP_REQDATA_3_IS_VLAN_MASK) >> TSW_APB2AXIS_LOOKUP_REQDATA_3_IS_VLAN_SHIFT)

/*
 * VLAN_TCI (RW)
 *
 * Set the requested traffic VLAN_TCI, if IS_VLAN=1.
 */
#define TSW_APB2AXIS_LOOKUP_REQDATA_3_VLAN_TCI_MASK (0xFFFFU)
#define TSW_APB2AXIS_LOOKUP_REQDATA_3_VLAN_TCI_SHIFT (0U)
#define TSW_APB2AXIS_LOOKUP_REQDATA_3_VLAN_TCI_SET(x) (((uint32_t)(x) << TSW_APB2AXIS_LOOKUP_REQDATA_3_VLAN_TCI_SHIFT) & TSW_APB2AXIS_LOOKUP_REQDATA_3_VLAN_TCI_MASK)
#define TSW_APB2AXIS_LOOKUP_REQDATA_3_VLAN_TCI_GET(x) (((uint32_t)(x) & TSW_APB2AXIS_LOOKUP_REQDATA_3_VLAN_TCI_MASK) >> TSW_APB2AXIS_LOOKUP_REQDATA_3_VLAN_TCI_SHIFT)

/* Bitfield definition for register: AXIS2APB_LOOKUP_STS */
/*
 * BUSY (RO)
 *
 * the controller is writing data and/or data is pending
 */
#define TSW_AXIS2APB_LOOKUP_STS_BUSY_MASK (0x2U)
#define TSW_AXIS2APB_LOOKUP_STS_BUSY_SHIFT (1U)
#define TSW_AXIS2APB_LOOKUP_STS_BUSY_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_STS_BUSY_MASK) >> TSW_AXIS2APB_LOOKUP_STS_BUSY_SHIFT)

/*
 * RDY (RO)
 *
 * the new data is written to data register
 */
#define TSW_AXIS2APB_LOOKUP_STS_RDY_MASK (0x1U)
#define TSW_AXIS2APB_LOOKUP_STS_RDY_SHIFT (0U)
#define TSW_AXIS2APB_LOOKUP_STS_RDY_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_STS_RDY_MASK) >> TSW_AXIS2APB_LOOKUP_STS_RDY_SHIFT)

/* Bitfield definition for register: AXIS2APB_LOOKUP_RESP_CNT */
/*
 * RDCNT (RO)
 *
 * number of streams in queue
 */
#define TSW_AXIS2APB_LOOKUP_RESP_CNT_RDCNT_MASK (0xFFU)
#define TSW_AXIS2APB_LOOKUP_RESP_CNT_RDCNT_SHIFT (0U)
#define TSW_AXIS2APB_LOOKUP_RESP_CNT_RDCNT_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_RESP_CNT_RDCNT_MASK) >> TSW_AXIS2APB_LOOKUP_RESP_CNT_RDCNT_SHIFT)

/* Bitfield definition for register: AXIS2APB_LOOKUP_FILLSTS */
/*
 * FULL (RO)
 *
 * FD FIFO full
 */
#define TSW_AXIS2APB_LOOKUP_FILLSTS_FULL_MASK (0x10U)
#define TSW_AXIS2APB_LOOKUP_FILLSTS_FULL_SHIFT (4U)
#define TSW_AXIS2APB_LOOKUP_FILLSTS_FULL_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_FILLSTS_FULL_MASK) >> TSW_AXIS2APB_LOOKUP_FILLSTS_FULL_SHIFT)

/*
 * EMPTY (RO)
 *
 * FD FIFO failure
 */
#define TSW_AXIS2APB_LOOKUP_FILLSTS_EMPTY_MASK (0x1U)
#define TSW_AXIS2APB_LOOKUP_FILLSTS_EMPTY_SHIFT (0U)
#define TSW_AXIS2APB_LOOKUP_FILLSTS_EMPTY_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_FILLSTS_EMPTY_MASK) >> TSW_AXIS2APB_LOOKUP_FILLSTS_EMPTY_SHIFT)

/* Bitfield definition for register: AXIS2APB_LOOKUP_RESET */
/*
 * RESET (R/W)
 *
 * Resets controller and clears all pending stream data
 */
#define TSW_AXIS2APB_LOOKUP_RESET_RESET_MASK (0x1U)
#define TSW_AXIS2APB_LOOKUP_RESET_RESET_SHIFT (0U)
#define TSW_AXIS2APB_LOOKUP_RESET_RESET_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_LOOKUP_RESET_RESET_SHIFT) & TSW_AXIS2APB_LOOKUP_RESET_RESET_MASK)
#define TSW_AXIS2APB_LOOKUP_RESET_RESET_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_RESET_RESET_MASK) >> TSW_AXIS2APB_LOOKUP_RESET_RESET_SHIFT)

/* Bitfield definition for register: AXIS2APB_LOOKUP_PARAM */
/*
 * DEPTH (RO)
 *
 * number of configured buffer depth
 */
#define TSW_AXIS2APB_LOOKUP_PARAM_DEPTH_MASK (0xFF00U)
#define TSW_AXIS2APB_LOOKUP_PARAM_DEPTH_SHIFT (8U)
#define TSW_AXIS2APB_LOOKUP_PARAM_DEPTH_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_PARAM_DEPTH_MASK) >> TSW_AXIS2APB_LOOKUP_PARAM_DEPTH_SHIFT)

