RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * WORDLEN_BYTE (RO)
 *
 * number of configured 32bit for this controller
 */
#define TSW_AXIS2APB_LOOKUP_PARAM_WORDLEN_BYTE_MASK (0xFFU)
#define TSW_AXIS2APB_LOOKUP_PARAM_WORDLEN_BYTE_SHIFT (0U)
#define TSW_AXIS2APB_LOOKUP_PARAM_WORDLEN_BYTE_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_PARAM_WORDLEN_BYTE_MASK) >> TSW_AXIS2APB_LOOKUP_PARAM_WORDLEN_BYTE_SHIFT)

/* Bitfield definition for register: AXIS2APB_LOOKUP_RESPDATA_0 */
/*
 * DROP_VLAN (RW)
 *
 * Used for statistics. Shows that drop occurs by VLAN-ID
 */
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_VLAN_MASK (0x2000000UL)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_VLAN_SHIFT (25U)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_VLAN_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_VLAN_SHIFT) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_VLAN_MASK)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_VLAN_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_VLAN_MASK) >> TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_VLAN_SHIFT)

/*
 * HIT (RW)
 *
 * Is 1, if DESTMAC and VID hit an entry.
 */
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_MASK (0x1000000UL)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_SHIFT (24U)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_SHIFT) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_MASK)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_MASK) >> TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_SHIFT)

/*
 * UTAG (RW)
 *
 * TSN user sideband information from ALMEM.
 */
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_UTAG_MASK (0xE00000UL)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_UTAG_SHIFT (21U)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_UTAG_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_LOOKUP_RESPDATA_0_UTAG_SHIFT) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_UTAG_MASK)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_UTAG_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_UTAG_MASK) >> TSW_AXIS2APB_LOOKUP_RESPDATA_0_UTAG_SHIFT)

/*
 * HIT_VLAN (RW)
 *
 * Is 1, if VID hit entry in VLAN_PORT table.
 */
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_VLAN_MASK (0x100000UL)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_VLAN_SHIFT (20U)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_VLAN_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_VLAN_SHIFT) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_VLAN_MASK)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_VLAN_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_VLAN_MASK) >> TSW_AXIS2APB_LOOKUP_RESPDATA_0_HIT_VLAN_SHIFT)

/*
 * DROP (RW)
 *
 * Indicate that the frame should be dropped.
 */
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_MASK (0x80000UL)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_SHIFT (19U)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_SHIFT) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_MASK)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_MASK) >> TSW_AXIS2APB_LOOKUP_RESPDATA_0_DROP_SHIFT)

/*
 * QUEUE (RW)
 *
 * TX traffic queue selection.
 */
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_QUEUE_MASK (0x70000UL)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_QUEUE_SHIFT (16U)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_QUEUE_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_LOOKUP_RESPDATA_0_QUEUE_SHIFT) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_QUEUE_MASK)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_QUEUE_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_QUEUE_MASK) >> TSW_AXIS2APB_LOOKUP_RESPDATA_0_QUEUE_SHIFT)

/*
 * DEST (RW)
 *
 * Forwarding ports from 0 to 15, Bit 0 is CPU port.
 */
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_DEST_MASK (0xFFFFU)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_DEST_SHIFT (0U)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_DEST_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_LOOKUP_RESPDATA_0_DEST_SHIFT) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_DEST_MASK)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_0_DEST_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_RESPDATA_0_DEST_MASK) >> TSW_AXIS2APB_LOOKUP_RESPDATA_0_DEST_SHIFT)

/* Bitfield definition for register: AXIS2APB_LOOKUP_RESPDATA_1 */
/*
 * ENTRY_NUM (RW)
 *
 * Entry number of ALMEM.
 */
#define TSW_AXIS2APB_LOOKUP_RESPDATA_1_ENTRY_NUM_MASK (0xFFFFU)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_1_ENTRY_NUM_SHIFT (0U)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_1_ENTRY_NUM_SET(x) (((uint32_t)(x) << TSW_AXIS2APB_LOOKUP_RESPDATA_1_ENTRY_NUM_SHIFT) & TSW_AXIS2APB_LOOKUP_RESPDATA_1_ENTRY_NUM_MASK)
#define TSW_AXIS2APB_LOOKUP_RESPDATA_1_ENTRY_NUM_GET(x) (((uint32_t)(x) & TSW_AXIS2APB_LOOKUP_RESPDATA_1_ENTRY_NUM_MASK) >> TSW_AXIS2APB_LOOKUP_RESPDATA_1_ENTRY_NUM_SHIFT)

/* Bitfield definition for register: CENTRAL_CSR_VERSION */
/*
 * VER_HI (RO)
 *
 * Major Version number of TSN-SW core.
 */
#define TSW_CENTRAL_CSR_VERSION_VER_HI_MASK (0xFF000000UL)
#define TSW_CENTRAL_CSR_VERSION_VER_HI_SHIFT (24U)
#define TSW_CENTRAL_CSR_VERSION_VER_HI_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_VERSION_VER_HI_MASK) >> TSW_CENTRAL_CSR_VERSION_VER_HI_SHIFT)

/*
 * VER_LO (RO)
 *
 * Minor Version number of TSN-SW core.
 */
#define TSW_CENTRAL_CSR_VERSION_VER_LO_MASK (0xFF0000UL)
#define TSW_CENTRAL_CSR_VERSION_VER_LO_SHIFT (16U)
#define TSW_CENTRAL_CSR_VERSION_VER_LO_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_VERSION_VER_LO_MASK) >> TSW_CENTRAL_CSR_VERSION_VER_LO_SHIFT)

/*
 * VER_REV (RO)
 *
 * Reversion number of TSN-SW core.
 */
#define TSW_CENTRAL_CSR_VERSION_VER_REV_MASK (0xFFU)
#define TSW_CENTRAL_CSR_VERSION_VER_REV_SHIFT (0U)
#define TSW_CENTRAL_CSR_VERSION_VER_REV_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_VERSION_VER_REV_MASK) >> TSW_CENTRAL_CSR_VERSION_VER_REV_SHIFT)

/* Bitfield definition for register: CENTRAL_CSR_PARAM */
/*
 * INCL_QCI (RO)
 *
 * Shows if QCI module is present.
 */
#define TSW_CENTRAL_CSR_PARAM_INCL_QCI_MASK (0x40000UL)
#define TSW_CENTRAL_CSR_PARAM_INCL_QCI_SHIFT (18U)
#define TSW_CENTRAL_CSR_PARAM_INCL_QCI_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_PARAM_INCL_QCI_MASK) >> TSW_CENTRAL_CSR_PARAM_INCL_QCI_SHIFT)

/*
 * INCL_CB0 (RO)
 *
 * Shows if IP is configured with “lightweight” 802.1CB at CPU-Port.
 */
#define TSW_CENTRAL_CSR_PARAM_INCL_CB0_MASK (0x20000UL)
#define TSW_CENTRAL_CSR_PARAM_INCL_CB0_SHIFT (17U)
#define TSW_CENTRAL_CSR_PARAM_INCL_CB0_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_PARAM_INCL_CB0_MASK) >> TSW_CENTRAL_CSR_PARAM_INCL_CB0_SHIFT)

