RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * TESTMODE (RO)
 *
 * Shows if IP is configured in TESTMODE.
 */
#define TSW_CENTRAL_CSR_PARAM_TESTMODE_MASK (0x10000UL)
#define TSW_CENTRAL_CSR_PARAM_TESTMODE_SHIFT (16U)
#define TSW_CENTRAL_CSR_PARAM_TESTMODE_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_PARAM_TESTMODE_MASK) >> TSW_CENTRAL_CSR_PARAM_TESTMODE_SHIFT)

/*
 * TYPE (RO)
 *
 * Specify type of switch core
 */
#define TSW_CENTRAL_CSR_PARAM_TYPE_MASK (0xFF00U)
#define TSW_CENTRAL_CSR_PARAM_TYPE_SHIFT (8U)
#define TSW_CENTRAL_CSR_PARAM_TYPE_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_PARAM_TYPE_MASK) >> TSW_CENTRAL_CSR_PARAM_TYPE_SHIFT)

/*
 * NPORTS (RO)
 *
 * Number of TSN ports without counting internal CPU port. For TSN-SE, it returns always 2
 */
#define TSW_CENTRAL_CSR_PARAM_NPORTS_MASK (0xFFU)
#define TSW_CENTRAL_CSR_PARAM_NPORTS_SHIFT (0U)
#define TSW_CENTRAL_CSR_PARAM_NPORTS_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_PARAM_NPORTS_MASK) >> TSW_CENTRAL_CSR_PARAM_NPORTS_SHIFT)

/* Bitfield definition for register: CENTRAL_CSR_CONFIG */
/*
 * MSEC_CYCLES (R/W)
 *
 * Number of SYS_CLK cycles during 1 ms. It is required to calculate a correct time
 */
#define TSW_CENTRAL_CSR_CONFIG_MSEC_CYCLES_MASK (0xFFFFFFUL)
#define TSW_CENTRAL_CSR_CONFIG_MSEC_CYCLES_SHIFT (0U)
#define TSW_CENTRAL_CSR_CONFIG_MSEC_CYCLES_SET(x) (((uint32_t)(x) << TSW_CENTRAL_CSR_CONFIG_MSEC_CYCLES_SHIFT) & TSW_CENTRAL_CSR_CONFIG_MSEC_CYCLES_MASK)
#define TSW_CENTRAL_CSR_CONFIG_MSEC_CYCLES_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_CONFIG_MSEC_CYCLES_MASK) >> TSW_CENTRAL_CSR_CONFIG_MSEC_CYCLES_SHIFT)

/* Bitfield definition for register: CENTRAL_CSR_CB_PARAM */
/*
 * SID_D (RO)
 *
 * Number of 802.1CB Stream Identification entries. 2^SID_D entries
 */
#define TSW_CENTRAL_CSR_CB_PARAM_SID_D_MASK (0xFF00U)
#define TSW_CENTRAL_CSR_CB_PARAM_SID_D_SHIFT (8U)
#define TSW_CENTRAL_CSR_CB_PARAM_SID_D_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_CB_PARAM_SID_D_MASK) >> TSW_CENTRAL_CSR_CB_PARAM_SID_D_SHIFT)

/*
 * FRER_D (RO)
 *
 * Number of 802.1CB Recovery Function entries. 2^FRER_D entries.
 */
#define TSW_CENTRAL_CSR_CB_PARAM_FRER_D_MASK (0xFFU)
#define TSW_CENTRAL_CSR_CB_PARAM_FRER_D_SHIFT (0U)
#define TSW_CENTRAL_CSR_CB_PARAM_FRER_D_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_CB_PARAM_FRER_D_MASK) >> TSW_CENTRAL_CSR_CB_PARAM_FRER_D_SHIFT)

/* Bitfield definition for register: CENTRAL_CSR_QCI_CTRL_PARAM */
/*
 * QCI_GTD (RO)
 *
 * (Log) gate table depth. 2**GTD entries.
 */
#define TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_GTD_MASK (0xFF0000UL)
#define TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_GTD_SHIFT (16U)
#define TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_GTD_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_GTD_MASK) >> TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_GTD_SHIFT)

/*
 * QCI_FMD (RO)
 *
 * (Log) flow meter depth. 2**FMD entries.
 */
#define TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_FMD_MASK (0xFF00U)
#define TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_FMD_SHIFT (8U)
#define TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_FMD_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_FMD_MASK) >> TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_FMD_SHIFT)

/*
 * QCI_FTD (RO)
 *
 * (Log) filter table depth. 2**FTD entries.
 */
#define TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_FTD_MASK (0xFFU)
#define TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_FTD_SHIFT (0U)
#define TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_FTD_GET(x) (((uint32_t)(x) & TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_FTD_MASK) >> TSW_CENTRAL_CSR_QCI_CTRL_PARAM_QCI_FTD_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_HWCFG */
/*
 * FMD (RO)
 *
 * FMD – parameter
 */
#define TSW_CENTRAL_QCI_HWCFG_FMD_MASK (0xFF0000UL)
#define TSW_CENTRAL_QCI_HWCFG_FMD_SHIFT (16U)
#define TSW_CENTRAL_QCI_HWCFG_FMD_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_HWCFG_FMD_MASK) >> TSW_CENTRAL_QCI_HWCFG_FMD_SHIFT)

/*
 * GTD (RO)
 *
 * GTD – parameter
 */
#define TSW_CENTRAL_QCI_HWCFG_GTD_MASK (0xFF00U)
#define TSW_CENTRAL_QCI_HWCFG_GTD_SHIFT (8U)
#define TSW_CENTRAL_QCI_HWCFG_GTD_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_HWCFG_GTD_MASK) >> TSW_CENTRAL_QCI_HWCFG_GTD_SHIFT)

/*
 * FTD (RO)
 *
 * FTD – parameter
 */
#define TSW_CENTRAL_QCI_HWCFG_FTD_MASK (0xFFU)
#define TSW_CENTRAL_QCI_HWCFG_FTD_SHIFT (0U)
#define TSW_CENTRAL_QCI_HWCFG_FTD_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_HWCFG_FTD_MASK) >> TSW_CENTRAL_QCI_HWCFG_FTD_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_FILTERSEL */
/*
 * INDEX (R/W)
 *
 * Filter select index
 * Any written value larger than the maximum index
 * (2**FTD-1) will result in a read-back value of <0>.
 */
#define TSW_CENTRAL_QCI_FILTERSEL_INDEX_MASK (0xFFU)
#define TSW_CENTRAL_QCI_FILTERSEL_INDEX_SHIFT (0U)
#define TSW_CENTRAL_QCI_FILTERSEL_INDEX_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_FILTERSEL_INDEX_SHIFT) & TSW_CENTRAL_QCI_FILTERSEL_INDEX_MASK)
#define TSW_CENTRAL_QCI_FILTERSEL_INDEX_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_FILTERSEL_INDEX_MASK) >> TSW_CENTRAL_QCI_FILTERSEL_INDEX_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_METERSEL */
/*
 * INDEX (R/W)
 *
 * Flowmeter select index
 * Any written value larger than the maximum index
 * (2**FMD-1) will result in a read-back value of <0>.
 */
#define TSW_CENTRAL_QCI_METERSEL_INDEX_MASK (0xFFU)
#define TSW_CENTRAL_QCI_METERSEL_INDEX_SHIFT (0U)
#define TSW_CENTRAL_QCI_METERSEL_INDEX_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_METERSEL_INDEX_SHIFT) & TSW_CENTRAL_QCI_METERSEL_INDEX_MASK)
#define TSW_CENTRAL_QCI_METERSEL_INDEX_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_METERSEL_INDEX_MASK) >> TSW_CENTRAL_QCI_METERSEL_INDEX_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_GATESEL */
/*
 * INDEX (R/W)
 *
 * Gate select index
 * Any written value larger than the maximum index
 * (2**GTD-1) will result in a read-back value of <0>.
 */
#define TSW_CENTRAL_QCI_GATESEL_INDEX_MASK (0xFFU)
#define TSW_CENTRAL_QCI_GATESEL_INDEX_SHIFT (0U)
#define TSW_CENTRAL_QCI_GATESEL_INDEX_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_GATESEL_INDEX_SHIFT) & TSW_CENTRAL_QCI_GATESEL_INDEX_MASK)
#define TSW_CENTRAL_QCI_GATESEL_INDEX_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GATESEL_INDEX_MASK) >> TSW_CENTRAL_QCI_GATESEL_INDEX_SHIFT)

