RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/* Bitfield definition for register: CENTRAL_QCI_FCTRL */
/*
 * ENBLK (R/W)
 *
 * Enable blocking of oversized frames
 * (802.1Qci – 8.6.5.1.1 (g))
 */
#define TSW_CENTRAL_QCI_FCTRL_ENBLK_MASK (0x80000000UL)
#define TSW_CENTRAL_QCI_FCTRL_ENBLK_SHIFT (31U)
#define TSW_CENTRAL_QCI_FCTRL_ENBLK_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_FCTRL_ENBLK_SHIFT) & TSW_CENTRAL_QCI_FCTRL_ENBLK_MASK)
#define TSW_CENTRAL_QCI_FCTRL_ENBLK_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_FCTRL_ENBLK_MASK) >> TSW_CENTRAL_QCI_FCTRL_ENBLK_SHIFT)

/*
 * ENFSZ (R/W)
 *
 * 0: No frame size check
 * 1: Frame size checking, size defined by FSIZE.MXSZ
 * (802.1Qci – 8.6.5.1.1 (e.1))
 */
#define TSW_CENTRAL_QCI_FCTRL_ENFSZ_MASK (0x40000000UL)
#define TSW_CENTRAL_QCI_FCTRL_ENFSZ_SHIFT (30U)
#define TSW_CENTRAL_QCI_FCTRL_ENFSZ_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_FCTRL_ENFSZ_SHIFT) & TSW_CENTRAL_QCI_FCTRL_ENFSZ_MASK)
#define TSW_CENTRAL_QCI_FCTRL_ENFSZ_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_FCTRL_ENFSZ_MASK) >> TSW_CENTRAL_QCI_FCTRL_ENFSZ_SHIFT)

/*
 * ENFID (R/W)
 *
 * 0: No Flow Meter
 * 1: Enable Flow Metering
 * (802.1Qci – 8.6.5.1.1 (e.2))
 */
#define TSW_CENTRAL_QCI_FCTRL_ENFID_MASK (0x20000000UL)
#define TSW_CENTRAL_QCI_FCTRL_ENFID_SHIFT (29U)
#define TSW_CENTRAL_QCI_FCTRL_ENFID_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_FCTRL_ENFID_SHIFT) & TSW_CENTRAL_QCI_FCTRL_ENFID_MASK)
#define TSW_CENTRAL_QCI_FCTRL_ENFID_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_FCTRL_ENFID_MASK) >> TSW_CENTRAL_QCI_FCTRL_ENFID_SHIFT)

/*
 * ENSID (R/W)
 *
 * 0: Filter match any SID value
 * 1: Filter match SID value
 * (802.1Qci – 8.6.5.1.1 (b))
 */
#define TSW_CENTRAL_QCI_FCTRL_ENSID_MASK (0x10000000UL)
#define TSW_CENTRAL_QCI_FCTRL_ENSID_SHIFT (28U)
#define TSW_CENTRAL_QCI_FCTRL_ENSID_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_FCTRL_ENSID_SHIFT) & TSW_CENTRAL_QCI_FCTRL_ENSID_MASK)
#define TSW_CENTRAL_QCI_FCTRL_ENSID_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_FCTRL_ENSID_MASK) >> TSW_CENTRAL_QCI_FCTRL_ENSID_SHIFT)

/*
 * ENPCP (R/W)
 *
 * 0: Filter match any PCP value
 * 1: Filter match PCP value
 * (802.1Qci – 8.6.5.1.1 (c))
 */
#define TSW_CENTRAL_QCI_FCTRL_ENPCP_MASK (0x8000000UL)
#define TSW_CENTRAL_QCI_FCTRL_ENPCP_SHIFT (27U)
#define TSW_CENTRAL_QCI_FCTRL_ENPCP_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_FCTRL_ENPCP_SHIFT) & TSW_CENTRAL_QCI_FCTRL_ENPCP_MASK)
#define TSW_CENTRAL_QCI_FCTRL_ENPCP_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_FCTRL_ENPCP_MASK) >> TSW_CENTRAL_QCI_FCTRL_ENPCP_SHIFT)

/*
 * PCP (R/W)
 *
 * Filter priority code point, if enabled by ENPCP
 */
#define TSW_CENTRAL_QCI_FCTRL_PCP_MASK (0x7000000UL)
#define TSW_CENTRAL_QCI_FCTRL_PCP_SHIFT (24U)
#define TSW_CENTRAL_QCI_FCTRL_PCP_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_FCTRL_PCP_SHIFT) & TSW_CENTRAL_QCI_FCTRL_PCP_MASK)
#define TSW_CENTRAL_QCI_FCTRL_PCP_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_FCTRL_PCP_MASK) >> TSW_CENTRAL_QCI_FCTRL_PCP_SHIFT)

/*
 * FMD (R/W)
 *
 * Associated Flow Meter – if enabled by ENFID
 */
#define TSW_CENTRAL_QCI_FCTRL_FMD_MASK (0xFF0000UL)
#define TSW_CENTRAL_QCI_FCTRL_FMD_SHIFT (16U)
#define TSW_CENTRAL_QCI_FCTRL_FMD_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_FCTRL_FMD_SHIFT) & TSW_CENTRAL_QCI_FCTRL_FMD_MASK)
#define TSW_CENTRAL_QCI_FCTRL_FMD_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_FCTRL_FMD_MASK) >> TSW_CENTRAL_QCI_FCTRL_FMD_SHIFT)

/*
 * GID (R/W)
 *
 * Associated Gate
 */
#define TSW_CENTRAL_QCI_FCTRL_GID_MASK (0xFF00U)
#define TSW_CENTRAL_QCI_FCTRL_GID_SHIFT (8U)
#define TSW_CENTRAL_QCI_FCTRL_GID_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_FCTRL_GID_SHIFT) & TSW_CENTRAL_QCI_FCTRL_GID_MASK)
#define TSW_CENTRAL_QCI_FCTRL_GID_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_FCTRL_GID_MASK) >> TSW_CENTRAL_QCI_FCTRL_GID_SHIFT)

/*
 * SID (R/W)
 *
 * Filter Stream ID – if enabled by ENSID
 */
#define TSW_CENTRAL_QCI_FCTRL_SID_MASK (0xFFU)
#define TSW_CENTRAL_QCI_FCTRL_SID_SHIFT (0U)
#define TSW_CENTRAL_QCI_FCTRL_SID_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_FCTRL_SID_SHIFT) & TSW_CENTRAL_QCI_FCTRL_SID_MASK)
#define TSW_CENTRAL_QCI_FCTRL_SID_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_FCTRL_SID_MASK) >> TSW_CENTRAL_QCI_FCTRL_SID_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_FSIZE */
/*
 * BLK (R/WC)
 *
 * Stream blocked due to oversize frame.
 * Write <1> to clear.
 * (802.1Qci – 8.6.5.1.1 (h))
 */
#define TSW_CENTRAL_QCI_FSIZE_BLK_MASK (0x80000000UL)
#define TSW_CENTRAL_QCI_FSIZE_BLK_SHIFT (31U)
#define TSW_CENTRAL_QCI_FSIZE_BLK_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_FSIZE_BLK_SHIFT) & TSW_CENTRAL_QCI_FSIZE_BLK_MASK)
#define TSW_CENTRAL_QCI_FSIZE_BLK_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_FSIZE_BLK_MASK) >> TSW_CENTRAL_QCI_FSIZE_BLK_SHIFT)

/*
 * MXSZ (R/W)
 *
 * Maximum-SDU size in octets
 */
#define TSW_CENTRAL_QCI_FSIZE_MXSZ_MASK (0xFFFFU)
#define TSW_CENTRAL_QCI_FSIZE_MXSZ_SHIFT (0U)
#define TSW_CENTRAL_QCI_FSIZE_MXSZ_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_FSIZE_MXSZ_SHIFT) & TSW_CENTRAL_QCI_FSIZE_MXSZ_MASK)
#define TSW_CENTRAL_QCI_FSIZE_MXSZ_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_FSIZE_MXSZ_MASK) >> TSW_CENTRAL_QCI_FSIZE_MXSZ_SHIFT)

/* Bitfield definition for register array: QCI_CNT */
/*
 * VALUE (RO)
 *
 * Filter counter (see 802.1Qci 8.6.5.1.1 f)
 * CNT0: Frames that matched filter
 * CNT1: Frames that passed gate
 * CNT2: Frames that did not pass gate
 * CNT3: Frames that passed Maximum-SDU size check
 * CNT4: Frames that did not pass size check
 * CNT5: Frames discarded by Flow Meter operation
 * Counters starting at value <0> after reset.
 */
#define TSW_QCI_CNT_VALUE_MASK (0xFFFFFFFFUL)
#define TSW_QCI_CNT_VALUE_SHIFT (0U)
#define TSW_QCI_CNT_VALUE_GET(x) (((uint32_t)(x) & TSW_QCI_CNT_VALUE_MASK) >> TSW_QCI_CNT_VALUE_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_MCTRL */
/*
 * RESET (WO)
 *
 * Flow Meter reset – self-resetting to <0>
 */
#define TSW_CENTRAL_QCI_MCTRL_RESET_MASK (0x80000000UL)
#define TSW_CENTRAL_QCI_MCTRL_RESET_SHIFT (31U)
#define TSW_CENTRAL_QCI_MCTRL_RESET_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_MCTRL_RESET_SHIFT) & TSW_CENTRAL_QCI_MCTRL_RESET_MASK)
#define TSW_CENTRAL_QCI_MCTRL_RESET_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_MCTRL_RESET_MASK) >> TSW_CENTRAL_QCI_MCTRL_RESET_SHIFT)

