RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * MAFR (RO)
 *
 * MarkAllFramesRed – cleared by RESET
 * (802.1Qci – 8.6.5.1.3 (j))
 */
#define TSW_CENTRAL_QCI_MCTRL_MAFR_MASK (0x10U)
#define TSW_CENTRAL_QCI_MCTRL_MAFR_SHIFT (4U)
#define TSW_CENTRAL_QCI_MCTRL_MAFR_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_MCTRL_MAFR_MASK) >> TSW_CENTRAL_QCI_MCTRL_MAFR_SHIFT)

/*
 * MAFREN (R/W)
 *
 * MarkAllFramesRedEnable
 * (802.1Qci – 8.6.5.1.3 (i))
 */
#define TSW_CENTRAL_QCI_MCTRL_MAFREN_MASK (0x8U)
#define TSW_CENTRAL_QCI_MCTRL_MAFREN_SHIFT (3U)
#define TSW_CENTRAL_QCI_MCTRL_MAFREN_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_MCTRL_MAFREN_SHIFT) & TSW_CENTRAL_QCI_MCTRL_MAFREN_MASK)
#define TSW_CENTRAL_QCI_MCTRL_MAFREN_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_MCTRL_MAFREN_MASK) >> TSW_CENTRAL_QCI_MCTRL_MAFREN_SHIFT)

/*
 * DOY (R/W)
 *
 * DropOnYellow
 * (802.1Qci – 8.6.5.1.3 (h))
 */
#define TSW_CENTRAL_QCI_MCTRL_DOY_MASK (0x4U)
#define TSW_CENTRAL_QCI_MCTRL_DOY_SHIFT (2U)
#define TSW_CENTRAL_QCI_MCTRL_DOY_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_MCTRL_DOY_SHIFT) & TSW_CENTRAL_QCI_MCTRL_DOY_MASK)
#define TSW_CENTRAL_QCI_MCTRL_DOY_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_MCTRL_DOY_MASK) >> TSW_CENTRAL_QCI_MCTRL_DOY_SHIFT)

/*
 * CM (R/W)
 *
 * Color mode – functionally unused
 * (802.1Qci – 8.6.5.1.3 (g))
 */
#define TSW_CENTRAL_QCI_MCTRL_CM_MASK (0x2U)
#define TSW_CENTRAL_QCI_MCTRL_CM_SHIFT (1U)
#define TSW_CENTRAL_QCI_MCTRL_CM_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_MCTRL_CM_SHIFT) & TSW_CENTRAL_QCI_MCTRL_CM_MASK)
#define TSW_CENTRAL_QCI_MCTRL_CM_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_MCTRL_CM_MASK) >> TSW_CENTRAL_QCI_MCTRL_CM_SHIFT)

/*
 * CF (R/W)
 *
 * Coupling flag
 * (802.1Qci – 8.6.5.1.3 (f))
 */
#define TSW_CENTRAL_QCI_MCTRL_CF_MASK (0x1U)
#define TSW_CENTRAL_QCI_MCTRL_CF_SHIFT (0U)
#define TSW_CENTRAL_QCI_MCTRL_CF_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_MCTRL_CF_SHIFT) & TSW_CENTRAL_QCI_MCTRL_CF_MASK)
#define TSW_CENTRAL_QCI_MCTRL_CF_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_MCTRL_CF_MASK) >> TSW_CENTRAL_QCI_MCTRL_CF_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_CIR */
/*
 * CIR (R/W)
 *
 * Committed information rate – see Chapter 7.5.2.4.
 * (802.1Qci – 8.6.5.1.3 (b))
 */
#define TSW_CENTRAL_QCI_CIR_CIR_MASK (0xFFFFFFUL)
#define TSW_CENTRAL_QCI_CIR_CIR_SHIFT (0U)
#define TSW_CENTRAL_QCI_CIR_CIR_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_CIR_CIR_SHIFT) & TSW_CENTRAL_QCI_CIR_CIR_MASK)
#define TSW_CENTRAL_QCI_CIR_CIR_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_CIR_CIR_MASK) >> TSW_CENTRAL_QCI_CIR_CIR_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_CBS */
/*
 * CBS (R/W)
 *
 * Committed burst size, in bits (not octets!)
 * (802.1Qci – 8.6.5.1.3 (c))
 */
#define TSW_CENTRAL_QCI_CBS_CBS_MASK (0xFFFFFFFFUL)
#define TSW_CENTRAL_QCI_CBS_CBS_SHIFT (0U)
#define TSW_CENTRAL_QCI_CBS_CBS_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_CBS_CBS_SHIFT) & TSW_CENTRAL_QCI_CBS_CBS_MASK)
#define TSW_CENTRAL_QCI_CBS_CBS_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_CBS_CBS_MASK) >> TSW_CENTRAL_QCI_CBS_CBS_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_EIR */
/*
 * EIR (R/W)
 *
 * Excess information rate – see Chapter 7.5.2.4.
 * (802.1Qci – 8.6.5.1.3 (d))
 */
#define TSW_CENTRAL_QCI_EIR_EIR_MASK (0xFFFFFFUL)
#define TSW_CENTRAL_QCI_EIR_EIR_SHIFT (0U)
#define TSW_CENTRAL_QCI_EIR_EIR_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_EIR_EIR_SHIFT) & TSW_CENTRAL_QCI_EIR_EIR_MASK)
#define TSW_CENTRAL_QCI_EIR_EIR_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_EIR_EIR_MASK) >> TSW_CENTRAL_QCI_EIR_EIR_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_EBS */
/*
 * EBS (R/W)
 *
 * Excess burst size, in bits (not octets)
 * (802.1Qci – 8.6.5.1.3 (e))
 */
#define TSW_CENTRAL_QCI_EBS_EBS_MASK (0xFFFFFFFFUL)
#define TSW_CENTRAL_QCI_EBS_EBS_SHIFT (0U)
#define TSW_CENTRAL_QCI_EBS_EBS_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_EBS_EBS_SHIFT) & TSW_CENTRAL_QCI_EBS_EBS_MASK)
#define TSW_CENTRAL_QCI_EBS_EBS_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_EBS_EBS_MASK) >> TSW_CENTRAL_QCI_EBS_EBS_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_GCTRL */
/*
 * IPV (R/W)
 *
 * Administrative internal priority value specification
 * (802.1Qci – 8.6.5.1.2 (c))
 */
#define TSW_CENTRAL_QCI_GCTRL_IPV_MASK (0xE0U)
#define TSW_CENTRAL_QCI_GCTRL_IPV_SHIFT (5U)
#define TSW_CENTRAL_QCI_GCTRL_IPV_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_GCTRL_IPV_SHIFT) & TSW_CENTRAL_QCI_GCTRL_IPV_MASK)
#define TSW_CENTRAL_QCI_GCTRL_IPV_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GCTRL_IPV_MASK) >> TSW_CENTRAL_QCI_GCTRL_IPV_SHIFT)

/*
 * STATE (R/W)
 *
 * Administrative stream gate state
 * (802.1Qci – 8.6.5.1.2 (b))
 */
#define TSW_CENTRAL_QCI_GCTRL_STATE_MASK (0x10U)
#define TSW_CENTRAL_QCI_GCTRL_STATE_SHIFT (4U)
#define TSW_CENTRAL_QCI_GCTRL_STATE_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_GCTRL_STATE_SHIFT) & TSW_CENTRAL_QCI_GCTRL_STATE_MASK)
#define TSW_CENTRAL_QCI_GCTRL_STATE_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GCTRL_STATE_MASK) >> TSW_CENTRAL_QCI_GCTRL_STATE_SHIFT)

/*
 * CDOEE (R/W)
 *
 * Gate – ClosedDueToOctetsExceededEnable
 * (802.1Qci – 8.6.5.1.2 (f))
 */
#define TSW_CENTRAL_QCI_GCTRL_CDOEE_MASK (0x8U)
#define TSW_CENTRAL_QCI_GCTRL_CDOEE_SHIFT (3U)
#define TSW_CENTRAL_QCI_GCTRL_CDOEE_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_GCTRL_CDOEE_SHIFT) & TSW_CENTRAL_QCI_GCTRL_CDOEE_MASK)
#define TSW_CENTRAL_QCI_GCTRL_CDOEE_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GCTRL_CDOEE_MASK) >> TSW_CENTRAL_QCI_GCTRL_CDOEE_SHIFT)

/*
 * CDIRE (R/W)
 *
 * Gate – ClosedDueToInvalidRxEnable
 * (802.1Qci – 8.6.5.1.2 (d))
 */
#define TSW_CENTRAL_QCI_GCTRL_CDIRE_MASK (0x4U)
#define TSW_CENTRAL_QCI_GCTRL_CDIRE_SHIFT (2U)
#define TSW_CENTRAL_QCI_GCTRL_CDIRE_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_GCTRL_CDIRE_SHIFT) & TSW_CENTRAL_QCI_GCTRL_CDIRE_MASK)
#define TSW_CENTRAL_QCI_GCTRL_CDIRE_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GCTRL_CDIRE_MASK) >> TSW_CENTRAL_QCI_GCTRL_CDIRE_SHIFT)

/*
 * CFGCH (R/W)
 *
 * Gate – change config (self-resetting to <0>)
 */
#define TSW_CENTRAL_QCI_GCTRL_CFGCH_MASK (0x2U)
#define TSW_CENTRAL_QCI_GCTRL_CFGCH_SHIFT (1U)
#define TSW_CENTRAL_QCI_GCTRL_CFGCH_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_GCTRL_CFGCH_SHIFT) & TSW_CENTRAL_QCI_GCTRL_CFGCH_MASK)
#define TSW_CENTRAL_QCI_GCTRL_CFGCH_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GCTRL_CFGCH_MASK) >> TSW_CENTRAL_QCI_GCTRL_CFGCH_SHIFT)

