RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * EN (R/W)
 *
 * Gate control – enable
 */
#define TSW_CENTRAL_QCI_GCTRL_EN_MASK (0x1U)
#define TSW_CENTRAL_QCI_GCTRL_EN_SHIFT (0U)
#define TSW_CENTRAL_QCI_GCTRL_EN_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_GCTRL_EN_SHIFT) & TSW_CENTRAL_QCI_GCTRL_EN_MASK)
#define TSW_CENTRAL_QCI_GCTRL_EN_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GCTRL_EN_MASK) >> TSW_CENTRAL_QCI_GCTRL_EN_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_GSTATUS */
/*
 * IPV (RO)
 *
 * Operational internal priority value specification
 * (802.1Qci – 8.6.5.1.2 (c))
 */
#define TSW_CENTRAL_QCI_GSTATUS_IPV_MASK (0xE0U)
#define TSW_CENTRAL_QCI_GSTATUS_IPV_SHIFT (5U)
#define TSW_CENTRAL_QCI_GSTATUS_IPV_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GSTATUS_IPV_MASK) >> TSW_CENTRAL_QCI_GSTATUS_IPV_SHIFT)

/*
 * STATE (RO)
 *
 * Operational stream gate state
 * (802.1Qci – 8.6.5.1.2 (b))
 */
#define TSW_CENTRAL_QCI_GSTATUS_STATE_MASK (0x10U)
#define TSW_CENTRAL_QCI_GSTATUS_STATE_SHIFT (4U)
#define TSW_CENTRAL_QCI_GSTATUS_STATE_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GSTATUS_STATE_MASK) >> TSW_CENTRAL_QCI_GSTATUS_STATE_SHIFT)

/*
 * CDOE (WC)
 *
 * Gate – ClosedDueToOctetsExceeded. Write <1> to
 * clear.
 * (802.1Qci – 8.6.5.1.2 (g))
 */
#define TSW_CENTRAL_QCI_GSTATUS_CDOE_MASK (0x8U)
#define TSW_CENTRAL_QCI_GSTATUS_CDOE_SHIFT (3U)
#define TSW_CENTRAL_QCI_GSTATUS_CDOE_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_GSTATUS_CDOE_SHIFT) & TSW_CENTRAL_QCI_GSTATUS_CDOE_MASK)
#define TSW_CENTRAL_QCI_GSTATUS_CDOE_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GSTATUS_CDOE_MASK) >> TSW_CENTRAL_QCI_GSTATUS_CDOE_SHIFT)

/*
 * CDIR (WC)
 *
 * Gate – ClosedDueToInvalidRx. Write <1> to clear.
 * (802.1Qci – 8.6.5.1.2 (e))
 */
#define TSW_CENTRAL_QCI_GSTATUS_CDIR_MASK (0x4U)
#define TSW_CENTRAL_QCI_GSTATUS_CDIR_SHIFT (2U)
#define TSW_CENTRAL_QCI_GSTATUS_CDIR_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_GSTATUS_CDIR_SHIFT) & TSW_CENTRAL_QCI_GSTATUS_CDIR_MASK)
#define TSW_CENTRAL_QCI_GSTATUS_CDIR_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GSTATUS_CDIR_MASK) >> TSW_CENTRAL_QCI_GSTATUS_CDIR_SHIFT)

/*
 * CFGP (RO)
 *
 * Configuration change pending
 */
#define TSW_CENTRAL_QCI_GSTATUS_CFGP_MASK (0x2U)
#define TSW_CENTRAL_QCI_GSTATUS_CFGP_SHIFT (1U)
#define TSW_CENTRAL_QCI_GSTATUS_CFGP_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GSTATUS_CFGP_MASK) >> TSW_CENTRAL_QCI_GSTATUS_CFGP_SHIFT)

/*
 * CFGERR (WC)
 *
 * Configuration change error. Write <1> to clear.
 */
#define TSW_CENTRAL_QCI_GSTATUS_CFGERR_MASK (0x1U)
#define TSW_CENTRAL_QCI_GSTATUS_CFGERR_SHIFT (0U)
#define TSW_CENTRAL_QCI_GSTATUS_CFGERR_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_GSTATUS_CFGERR_SHIFT) & TSW_CENTRAL_QCI_GSTATUS_CFGERR_MASK)
#define TSW_CENTRAL_QCI_GSTATUS_CFGERR_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GSTATUS_CFGERR_MASK) >> TSW_CENTRAL_QCI_GSTATUS_CFGERR_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_GLISTINDEX */
/*
 * IDX (R/W)
 *
 * Admin list pointer, select entry 0 – 15.
 */
#define TSW_CENTRAL_QCI_GLISTINDEX_IDX_MASK (0xFU)
#define TSW_CENTRAL_QCI_GLISTINDEX_IDX_SHIFT (0U)
#define TSW_CENTRAL_QCI_GLISTINDEX_IDX_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_GLISTINDEX_IDX_SHIFT) & TSW_CENTRAL_QCI_GLISTINDEX_IDX_MASK)
#define TSW_CENTRAL_QCI_GLISTINDEX_IDX_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_GLISTINDEX_IDX_MASK) >> TSW_CENTRAL_QCI_GLISTINDEX_IDX_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_LISTLEN */
/*
 * OLEN (RO)
 *
 * Operational list length
 */
#define TSW_CENTRAL_QCI_LISTLEN_OLEN_MASK (0xF0000UL)
#define TSW_CENTRAL_QCI_LISTLEN_OLEN_SHIFT (16U)
#define TSW_CENTRAL_QCI_LISTLEN_OLEN_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_LISTLEN_OLEN_MASK) >> TSW_CENTRAL_QCI_LISTLEN_OLEN_SHIFT)

/*
 * ALEN (R/W)
 *
 * Administrative list length
 */
#define TSW_CENTRAL_QCI_LISTLEN_ALEN_MASK (0xFU)
#define TSW_CENTRAL_QCI_LISTLEN_ALEN_SHIFT (0U)
#define TSW_CENTRAL_QCI_LISTLEN_ALEN_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_LISTLEN_ALEN_SHIFT) & TSW_CENTRAL_QCI_LISTLEN_ALEN_MASK)
#define TSW_CENTRAL_QCI_LISTLEN_ALEN_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_LISTLEN_ALEN_MASK) >> TSW_CENTRAL_QCI_LISTLEN_ALEN_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_ACYCLETM */
/*
 * ACT (R/W)
 *
 * Administrative cycle time length, nanoseconds.
 */
#define TSW_CENTRAL_QCI_ACYCLETM_ACT_MASK (0x3FFFFFFFUL)
#define TSW_CENTRAL_QCI_ACYCLETM_ACT_SHIFT (0U)
#define TSW_CENTRAL_QCI_ACYCLETM_ACT_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_ACYCLETM_ACT_SHIFT) & TSW_CENTRAL_QCI_ACYCLETM_ACT_MASK)
#define TSW_CENTRAL_QCI_ACYCLETM_ACT_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_ACYCLETM_ACT_MASK) >> TSW_CENTRAL_QCI_ACYCLETM_ACT_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_ABASETM_L */
/*
 * ABTL (R/W)
 *
 * Administrative base time. Nanoseconds and seconds part. Cycle starts after becoming operational when time is reached by inputs <rtc_sec> and <rtc_ns>.
 */
#define TSW_CENTRAL_QCI_ABASETM_L_ABTL_MASK (0x3FFFFFFFUL)
#define TSW_CENTRAL_QCI_ABASETM_L_ABTL_SHIFT (0U)
#define TSW_CENTRAL_QCI_ABASETM_L_ABTL_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_ABASETM_L_ABTL_SHIFT) & TSW_CENTRAL_QCI_ABASETM_L_ABTL_MASK)
#define TSW_CENTRAL_QCI_ABASETM_L_ABTL_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_ABASETM_L_ABTL_MASK) >> TSW_CENTRAL_QCI_ABASETM_L_ABTL_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_ABASETM_H */
/*
 * ABTH (R/W)
 *
 */
#define TSW_CENTRAL_QCI_ABASETM_H_ABTH_MASK (0xFFFFFFFFUL)
#define TSW_CENTRAL_QCI_ABASETM_H_ABTH_SHIFT (0U)
#define TSW_CENTRAL_QCI_ABASETM_H_ABTH_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_ABASETM_H_ABTH_SHIFT) & TSW_CENTRAL_QCI_ABASETM_H_ABTH_MASK)
#define TSW_CENTRAL_QCI_ABASETM_H_ABTH_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_ABASETM_H_ABTH_MASK) >> TSW_CENTRAL_QCI_ABASETM_H_ABTH_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_AENTRY_CTRL */
/*
 * STATE (R/W)
 *
 * AdminList – gate state (1: open)
 */
#define TSW_CENTRAL_QCI_AENTRY_CTRL_STATE_MASK (0x80000000UL)
#define TSW_CENTRAL_QCI_AENTRY_CTRL_STATE_SHIFT (31U)
#define TSW_CENTRAL_QCI_AENTRY_CTRL_STATE_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_AENTRY_CTRL_STATE_SHIFT) & TSW_CENTRAL_QCI_AENTRY_CTRL_STATE_MASK)
#define TSW_CENTRAL_QCI_AENTRY_CTRL_STATE_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_AENTRY_CTRL_STATE_MASK) >> TSW_CENTRAL_QCI_AENTRY_CTRL_STATE_SHIFT)

