RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * IPV (R/W)
 *
 * AdminList – IPV
 */
#define TSW_CENTRAL_QCI_AENTRY_CTRL_IPV_MASK (0x70000000UL)
#define TSW_CENTRAL_QCI_AENTRY_CTRL_IPV_SHIFT (28U)
#define TSW_CENTRAL_QCI_AENTRY_CTRL_IPV_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_AENTRY_CTRL_IPV_SHIFT) & TSW_CENTRAL_QCI_AENTRY_CTRL_IPV_MASK)
#define TSW_CENTRAL_QCI_AENTRY_CTRL_IPV_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_AENTRY_CTRL_IPV_MASK) >> TSW_CENTRAL_QCI_AENTRY_CTRL_IPV_SHIFT)

/*
 * OCT (R/W)
 *
 * AdminList – maximum octets (0 – disabled)
 */
#define TSW_CENTRAL_QCI_AENTRY_CTRL_OCT_MASK (0xFFFFFFFUL)
#define TSW_CENTRAL_QCI_AENTRY_CTRL_OCT_SHIFT (0U)
#define TSW_CENTRAL_QCI_AENTRY_CTRL_OCT_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_AENTRY_CTRL_OCT_SHIFT) & TSW_CENTRAL_QCI_AENTRY_CTRL_OCT_MASK)
#define TSW_CENTRAL_QCI_AENTRY_CTRL_OCT_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_AENTRY_CTRL_OCT_MASK) >> TSW_CENTRAL_QCI_AENTRY_CTRL_OCT_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_AENTRY_AENTRY_IVAL */
/*
 * IVAL (R/W)
 *
 * AdminList – time interval in clock ticks
 */
#define TSW_CENTRAL_QCI_AENTRY_AENTRY_IVAL_IVAL_MASK (0xFFFFFFFFUL)
#define TSW_CENTRAL_QCI_AENTRY_AENTRY_IVAL_IVAL_SHIFT (0U)
#define TSW_CENTRAL_QCI_AENTRY_AENTRY_IVAL_IVAL_SET(x) (((uint32_t)(x) << TSW_CENTRAL_QCI_AENTRY_AENTRY_IVAL_IVAL_SHIFT) & TSW_CENTRAL_QCI_AENTRY_AENTRY_IVAL_IVAL_MASK)
#define TSW_CENTRAL_QCI_AENTRY_AENTRY_IVAL_IVAL_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_AENTRY_AENTRY_IVAL_IVAL_MASK) >> TSW_CENTRAL_QCI_AENTRY_AENTRY_IVAL_IVAL_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_AENTRY_OCYCLETM */
/*
 * OCT (RO)
 *
 * OperCycleTime in nanoseconds
 */
#define TSW_CENTRAL_QCI_AENTRY_OCYCLETM_OCT_MASK (0xFFFFFFFFUL)
#define TSW_CENTRAL_QCI_AENTRY_OCYCLETM_OCT_SHIFT (0U)
#define TSW_CENTRAL_QCI_AENTRY_OCYCLETM_OCT_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_AENTRY_OCYCLETM_OCT_MASK) >> TSW_CENTRAL_QCI_AENTRY_OCYCLETM_OCT_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_AENTRY_OBASETM_L */
/*
 * OBTL (RO)
 *
 * OperBaseTime – nanoseconds and seconds. Constantly
 * updated – OperBaseTime + N * OperCycleTimt. Might
 * be non-normalized.
 */
#define TSW_CENTRAL_QCI_AENTRY_OBASETM_L_OBTL_MASK (0xFFFFFFFFUL)
#define TSW_CENTRAL_QCI_AENTRY_OBASETM_L_OBTL_SHIFT (0U)
#define TSW_CENTRAL_QCI_AENTRY_OBASETM_L_OBTL_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_AENTRY_OBASETM_L_OBTL_MASK) >> TSW_CENTRAL_QCI_AENTRY_OBASETM_L_OBTL_SHIFT)

/* Bitfield definition for register: CENTRAL_QCI_AENTRY_OBASETM_H */
/*
 * OBTH (RO)
 *
 */
#define TSW_CENTRAL_QCI_AENTRY_OBASETM_H_OBTH_MASK (0xFFFFFFFFUL)
#define TSW_CENTRAL_QCI_AENTRY_OBASETM_H_OBTH_SHIFT (0U)
#define TSW_CENTRAL_QCI_AENTRY_OBASETM_H_OBTH_GET(x) (((uint32_t)(x) & TSW_CENTRAL_QCI_AENTRY_OBASETM_H_OBTH_MASK) >> TSW_CENTRAL_QCI_AENTRY_OBASETM_H_OBTH_SHIFT)

/* Bitfield definition for register: MM2S_DMA_CR */
/*
 * MXLEN (RW)
 *
 * max axi burst size
 */
#define TSW_MM2S_DMA_CR_MXLEN_MASK (0xFF000000UL)
#define TSW_MM2S_DMA_CR_MXLEN_SHIFT (24U)
#define TSW_MM2S_DMA_CR_MXLEN_SET(x) (((uint32_t)(x) << TSW_MM2S_DMA_CR_MXLEN_SHIFT) & TSW_MM2S_DMA_CR_MXLEN_MASK)
#define TSW_MM2S_DMA_CR_MXLEN_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_CR_MXLEN_MASK) >> TSW_MM2S_DMA_CR_MXLEN_SHIFT)

/*
 * IRQEN (RW)
 *
 * interrupt request enable
 */
#define TSW_MM2S_DMA_CR_IRQEN_MASK (0x8U)
#define TSW_MM2S_DMA_CR_IRQEN_SHIFT (3U)
#define TSW_MM2S_DMA_CR_IRQEN_SET(x) (((uint32_t)(x) << TSW_MM2S_DMA_CR_IRQEN_SHIFT) & TSW_MM2S_DMA_CR_IRQEN_MASK)
#define TSW_MM2S_DMA_CR_IRQEN_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_CR_IRQEN_MASK) >> TSW_MM2S_DMA_CR_IRQEN_SHIFT)

/*
 * RESET (WO)
 *
 * do reset when active
 */
#define TSW_MM2S_DMA_CR_RESET_MASK (0x4U)
#define TSW_MM2S_DMA_CR_RESET_SHIFT (2U)
#define TSW_MM2S_DMA_CR_RESET_SET(x) (((uint32_t)(x) << TSW_MM2S_DMA_CR_RESET_SHIFT) & TSW_MM2S_DMA_CR_RESET_MASK)
#define TSW_MM2S_DMA_CR_RESET_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_CR_RESET_MASK) >> TSW_MM2S_DMA_CR_RESET_SHIFT)

/*
 * SOE (RW)
 *
 * stop on error flag
 */
#define TSW_MM2S_DMA_CR_SOE_MASK (0x2U)
#define TSW_MM2S_DMA_CR_SOE_SHIFT (1U)
#define TSW_MM2S_DMA_CR_SOE_SET(x) (((uint32_t)(x) << TSW_MM2S_DMA_CR_SOE_SHIFT) & TSW_MM2S_DMA_CR_SOE_MASK)
#define TSW_MM2S_DMA_CR_SOE_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_CR_SOE_MASK) >> TSW_MM2S_DMA_CR_SOE_SHIFT)

/*
 * RUN (RW)
 *
 * run command from queue to data mover
 */
#define TSW_MM2S_DMA_CR_RUN_MASK (0x1U)
#define TSW_MM2S_DMA_CR_RUN_SHIFT (0U)
#define TSW_MM2S_DMA_CR_RUN_SET(x) (((uint32_t)(x) << TSW_MM2S_DMA_CR_RUN_SHIFT) & TSW_MM2S_DMA_CR_RUN_MASK)
#define TSW_MM2S_DMA_CR_RUN_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_CR_RUN_MASK) >> TSW_MM2S_DMA_CR_RUN_SHIFT)

/* Bitfield definition for register: MM2S_DMA_SR */
/*
 * RBUFF (RO)
 *
 * response buffer full
 */
#define TSW_MM2S_DMA_SR_RBUFF_MASK (0x80U)
#define TSW_MM2S_DMA_SR_RBUFF_SHIFT (7U)
#define TSW_MM2S_DMA_SR_RBUFF_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_SR_RBUFF_MASK) >> TSW_MM2S_DMA_SR_RBUFF_SHIFT)

/*
 * RBUFE (RO)
 *
 * response buffer empty
 */
#define TSW_MM2S_DMA_SR_RBUFE_MASK (0x40U)
#define TSW_MM2S_DMA_SR_RBUFE_SHIFT (6U)
#define TSW_MM2S_DMA_SR_RBUFE_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_SR_RBUFE_MASK) >> TSW_MM2S_DMA_SR_RBUFE_SHIFT)

/*
 * CBUFF (RO)
 *
 * command buffer full
 */
#define TSW_MM2S_DMA_SR_CBUFF_MASK (0x20U)
#define TSW_MM2S_DMA_SR_CBUFF_SHIFT (5U)
#define TSW_MM2S_DMA_SR_CBUFF_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_SR_CBUFF_MASK) >> TSW_MM2S_DMA_SR_CBUFF_SHIFT)

/*
 * CBUFE (RO)
 *
 * command buffer empty
 */
#define TSW_MM2S_DMA_SR_CBUFE_MASK (0x10U)
#define TSW_MM2S_DMA_SR_CBUFE_SHIFT (4U)
#define TSW_MM2S_DMA_SR_CBUFE_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_SR_CBUFE_MASK) >> TSW_MM2S_DMA_SR_CBUFE_SHIFT)

/*
 * IRQ (RWC)
 *
 * interrupt request pending
 */
#define TSW_MM2S_DMA_SR_IRQ_MASK (0x8U)
#define TSW_MM2S_DMA_SR_IRQ_SHIFT (3U)
#define TSW_MM2S_DMA_SR_IRQ_SET(x) (((uint32_t)(x) << TSW_MM2S_DMA_SR_IRQ_SHIFT) & TSW_MM2S_DMA_SR_IRQ_MASK)
#define TSW_MM2S_DMA_SR_IRQ_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_SR_IRQ_MASK) >> TSW_MM2S_DMA_SR_IRQ_SHIFT)

