RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * RSET (RO)
 *
 * resetting status
 */
#define TSW_MM2S_DMA_SR_RSET_MASK (0x4U)
#define TSW_MM2S_DMA_SR_RSET_SHIFT (2U)
#define TSW_MM2S_DMA_SR_RSET_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_SR_RSET_MASK) >> TSW_MM2S_DMA_SR_RSET_SHIFT)

/*
 * BUSY (RO)
 *
 * busy
 */
#define TSW_MM2S_DMA_SR_BUSY_MASK (0x2U)
#define TSW_MM2S_DMA_SR_BUSY_SHIFT (1U)
#define TSW_MM2S_DMA_SR_BUSY_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_SR_BUSY_MASK) >> TSW_MM2S_DMA_SR_BUSY_SHIFT)

/*
 * STOP (RO)
 *
 * mm2s is stopped
 */
#define TSW_MM2S_DMA_SR_STOP_MASK (0x1U)
#define TSW_MM2S_DMA_SR_STOP_SHIFT (0U)
#define TSW_MM2S_DMA_SR_STOP_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_SR_STOP_MASK) >> TSW_MM2S_DMA_SR_STOP_SHIFT)

/* Bitfield definition for register: MM2S_DMA_FILL */
/*
 * RFILL (RO)
 *
 * response buffer fill level
 */
#define TSW_MM2S_DMA_FILL_RFILL_MASK (0xFFFF0000UL)
#define TSW_MM2S_DMA_FILL_RFILL_SHIFT (16U)
#define TSW_MM2S_DMA_FILL_RFILL_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_FILL_RFILL_MASK) >> TSW_MM2S_DMA_FILL_RFILL_SHIFT)

/*
 * CFILL (RO)
 *
 * command buffer fill level
 */
#define TSW_MM2S_DMA_FILL_CFILL_MASK (0xFFFFU)
#define TSW_MM2S_DMA_FILL_CFILL_SHIFT (0U)
#define TSW_MM2S_DMA_FILL_CFILL_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_FILL_CFILL_MASK) >> TSW_MM2S_DMA_FILL_CFILL_SHIFT)

/* Bitfield definition for register: MM2S_DMA_CFG */
/*
 * DBUFD (RO)
 *
 * data buffer depth
 */
#define TSW_MM2S_DMA_CFG_DBUFD_MASK (0xF000000UL)
#define TSW_MM2S_DMA_CFG_DBUFD_SHIFT (24U)
#define TSW_MM2S_DMA_CFG_DBUFD_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_CFG_DBUFD_MASK) >> TSW_MM2S_DMA_CFG_DBUFD_SHIFT)

/*
 * CBUFD (RO)
 *
 * command buffer depth
 */
#define TSW_MM2S_DMA_CFG_CBUFD_MASK (0xF00000UL)
#define TSW_MM2S_DMA_CFG_CBUFD_SHIFT (20U)
#define TSW_MM2S_DMA_CFG_CBUFD_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_CFG_CBUFD_MASK) >> TSW_MM2S_DMA_CFG_CBUFD_SHIFT)

/*
 * ENA64 (RO)
 *
 * enable support for 64 bit addressing
 */
#define TSW_MM2S_DMA_CFG_ENA64_MASK (0x80000UL)
#define TSW_MM2S_DMA_CFG_ENA64_SHIFT (19U)
#define TSW_MM2S_DMA_CFG_ENA64_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_CFG_ENA64_MASK) >> TSW_MM2S_DMA_CFG_ENA64_SHIFT)

/*
 * ASIZE (RO)
 *
 * axi data bus width
 */
#define TSW_MM2S_DMA_CFG_ASIZE_MASK (0x70000UL)
#define TSW_MM2S_DMA_CFG_ASIZE_SHIFT (16U)
#define TSW_MM2S_DMA_CFG_ASIZE_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_CFG_ASIZE_MASK) >> TSW_MM2S_DMA_CFG_ASIZE_SHIFT)

/*
 * VER (RO)
 *
 * ip version
 */
#define TSW_MM2S_DMA_CFG_VER_MASK (0xFFFFU)
#define TSW_MM2S_DMA_CFG_VER_SHIFT (0U)
#define TSW_MM2S_DMA_CFG_VER_GET(x) (((uint32_t)(x) & TSW_MM2S_DMA_CFG_VER_MASK) >> TSW_MM2S_DMA_CFG_VER_SHIFT)

/* Bitfield definition for register: MM2S_ADDRLO */
/*
 * ADDRLO (RW)
 *
 * axi address
 */
#define TSW_MM2S_ADDRLO_ADDRLO_MASK (0xFFFFFFFFUL)
#define TSW_MM2S_ADDRLO_ADDRLO_SHIFT (0U)
#define TSW_MM2S_ADDRLO_ADDRLO_SET(x) (((uint32_t)(x) << TSW_MM2S_ADDRLO_ADDRLO_SHIFT) & TSW_MM2S_ADDRLO_ADDRLO_MASK)
#define TSW_MM2S_ADDRLO_ADDRLO_GET(x) (((uint32_t)(x) & TSW_MM2S_ADDRLO_ADDRLO_MASK) >> TSW_MM2S_ADDRLO_ADDRLO_SHIFT)

/* Bitfield definition for register: MM2S_LENGTH */
/*
 * LENGTH (RW)
 *
 * transfer request length in bytes
 */
#define TSW_MM2S_LENGTH_LENGTH_MASK (0xFFFFU)
#define TSW_MM2S_LENGTH_LENGTH_SHIFT (0U)
#define TSW_MM2S_LENGTH_LENGTH_SET(x) (((uint32_t)(x) << TSW_MM2S_LENGTH_LENGTH_SHIFT) & TSW_MM2S_LENGTH_LENGTH_MASK)
#define TSW_MM2S_LENGTH_LENGTH_GET(x) (((uint32_t)(x) & TSW_MM2S_LENGTH_LENGTH_MASK) >> TSW_MM2S_LENGTH_LENGTH_SHIFT)

/* Bitfield definition for register: MM2S_CTRL */
/*
 * GO (WO)
 *
 * commit buffered descriptor to command queue
 */
#define TSW_MM2S_CTRL_GO_MASK (0x80000000UL)
#define TSW_MM2S_CTRL_GO_SHIFT (31U)
#define TSW_MM2S_CTRL_GO_SET(x) (((uint32_t)(x) << TSW_MM2S_CTRL_GO_SHIFT) & TSW_MM2S_CTRL_GO_MASK)
#define TSW_MM2S_CTRL_GO_GET(x) (((uint32_t)(x) & TSW_MM2S_CTRL_GO_MASK) >> TSW_MM2S_CTRL_GO_SHIFT)

/*
 * NGENLAST (RW)
 *
 * no generation of TLAST
 */
#define TSW_MM2S_CTRL_NGENLAST_MASK (0x10U)
#define TSW_MM2S_CTRL_NGENLAST_SHIFT (4U)
#define TSW_MM2S_CTRL_NGENLAST_SET(x) (((uint32_t)(x) << TSW_MM2S_CTRL_NGENLAST_SHIFT) & TSW_MM2S_CTRL_NGENLAST_MASK)
#define TSW_MM2S_CTRL_NGENLAST_GET(x) (((uint32_t)(x) & TSW_MM2S_CTRL_NGENLAST_MASK) >> TSW_MM2S_CTRL_NGENLAST_SHIFT)

/*
 * ID (RW)
 *
 * command id
 */
#define TSW_MM2S_CTRL_ID_MASK (0xFU)
#define TSW_MM2S_CTRL_ID_SHIFT (0U)
#define TSW_MM2S_CTRL_ID_SET(x) (((uint32_t)(x) << TSW_MM2S_CTRL_ID_SHIFT) & TSW_MM2S_CTRL_ID_MASK)
#define TSW_MM2S_CTRL_ID_GET(x) (((uint32_t)(x) & TSW_MM2S_CTRL_ID_MASK) >> TSW_MM2S_CTRL_ID_SHIFT)

/* Bitfield definition for register: MM2S_RESP */
/*
 * LAST (RO)
 *
 * axi-stream with TLAST
 */
#define TSW_MM2S_RESP_LAST_MASK (0x40000000UL)
#define TSW_MM2S_RESP_LAST_SHIFT (30U)
#define TSW_MM2S_RESP_LAST_GET(x) (((uint32_t)(x) & TSW_MM2S_RESP_LAST_MASK) >> TSW_MM2S_RESP_LAST_SHIFT)

/*
 * DECERR (RO)
 *
 * decode error
 */
#define TSW_MM2S_RESP_DECERR_MASK (0x20000000UL)
#define TSW_MM2S_RESP_DECERR_SHIFT (29U)
#define TSW_MM2S_RESP_DECERR_GET(x) (((uint32_t)(x) & TSW_MM2S_RESP_DECERR_MASK) >> TSW_MM2S_RESP_DECERR_SHIFT)

/*
 * SLVERR (RO)
 *
 * slave error
 */
#define TSW_MM2S_RESP_SLVERR_MASK (0x10000000UL)
#define TSW_MM2S_RESP_SLVERR_SHIFT (28U)
#define TSW_MM2S_RESP_SLVERR_GET(x) (((uint32_t)(x) & TSW_MM2S_RESP_SLVERR_MASK) >> TSW_MM2S_RESP_SLVERR_SHIFT)

/*
 * ID (RO)
 *
 * command ID feedback
 */
#define TSW_MM2S_RESP_ID_MASK (0xF000000UL)
#define TSW_MM2S_RESP_ID_SHIFT (24U)
#define TSW_MM2S_RESP_ID_GET(x) (((uint32_t)(x) & TSW_MM2S_RESP_ID_MASK) >> TSW_MM2S_RESP_ID_SHIFT)

/*
 * LENGTH (RO)
 *
 * requested length of tansfer in bytes from command
 */
#define TSW_MM2S_RESP_LENGTH_MASK (0xFFFFU)
#define TSW_MM2S_RESP_LENGTH_SHIFT (0U)
#define TSW_MM2S_RESP_LENGTH_GET(x) (((uint32_t)(x) & TSW_MM2S_RESP_LENGTH_MASK) >> TSW_MM2S_RESP_LENGTH_SHIFT)

/* Bitfield definition for register: S2MM_DMA_CR */
/*
 * MXLEN (RW)
 *
 * max axi burst size
 */
#define TSW_S2MM_DMA_CR_MXLEN_MASK (0xFF000000UL)
#define TSW_S2MM_DMA_CR_MXLEN_SHIFT (24U)
#define TSW_S2MM_DMA_CR_MXLEN_SET(x) (((uint32_t)(x) << TSW_S2MM_DMA_CR_MXLEN_SHIFT) & TSW_S2MM_DMA_CR_MXLEN_MASK)
#define TSW_S2MM_DMA_CR_MXLEN_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_CR_MXLEN_MASK) >> TSW_S2MM_DMA_CR_MXLEN_SHIFT)

