RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * IRQEN (RW)
 *
 * interrupt request enable
 */
#define TSW_S2MM_DMA_CR_IRQEN_MASK (0x8U)
#define TSW_S2MM_DMA_CR_IRQEN_SHIFT (3U)
#define TSW_S2MM_DMA_CR_IRQEN_SET(x) (((uint32_t)(x) << TSW_S2MM_DMA_CR_IRQEN_SHIFT) & TSW_S2MM_DMA_CR_IRQEN_MASK)
#define TSW_S2MM_DMA_CR_IRQEN_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_CR_IRQEN_MASK) >> TSW_S2MM_DMA_CR_IRQEN_SHIFT)

/*
 * RESET (WO)
 *
 * do reset when writing 1
 */
#define TSW_S2MM_DMA_CR_RESET_MASK (0x4U)
#define TSW_S2MM_DMA_CR_RESET_SHIFT (2U)
#define TSW_S2MM_DMA_CR_RESET_SET(x) (((uint32_t)(x) << TSW_S2MM_DMA_CR_RESET_SHIFT) & TSW_S2MM_DMA_CR_RESET_MASK)
#define TSW_S2MM_DMA_CR_RESET_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_CR_RESET_MASK) >> TSW_S2MM_DMA_CR_RESET_SHIFT)

/*
 * SOE (RW)
 *
 * stop on error flag
 */
#define TSW_S2MM_DMA_CR_SOE_MASK (0x2U)
#define TSW_S2MM_DMA_CR_SOE_SHIFT (1U)
#define TSW_S2MM_DMA_CR_SOE_SET(x) (((uint32_t)(x) << TSW_S2MM_DMA_CR_SOE_SHIFT) & TSW_S2MM_DMA_CR_SOE_MASK)
#define TSW_S2MM_DMA_CR_SOE_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_CR_SOE_MASK) >> TSW_S2MM_DMA_CR_SOE_SHIFT)

/*
 * RUN (RW)
 *
 * run commands from queue to data mover
 */
#define TSW_S2MM_DMA_CR_RUN_MASK (0x1U)
#define TSW_S2MM_DMA_CR_RUN_SHIFT (0U)
#define TSW_S2MM_DMA_CR_RUN_SET(x) (((uint32_t)(x) << TSW_S2MM_DMA_CR_RUN_SHIFT) & TSW_S2MM_DMA_CR_RUN_MASK)
#define TSW_S2MM_DMA_CR_RUN_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_CR_RUN_MASK) >> TSW_S2MM_DMA_CR_RUN_SHIFT)

/* Bitfield definition for register: S2MM_DMA_SR */
/*
 * RBUFF (RO)
 *
 * response buffer full
 */
#define TSW_S2MM_DMA_SR_RBUFF_MASK (0x80U)
#define TSW_S2MM_DMA_SR_RBUFF_SHIFT (7U)
#define TSW_S2MM_DMA_SR_RBUFF_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_SR_RBUFF_MASK) >> TSW_S2MM_DMA_SR_RBUFF_SHIFT)

/*
 * RBUFE (RO)
 *
 * response buffer empty
 */
#define TSW_S2MM_DMA_SR_RBUFE_MASK (0x40U)
#define TSW_S2MM_DMA_SR_RBUFE_SHIFT (6U)
#define TSW_S2MM_DMA_SR_RBUFE_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_SR_RBUFE_MASK) >> TSW_S2MM_DMA_SR_RBUFE_SHIFT)

/*
 * CBUFF (RO)
 *
 * command buffer full
 */
#define TSW_S2MM_DMA_SR_CBUFF_MASK (0x20U)
#define TSW_S2MM_DMA_SR_CBUFF_SHIFT (5U)
#define TSW_S2MM_DMA_SR_CBUFF_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_SR_CBUFF_MASK) >> TSW_S2MM_DMA_SR_CBUFF_SHIFT)

/*
 * CBUFE (RO)
 *
 * command buffer empty
 */
#define TSW_S2MM_DMA_SR_CBUFE_MASK (0x10U)
#define TSW_S2MM_DMA_SR_CBUFE_SHIFT (4U)
#define TSW_S2MM_DMA_SR_CBUFE_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_SR_CBUFE_MASK) >> TSW_S2MM_DMA_SR_CBUFE_SHIFT)

/*
 * IRQ (RWC)
 *
 * interrupt request pending
 */
#define TSW_S2MM_DMA_SR_IRQ_MASK (0x8U)
#define TSW_S2MM_DMA_SR_IRQ_SHIFT (3U)
#define TSW_S2MM_DMA_SR_IRQ_SET(x) (((uint32_t)(x) << TSW_S2MM_DMA_SR_IRQ_SHIFT) & TSW_S2MM_DMA_SR_IRQ_MASK)
#define TSW_S2MM_DMA_SR_IRQ_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_SR_IRQ_MASK) >> TSW_S2MM_DMA_SR_IRQ_SHIFT)

/*
 * RSET (RO)
 *
 * resetting status
 */
#define TSW_S2MM_DMA_SR_RSET_MASK (0x4U)
#define TSW_S2MM_DMA_SR_RSET_SHIFT (2U)
#define TSW_S2MM_DMA_SR_RSET_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_SR_RSET_MASK) >> TSW_S2MM_DMA_SR_RSET_SHIFT)

/*
 * BUSY (RO)
 *
 * busy, issued command and outstanding response
 */
#define TSW_S2MM_DMA_SR_BUSY_MASK (0x2U)
#define TSW_S2MM_DMA_SR_BUSY_SHIFT (1U)
#define TSW_S2MM_DMA_SR_BUSY_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_SR_BUSY_MASK) >> TSW_S2MM_DMA_SR_BUSY_SHIFT)

/*
 * STOP (RO)
 *
 * s2mm is stopped
 */
#define TSW_S2MM_DMA_SR_STOP_MASK (0x1U)
#define TSW_S2MM_DMA_SR_STOP_SHIFT (0U)
#define TSW_S2MM_DMA_SR_STOP_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_SR_STOP_MASK) >> TSW_S2MM_DMA_SR_STOP_SHIFT)

/* Bitfield definition for register: S2MM_DMA_FILL */
/*
 * RFILL (RO)
 *
 * response buffer fill level
 */
#define TSW_S2MM_DMA_FILL_RFILL_MASK (0xFFFF0000UL)
#define TSW_S2MM_DMA_FILL_RFILL_SHIFT (16U)
#define TSW_S2MM_DMA_FILL_RFILL_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_FILL_RFILL_MASK) >> TSW_S2MM_DMA_FILL_RFILL_SHIFT)

/*
 * CFILL (RO)
 *
 * command buffer fill level
 */
#define TSW_S2MM_DMA_FILL_CFILL_MASK (0xFFFFU)
#define TSW_S2MM_DMA_FILL_CFILL_SHIFT (0U)
#define TSW_S2MM_DMA_FILL_CFILL_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_FILL_CFILL_MASK) >> TSW_S2MM_DMA_FILL_CFILL_SHIFT)

/* Bitfield definition for register: S2MM_DMA_CFG */
/*
 * DBUFD (RO)
 *
 * data buffer depth
 */
#define TSW_S2MM_DMA_CFG_DBUFD_MASK (0xF000000UL)
#define TSW_S2MM_DMA_CFG_DBUFD_SHIFT (24U)
#define TSW_S2MM_DMA_CFG_DBUFD_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_CFG_DBUFD_MASK) >> TSW_S2MM_DMA_CFG_DBUFD_SHIFT)

/*
 * CBUFD (RO)
 *
 * command buffer depth
 */
#define TSW_S2MM_DMA_CFG_CBUFD_MASK (0xF00000UL)
#define TSW_S2MM_DMA_CFG_CBUFD_SHIFT (20U)
#define TSW_S2MM_DMA_CFG_CBUFD_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_CFG_CBUFD_MASK) >> TSW_S2MM_DMA_CFG_CBUFD_SHIFT)

/*
 * ENA64 (RO)
 *
 * enabled support for 64 bit
 */
#define TSW_S2MM_DMA_CFG_ENA64_MASK (0x80000UL)
#define TSW_S2MM_DMA_CFG_ENA64_SHIFT (19U)
#define TSW_S2MM_DMA_CFG_ENA64_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_CFG_ENA64_MASK) >> TSW_S2MM_DMA_CFG_ENA64_SHIFT)

/*
 * ASIZE (RO)
 *
 * axi data bus width
 */
#define TSW_S2MM_DMA_CFG_ASIZE_MASK (0x70000UL)
#define TSW_S2MM_DMA_CFG_ASIZE_SHIFT (16U)
#define TSW_S2MM_DMA_CFG_ASIZE_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_CFG_ASIZE_MASK) >> TSW_S2MM_DMA_CFG_ASIZE_SHIFT)

/*
 * VER (RO)
 *
 * IP version
 */
#define TSW_S2MM_DMA_CFG_VER_MASK (0xFFFFU)
#define TSW_S2MM_DMA_CFG_VER_SHIFT (0U)
#define TSW_S2MM_DMA_CFG_VER_GET(x) (((uint32_t)(x) & TSW_S2MM_DMA_CFG_VER_MASK) >> TSW_S2MM_DMA_CFG_VER_SHIFT)

/* Bitfield definition for register: S2MM_ADDRLO */
/*
 * ADDRLO (RW)
 *
 * axi address
 */
#define TSW_S2MM_ADDRLO_ADDRLO_MASK (0xFFFFFFFFUL)
#define TSW_S2MM_ADDRLO_ADDRLO_SHIFT (0U)
#define TSW_S2MM_ADDRLO_ADDRLO_SET(x) (((uint32_t)(x) << TSW_S2MM_ADDRLO_ADDRLO_SHIFT) & TSW_S2MM_ADDRLO_ADDRLO_MASK)
#define TSW_S2MM_ADDRLO_ADDRLO_GET(x) (((uint32_t)(x) & TSW_S2MM_ADDRLO_ADDRLO_MASK) >> TSW_S2MM_ADDRLO_ADDRLO_SHIFT)

/* Bitfield definition for register: S2MM_LENGTH */
/*
 * LENGTH (RW)
 *
 * transfer request length in bytes
 */
#define TSW_S2MM_LENGTH_LENGTH_MASK (0xFFFFU)
#define TSW_S2MM_LENGTH_LENGTH_SHIFT (0U)
#define TSW_S2MM_LENGTH_LENGTH_SET(x) (((uint32_t)(x) << TSW_S2MM_LENGTH_LENGTH_SHIFT) & TSW_S2MM_LENGTH_LENGTH_MASK)
#define TSW_S2MM_LENGTH_LENGTH_GET(x) (((uint32_t)(x) & TSW_S2MM_LENGTH_LENGTH_MASK) >> TSW_S2MM_LENGTH_LENGTH_SHIFT)

