RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/* Bitfield definition for register: S2MM_CTRL */
/*
 * GO (WO)
 *
 * commit buffered descriptor to command queue
 */
#define TSW_S2MM_CTRL_GO_MASK (0x80000000UL)
#define TSW_S2MM_CTRL_GO_SHIFT (31U)
#define TSW_S2MM_CTRL_GO_SET(x) (((uint32_t)(x) << TSW_S2MM_CTRL_GO_SHIFT) & TSW_S2MM_CTRL_GO_MASK)
#define TSW_S2MM_CTRL_GO_GET(x) (((uint32_t)(x) & TSW_S2MM_CTRL_GO_MASK) >> TSW_S2MM_CTRL_GO_SHIFT)

/*
 * ID (RW)
 *
 * command id
 */
#define TSW_S2MM_CTRL_ID_MASK (0xFU)
#define TSW_S2MM_CTRL_ID_SHIFT (0U)
#define TSW_S2MM_CTRL_ID_SET(x) (((uint32_t)(x) << TSW_S2MM_CTRL_ID_SHIFT) & TSW_S2MM_CTRL_ID_MASK)
#define TSW_S2MM_CTRL_ID_GET(x) (((uint32_t)(x) & TSW_S2MM_CTRL_ID_MASK) >> TSW_S2MM_CTRL_ID_SHIFT)

/* Bitfield definition for register: S2MM_RESP */
/*
 * LAST (RO)
 *
 * axi-stream with last
 */
#define TSW_S2MM_RESP_LAST_MASK (0x40000000UL)
#define TSW_S2MM_RESP_LAST_SHIFT (30U)
#define TSW_S2MM_RESP_LAST_GET(x) (((uint32_t)(x) & TSW_S2MM_RESP_LAST_MASK) >> TSW_S2MM_RESP_LAST_SHIFT)

/*
 * DECERR (RO)
 *
 * decode error
 */
#define TSW_S2MM_RESP_DECERR_MASK (0x20000000UL)
#define TSW_S2MM_RESP_DECERR_SHIFT (29U)
#define TSW_S2MM_RESP_DECERR_GET(x) (((uint32_t)(x) & TSW_S2MM_RESP_DECERR_MASK) >> TSW_S2MM_RESP_DECERR_SHIFT)

/*
 * SLVERR (RO)
 *
 * slave error
 */
#define TSW_S2MM_RESP_SLVERR_MASK (0x10000000UL)
#define TSW_S2MM_RESP_SLVERR_SHIFT (28U)
#define TSW_S2MM_RESP_SLVERR_GET(x) (((uint32_t)(x) & TSW_S2MM_RESP_SLVERR_MASK) >> TSW_S2MM_RESP_SLVERR_SHIFT)

/*
 * ID (RO)
 *
 * command ID feedback
 */
#define TSW_S2MM_RESP_ID_MASK (0xF000000UL)
#define TSW_S2MM_RESP_ID_SHIFT (24U)
#define TSW_S2MM_RESP_ID_GET(x) (((uint32_t)(x) & TSW_S2MM_RESP_ID_MASK) >> TSW_S2MM_RESP_ID_SHIFT)

/*
 * LENGTH (RO)
 *
 * received packet size when terminated by TLAST
 */
#define TSW_S2MM_RESP_LENGTH_MASK (0xFFFFU)
#define TSW_S2MM_RESP_LENGTH_SHIFT (0U)
#define TSW_S2MM_RESP_LENGTH_GET(x) (((uint32_t)(x) & TSW_S2MM_RESP_LENGTH_MASK) >> TSW_S2MM_RESP_LENGTH_SHIFT)

/* Bitfield definition for register: PTP_EVT_TS_CTL */
/*
 * ATSEN (RW)
 *
 * auxiliay snapshot enable
 */
#define TSW_PTP_EVT_TS_CTL_ATSEN_MASK (0x1E000000UL)
#define TSW_PTP_EVT_TS_CTL_ATSEN_SHIFT (25U)
#define TSW_PTP_EVT_TS_CTL_ATSEN_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_TS_CTL_ATSEN_SHIFT) & TSW_PTP_EVT_TS_CTL_ATSEN_MASK)
#define TSW_PTP_EVT_TS_CTL_ATSEN_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_TS_CTL_ATSEN_MASK) >> TSW_PTP_EVT_TS_CTL_ATSEN_SHIFT)

/*
 * ATSFC (W1C)
 *
 * auxiliary snapshot fifo clear
 */
#define TSW_PTP_EVT_TS_CTL_ATSFC_MASK (0x1000000UL)
#define TSW_PTP_EVT_TS_CTL_ATSFC_SHIFT (24U)
#define TSW_PTP_EVT_TS_CTL_ATSFC_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_TS_CTL_ATSFC_SHIFT) & TSW_PTP_EVT_TS_CTL_ATSFC_MASK)
#define TSW_PTP_EVT_TS_CTL_ATSFC_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_TS_CTL_ATSFC_MASK) >> TSW_PTP_EVT_TS_CTL_ATSFC_SHIFT)

/*
 * TSTIG (RW)
 *
 * timestamp interrupt trigger enable
 */
#define TSW_PTP_EVT_TS_CTL_TSTIG_MASK (0x10U)
#define TSW_PTP_EVT_TS_CTL_TSTIG_SHIFT (4U)
#define TSW_PTP_EVT_TS_CTL_TSTIG_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_TS_CTL_TSTIG_SHIFT) & TSW_PTP_EVT_TS_CTL_TSTIG_MASK)
#define TSW_PTP_EVT_TS_CTL_TSTIG_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_TS_CTL_TSTIG_MASK) >> TSW_PTP_EVT_TS_CTL_TSTIG_SHIFT)

/* Bitfield definition for register: PTP_EVT_PPS_TOD_SEC */
/*
 * PPS_TOD_SEC (RO)
 *
 * pps tod seconds
 */
#define TSW_PTP_EVT_PPS_TOD_SEC_PPS_TOD_SEC_MASK (0xFFFFFFFFUL)
#define TSW_PTP_EVT_PPS_TOD_SEC_PPS_TOD_SEC_SHIFT (0U)
#define TSW_PTP_EVT_PPS_TOD_SEC_PPS_TOD_SEC_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_PPS_TOD_SEC_PPS_TOD_SEC_MASK) >> TSW_PTP_EVT_PPS_TOD_SEC_PPS_TOD_SEC_SHIFT)

/* Bitfield definition for register: PTP_EVT_PPS_TOD_NS */
/*
 * PPS_TOD_NS (RO)
 *
 * pps tod sub seconds
 */
#define TSW_PTP_EVT_PPS_TOD_NS_PPS_TOD_NS_MASK (0x3FFFFFFFUL)
#define TSW_PTP_EVT_PPS_TOD_NS_PPS_TOD_NS_SHIFT (0U)
#define TSW_PTP_EVT_PPS_TOD_NS_PPS_TOD_NS_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_PPS_TOD_NS_PPS_TOD_NS_MASK) >> TSW_PTP_EVT_PPS_TOD_NS_PPS_TOD_NS_SHIFT)

/* Bitfield definition for register: PTP_EVT_SCP_SEC0 */
/*
 * SCP_SEC (RW)
 *
 * target time seconds
 */
#define TSW_PTP_EVT_SCP_SEC0_SCP_SEC_MASK (0xFFFFFFFFUL)
#define TSW_PTP_EVT_SCP_SEC0_SCP_SEC_SHIFT (0U)
#define TSW_PTP_EVT_SCP_SEC0_SCP_SEC_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_SCP_SEC0_SCP_SEC_SHIFT) & TSW_PTP_EVT_SCP_SEC0_SCP_SEC_MASK)
#define TSW_PTP_EVT_SCP_SEC0_SCP_SEC_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_SCP_SEC0_SCP_SEC_MASK) >> TSW_PTP_EVT_SCP_SEC0_SCP_SEC_SHIFT)

/* Bitfield definition for register: PTP_EVT_SCP_NS0 */
/*
 * SCP_NS (RW)
 *
 * target time sub seconds
 */
#define TSW_PTP_EVT_SCP_NS0_SCP_NS_MASK (0x3FFFFFFFUL)
#define TSW_PTP_EVT_SCP_NS0_SCP_NS_SHIFT (0U)
#define TSW_PTP_EVT_SCP_NS0_SCP_NS_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_SCP_NS0_SCP_NS_SHIFT) & TSW_PTP_EVT_SCP_NS0_SCP_NS_MASK)
#define TSW_PTP_EVT_SCP_NS0_SCP_NS_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_SCP_NS0_SCP_NS_MASK) >> TSW_PTP_EVT_SCP_NS0_SCP_NS_SHIFT)

/* Bitfield definition for register: PTP_EVT_TMR_STS */
/*
 * RD_CNT (RO)
 *
 * fifo valid count
 */
#define TSW_PTP_EVT_TMR_STS_RD_CNT_MASK (0x3E000000UL)
#define TSW_PTP_EVT_TMR_STS_RD_CNT_SHIFT (25U)
#define TSW_PTP_EVT_TMR_STS_RD_CNT_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_TMR_STS_RD_CNT_MASK) >> TSW_PTP_EVT_TMR_STS_RD_CNT_SHIFT)

/*
 * ATSSTM (RO)
 *
 * auxiliary fifo full error
 */
#define TSW_PTP_EVT_TMR_STS_ATSSTM_MASK (0x1000000UL)
#define TSW_PTP_EVT_TMR_STS_ATSSTM_SHIFT (24U)
#define TSW_PTP_EVT_TMR_STS_ATSSTM_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_TMR_STS_ATSSTM_MASK) >> TSW_PTP_EVT_TMR_STS_ATSSTM_SHIFT)

/*
 * ATPORT (RO)
 *
 * auxiliary port
 */
#define TSW_PTP_EVT_TMR_STS_ATPORT_MASK (0xF0000UL)
#define TSW_PTP_EVT_TMR_STS_ATPORT_SHIFT (16U)
#define TSW_PTP_EVT_TMR_STS_ATPORT_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_TMR_STS_ATPORT_MASK) >> TSW_PTP_EVT_TMR_STS_ATPORT_SHIFT)

/*
 * PPS_TOD_INTR (RC)
 *
 * pps tod intrrupt
 */
#define TSW_PTP_EVT_TMR_STS_PPS_TOD_INTR_MASK (0x400U)
#define TSW_PTP_EVT_TMR_STS_PPS_TOD_INTR_SHIFT (10U)
#define TSW_PTP_EVT_TMR_STS_PPS_TOD_INTR_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_TMR_STS_PPS_TOD_INTR_MASK) >> TSW_PTP_EVT_TMR_STS_PPS_TOD_INTR_SHIFT)

