RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * PPS_MODE0 (RW)
 *
 * Target Time Register Mode for PPS0 Output
 */
#define TSW_PTP_EVT_PPS_CMD_PPS_MODE0_MASK (0x60U)
#define TSW_PTP_EVT_PPS_CMD_PPS_MODE0_SHIFT (5U)
#define TSW_PTP_EVT_PPS_CMD_PPS_MODE0_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_PPS_CMD_PPS_MODE0_SHIFT) & TSW_PTP_EVT_PPS_CMD_PPS_MODE0_MASK)
#define TSW_PTP_EVT_PPS_CMD_PPS_MODE0_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_PPS_CMD_PPS_MODE0_MASK) >> TSW_PTP_EVT_PPS_CMD_PPS_MODE0_SHIFT)

/*
 * PPS_EN0 (RW)
 *
 * flexible PPS0 output mode enable
 */
#define TSW_PTP_EVT_PPS_CMD_PPS_EN0_MASK (0x10U)
#define TSW_PTP_EVT_PPS_CMD_PPS_EN0_SHIFT (4U)
#define TSW_PTP_EVT_PPS_CMD_PPS_EN0_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_PPS_CMD_PPS_EN0_SHIFT) & TSW_PTP_EVT_PPS_CMD_PPS_EN0_MASK)
#define TSW_PTP_EVT_PPS_CMD_PPS_EN0_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_PPS_CMD_PPS_EN0_MASK) >> TSW_PTP_EVT_PPS_CMD_PPS_EN0_SHIFT)

/*
 * PPS_CMD0 (RW)
 *
 * pps0 command
 */
#define TSW_PTP_EVT_PPS_CMD_PPS_CMD0_MASK (0xFU)
#define TSW_PTP_EVT_PPS_CMD_PPS_CMD0_SHIFT (0U)
#define TSW_PTP_EVT_PPS_CMD_PPS_CMD0_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_PPS_CMD_PPS_CMD0_SHIFT) & TSW_PTP_EVT_PPS_CMD_PPS_CMD0_MASK)
#define TSW_PTP_EVT_PPS_CMD_PPS_CMD0_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_PPS_CMD_PPS_CMD0_MASK) >> TSW_PTP_EVT_PPS_CMD_PPS_CMD0_SHIFT)

/* Bitfield definition for register: PTP_EVT_ATSLO */
/*
 * STSLO (RO)
 *
 * auxiliary fifo read sub seconds info
 */
#define TSW_PTP_EVT_ATSLO_STSLO_MASK (0x7FFFFFFFUL)
#define TSW_PTP_EVT_ATSLO_STSLO_SHIFT (0U)
#define TSW_PTP_EVT_ATSLO_STSLO_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_ATSLO_STSLO_MASK) >> TSW_PTP_EVT_ATSLO_STSLO_SHIFT)

/* Bitfield definition for register: PTP_EVT_ATSHI */
/*
 * STSHI (RO)
 *
 * auxiliary fifo read  seconds info
 */
#define TSW_PTP_EVT_ATSHI_STSHI_MASK (0xFFFFFFFFUL)
#define TSW_PTP_EVT_ATSHI_STSHI_SHIFT (0U)
#define TSW_PTP_EVT_ATSHI_STSHI_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_ATSHI_STSHI_MASK) >> TSW_PTP_EVT_ATSHI_STSHI_SHIFT)

/* Bitfield definition for register: PTP_EVT_PPS0_INTERVAL */
/*
 * PPSINT (RW)
 *
 * PPS0 output signal interval
 */
#define TSW_PTP_EVT_PPS0_INTERVAL_PPSINT_MASK (0xFFFFFFFFUL)
#define TSW_PTP_EVT_PPS0_INTERVAL_PPSINT_SHIFT (0U)
#define TSW_PTP_EVT_PPS0_INTERVAL_PPSINT_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_PPS0_INTERVAL_PPSINT_SHIFT) & TSW_PTP_EVT_PPS0_INTERVAL_PPSINT_MASK)
#define TSW_PTP_EVT_PPS0_INTERVAL_PPSINT_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_PPS0_INTERVAL_PPSINT_MASK) >> TSW_PTP_EVT_PPS0_INTERVAL_PPSINT_SHIFT)

/* Bitfield definition for register: PTP_EVT_PPS0_WIDTH */
/*
 * PPS_WIDTH (RW)
 *
 * pps0 output signal width
 */
#define TSW_PTP_EVT_PPS0_WIDTH_PPS_WIDTH_MASK (0xFFFFFFFFUL)
#define TSW_PTP_EVT_PPS0_WIDTH_PPS_WIDTH_SHIFT (0U)
#define TSW_PTP_EVT_PPS0_WIDTH_PPS_WIDTH_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_PPS0_WIDTH_PPS_WIDTH_SHIFT) & TSW_PTP_EVT_PPS0_WIDTH_PPS_WIDTH_MASK)
#define TSW_PTP_EVT_PPS0_WIDTH_PPS_WIDTH_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_PPS0_WIDTH_PPS_WIDTH_MASK) >> TSW_PTP_EVT_PPS0_WIDTH_PPS_WIDTH_SHIFT)

/* Bitfield definition for register: PTP_EVT_SCP_SEC1 */
/*
 * SCP_SEC (RW)
 *
 * target time seconds
 */
#define TSW_PTP_EVT_SCP_SEC1_SCP_SEC_MASK (0xFFFFFFFFUL)
#define TSW_PTP_EVT_SCP_SEC1_SCP_SEC_SHIFT (0U)
#define TSW_PTP_EVT_SCP_SEC1_SCP_SEC_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_SCP_SEC1_SCP_SEC_SHIFT) & TSW_PTP_EVT_SCP_SEC1_SCP_SEC_MASK)
#define TSW_PTP_EVT_SCP_SEC1_SCP_SEC_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_SCP_SEC1_SCP_SEC_MASK) >> TSW_PTP_EVT_SCP_SEC1_SCP_SEC_SHIFT)

/* Bitfield definition for register: PTP_EVT_SCP_NS1 */
/*
 * SCP_NS (RW)
 *
 * target time sub seconds
 */
#define TSW_PTP_EVT_SCP_NS1_SCP_NS_MASK (0x3FFFFFFFUL)
#define TSW_PTP_EVT_SCP_NS1_SCP_NS_SHIFT (0U)
#define TSW_PTP_EVT_SCP_NS1_SCP_NS_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_SCP_NS1_SCP_NS_SHIFT) & TSW_PTP_EVT_SCP_NS1_SCP_NS_MASK)
#define TSW_PTP_EVT_SCP_NS1_SCP_NS_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_SCP_NS1_SCP_NS_MASK) >> TSW_PTP_EVT_SCP_NS1_SCP_NS_SHIFT)

/* Bitfield definition for register: PTP_EVT_PPS1_INTERVAL */
/*
 * PPSINT (RW)
 *
 * PPS1 output signal interval
 */
#define TSW_PTP_EVT_PPS1_INTERVAL_PPSINT_MASK (0xFFFFFFFFUL)
#define TSW_PTP_EVT_PPS1_INTERVAL_PPSINT_SHIFT (0U)
#define TSW_PTP_EVT_PPS1_INTERVAL_PPSINT_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_PPS1_INTERVAL_PPSINT_SHIFT) & TSW_PTP_EVT_PPS1_INTERVAL_PPSINT_MASK)
#define TSW_PTP_EVT_PPS1_INTERVAL_PPSINT_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_PPS1_INTERVAL_PPSINT_MASK) >> TSW_PTP_EVT_PPS1_INTERVAL_PPSINT_SHIFT)

/* Bitfield definition for register: PTP_EVT_PPS1_WIDTH */
/*
 * PPS_WIDTH (RW)
 *
 * pps1 output signal width
 */
#define TSW_PTP_EVT_PPS1_WIDTH_PPS_WIDTH_MASK (0xFFFFFFFFUL)
#define TSW_PTP_EVT_PPS1_WIDTH_PPS_WIDTH_SHIFT (0U)
#define TSW_PTP_EVT_PPS1_WIDTH_PPS_WIDTH_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_PPS1_WIDTH_PPS_WIDTH_SHIFT) & TSW_PTP_EVT_PPS1_WIDTH_PPS_WIDTH_MASK)
#define TSW_PTP_EVT_PPS1_WIDTH_PPS_WIDTH_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_PPS1_WIDTH_PPS_WIDTH_MASK) >> TSW_PTP_EVT_PPS1_WIDTH_PPS_WIDTH_SHIFT)

/* Bitfield definition for register: PTP_EVT_SCP_SEC2 */
/*
 * SCP_SEC (RW)
 *
 * target time seconds
 */
#define TSW_PTP_EVT_SCP_SEC2_SCP_SEC_MASK (0xFFFFFFFFUL)
#define TSW_PTP_EVT_SCP_SEC2_SCP_SEC_SHIFT (0U)
#define TSW_PTP_EVT_SCP_SEC2_SCP_SEC_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_SCP_SEC2_SCP_SEC_SHIFT) & TSW_PTP_EVT_SCP_SEC2_SCP_SEC_MASK)
#define TSW_PTP_EVT_SCP_SEC2_SCP_SEC_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_SCP_SEC2_SCP_SEC_MASK) >> TSW_PTP_EVT_SCP_SEC2_SCP_SEC_SHIFT)

/* Bitfield definition for register: PTP_EVT_SCP_NS2 */
/*
 * SCP_NS (RW)
 *
 * target time sub seconds
 */
#define TSW_PTP_EVT_SCP_NS2_SCP_NS_MASK (0x3FFFFFFFUL)
#define TSW_PTP_EVT_SCP_NS2_SCP_NS_SHIFT (0U)
#define TSW_PTP_EVT_SCP_NS2_SCP_NS_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_SCP_NS2_SCP_NS_SHIFT) & TSW_PTP_EVT_SCP_NS2_SCP_NS_MASK)
#define TSW_PTP_EVT_SCP_NS2_SCP_NS_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_SCP_NS2_SCP_NS_MASK) >> TSW_PTP_EVT_SCP_NS2_SCP_NS_SHIFT)

/* Bitfield definition for register: PTP_EVT_PPS2_INTERVAL */
/*
 * PPSINT (RW)
 *
 * PPS2 output signal interval
 */
#define TSW_PTP_EVT_PPS2_INTERVAL_PPSINT_MASK (0xFFFFFFFFUL)
#define TSW_PTP_EVT_PPS2_INTERVAL_PPSINT_SHIFT (0U)
#define TSW_PTP_EVT_PPS2_INTERVAL_PPSINT_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_PPS2_INTERVAL_PPSINT_SHIFT) & TSW_PTP_EVT_PPS2_INTERVAL_PPSINT_MASK)
#define TSW_PTP_EVT_PPS2_INTERVAL_PPSINT_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_PPS2_INTERVAL_PPSINT_MASK) >> TSW_PTP_EVT_PPS2_INTERVAL_PPSINT_SHIFT)

/* Bitfield definition for register: PTP_EVT_PPS2_WIDTH */
/*
 * PPS_WIDTH (RW)
 *
 * pps2 output signal width
 */
#define TSW_PTP_EVT_PPS2_WIDTH_PPS_WIDTH_MASK (0xFFFFFFFFUL)
#define TSW_PTP_EVT_PPS2_WIDTH_PPS_WIDTH_SHIFT (0U)
#define TSW_PTP_EVT_PPS2_WIDTH_PPS_WIDTH_SET(x) (((uint32_t)(x) << TSW_PTP_EVT_PPS2_WIDTH_PPS_WIDTH_SHIFT) & TSW_PTP_EVT_PPS2_WIDTH_PPS_WIDTH_MASK)
#define TSW_PTP_EVT_PPS2_WIDTH_PPS_WIDTH_GET(x) (((uint32_t)(x) & TSW_PTP_EVT_PPS2_WIDTH_PPS_WIDTH_MASK) >> TSW_PTP_EVT_PPS2_WIDTH_PPS_WIDTH_SHIFT)

