RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * PTP_EVT_RST (RW)
 *
 * ptp event module reset control
 */
#define TSW_SOFT_RST_CTRL_PTP_EVT_RST_MASK (0x400U)
#define TSW_SOFT_RST_CTRL_PTP_EVT_RST_SHIFT (10U)
#define TSW_SOFT_RST_CTRL_PTP_EVT_RST_SET(x) (((uint32_t)(x) << TSW_SOFT_RST_CTRL_PTP_EVT_RST_SHIFT) & TSW_SOFT_RST_CTRL_PTP_EVT_RST_MASK)
#define TSW_SOFT_RST_CTRL_PTP_EVT_RST_GET(x) (((uint32_t)(x) & TSW_SOFT_RST_CTRL_PTP_EVT_RST_MASK) >> TSW_SOFT_RST_CTRL_PTP_EVT_RST_SHIFT)

/*
 * DMA0_RST (RW)
 *
 * dma0 reset control
 */
#define TSW_SOFT_RST_CTRL_DMA0_RST_MASK (0x100U)
#define TSW_SOFT_RST_CTRL_DMA0_RST_SHIFT (8U)
#define TSW_SOFT_RST_CTRL_DMA0_RST_SET(x) (((uint32_t)(x) << TSW_SOFT_RST_CTRL_DMA0_RST_SHIFT) & TSW_SOFT_RST_CTRL_DMA0_RST_MASK)
#define TSW_SOFT_RST_CTRL_DMA0_RST_GET(x) (((uint32_t)(x) & TSW_SOFT_RST_CTRL_DMA0_RST_MASK) >> TSW_SOFT_RST_CTRL_DMA0_RST_SHIFT)

/*
 * PORT3_RX_RST (RW)
 *
 * port3 rx reset control
 */
#define TSW_SOFT_RST_CTRL_PORT3_RX_RST_MASK (0x20U)
#define TSW_SOFT_RST_CTRL_PORT3_RX_RST_SHIFT (5U)
#define TSW_SOFT_RST_CTRL_PORT3_RX_RST_SET(x) (((uint32_t)(x) << TSW_SOFT_RST_CTRL_PORT3_RX_RST_SHIFT) & TSW_SOFT_RST_CTRL_PORT3_RX_RST_MASK)
#define TSW_SOFT_RST_CTRL_PORT3_RX_RST_GET(x) (((uint32_t)(x) & TSW_SOFT_RST_CTRL_PORT3_RX_RST_MASK) >> TSW_SOFT_RST_CTRL_PORT3_RX_RST_SHIFT)

/*
 * PORT3_TX_RST (RW)
 *
 * port3 tx reset control
 */
#define TSW_SOFT_RST_CTRL_PORT3_TX_RST_MASK (0x10U)
#define TSW_SOFT_RST_CTRL_PORT3_TX_RST_SHIFT (4U)
#define TSW_SOFT_RST_CTRL_PORT3_TX_RST_SET(x) (((uint32_t)(x) << TSW_SOFT_RST_CTRL_PORT3_TX_RST_SHIFT) & TSW_SOFT_RST_CTRL_PORT3_TX_RST_MASK)
#define TSW_SOFT_RST_CTRL_PORT3_TX_RST_GET(x) (((uint32_t)(x) & TSW_SOFT_RST_CTRL_PORT3_TX_RST_MASK) >> TSW_SOFT_RST_CTRL_PORT3_TX_RST_SHIFT)

/*
 * PORT2_RX_RST (RW)
 *
 * port2 rx reset control
 */
#define TSW_SOFT_RST_CTRL_PORT2_RX_RST_MASK (0x8U)
#define TSW_SOFT_RST_CTRL_PORT2_RX_RST_SHIFT (3U)
#define TSW_SOFT_RST_CTRL_PORT2_RX_RST_SET(x) (((uint32_t)(x) << TSW_SOFT_RST_CTRL_PORT2_RX_RST_SHIFT) & TSW_SOFT_RST_CTRL_PORT2_RX_RST_MASK)
#define TSW_SOFT_RST_CTRL_PORT2_RX_RST_GET(x) (((uint32_t)(x) & TSW_SOFT_RST_CTRL_PORT2_RX_RST_MASK) >> TSW_SOFT_RST_CTRL_PORT2_RX_RST_SHIFT)

/*
 * PORT2_TX_RST (RW)
 *
 * port2 tx reset control
 */
#define TSW_SOFT_RST_CTRL_PORT2_TX_RST_MASK (0x4U)
#define TSW_SOFT_RST_CTRL_PORT2_TX_RST_SHIFT (2U)
#define TSW_SOFT_RST_CTRL_PORT2_TX_RST_SET(x) (((uint32_t)(x) << TSW_SOFT_RST_CTRL_PORT2_TX_RST_SHIFT) & TSW_SOFT_RST_CTRL_PORT2_TX_RST_MASK)
#define TSW_SOFT_RST_CTRL_PORT2_TX_RST_GET(x) (((uint32_t)(x) & TSW_SOFT_RST_CTRL_PORT2_TX_RST_MASK) >> TSW_SOFT_RST_CTRL_PORT2_TX_RST_SHIFT)

/*
 * PORT1_RX_RST (RW)
 *
 * port1 rx reset control
 */
#define TSW_SOFT_RST_CTRL_PORT1_RX_RST_MASK (0x2U)
#define TSW_SOFT_RST_CTRL_PORT1_RX_RST_SHIFT (1U)
#define TSW_SOFT_RST_CTRL_PORT1_RX_RST_SET(x) (((uint32_t)(x) << TSW_SOFT_RST_CTRL_PORT1_RX_RST_SHIFT) & TSW_SOFT_RST_CTRL_PORT1_RX_RST_MASK)
#define TSW_SOFT_RST_CTRL_PORT1_RX_RST_GET(x) (((uint32_t)(x) & TSW_SOFT_RST_CTRL_PORT1_RX_RST_MASK) >> TSW_SOFT_RST_CTRL_PORT1_RX_RST_SHIFT)

/*
 * PORT1_TX_RST (RW)
 *
 * port1 tx reset control
 */
#define TSW_SOFT_RST_CTRL_PORT1_TX_RST_MASK (0x1U)
#define TSW_SOFT_RST_CTRL_PORT1_TX_RST_SHIFT (0U)
#define TSW_SOFT_RST_CTRL_PORT1_TX_RST_SET(x) (((uint32_t)(x) << TSW_SOFT_RST_CTRL_PORT1_TX_RST_SHIFT) & TSW_SOFT_RST_CTRL_PORT1_TX_RST_MASK)
#define TSW_SOFT_RST_CTRL_PORT1_TX_RST_GET(x) (((uint32_t)(x) & TSW_SOFT_RST_CTRL_PORT1_TX_RST_MASK) >> TSW_SOFT_RST_CTRL_PORT1_TX_RST_SHIFT)

/* Bitfield definition for register: CPU_PORT_PORT_MAIN_TAGGING */
/*
 * FORCE (R/W)
 *
 * The VLAN-TAG with PVID will be inserted in every frame from Host as their first VLAN-TAG. This can be used for double tagging of tagged/trunk ports
 */
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_FORCE_MASK (0x20000UL)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_FORCE_SHIFT (17U)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_FORCE_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_PORT_MAIN_TAGGING_FORCE_SHIFT) & TSW_CPU_PORT_PORT_MAIN_TAGGING_FORCE_MASK)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_FORCE_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_PORT_MAIN_TAGGING_FORCE_MASK) >> TSW_CPU_PORT_PORT_MAIN_TAGGING_FORCE_SHIFT)

/*
 * ACCESS (R/W)
 *
 * Every tagged frame not matching PVID is filtered out. Every untagged ingress  frame will be tagged with PVID. Every egress frame with PVID will be untagged
 */
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_ACCESS_MASK (0x10000UL)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_ACCESS_SHIFT (16U)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_ACCESS_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_PORT_MAIN_TAGGING_ACCESS_SHIFT) & TSW_CPU_PORT_PORT_MAIN_TAGGING_ACCESS_MASK)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_ACCESS_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_PORT_MAIN_TAGGING_ACCESS_MASK) >> TSW_CPU_PORT_PORT_MAIN_TAGGING_ACCESS_SHIFT)

/*
 * PCP (R/W)
 *
 * VLAN-TCI: Priority Code Point, used when tagged.
 */
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_PCP_MASK (0xE000U)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_PCP_SHIFT (13U)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_PCP_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_PORT_MAIN_TAGGING_PCP_SHIFT) & TSW_CPU_PORT_PORT_MAIN_TAGGING_PCP_MASK)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_PCP_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_PORT_MAIN_TAGGING_PCP_MASK) >> TSW_CPU_PORT_PORT_MAIN_TAGGING_PCP_SHIFT)

/*
 * DEI (R/W)
 *
 * VLAN-TCI: Drop Eligible Indicator, used when tagged.
 */
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_DEI_MASK (0x1000U)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_DEI_SHIFT (12U)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_DEI_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_PORT_MAIN_TAGGING_DEI_SHIFT) & TSW_CPU_PORT_PORT_MAIN_TAGGING_DEI_MASK)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_DEI_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_PORT_MAIN_TAGGING_DEI_MASK) >> TSW_CPU_PORT_PORT_MAIN_TAGGING_DEI_SHIFT)

/*
 * PVID (R/W)
 *
 * Native VLAN of Port. Untagged traffic will be tagged with the native VLAN-ID By default the Port uses VLAN 1.
 */
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_PVID_MASK (0xFFFU)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_PVID_SHIFT (0U)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_PVID_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_PORT_MAIN_TAGGING_PVID_SHIFT) & TSW_CPU_PORT_PORT_MAIN_TAGGING_PVID_MASK)
#define TSW_CPU_PORT_PORT_MAIN_TAGGING_PVID_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_PORT_MAIN_TAGGING_PVID_MASK) >> TSW_CPU_PORT_PORT_MAIN_TAGGING_PVID_SHIFT)

/* Bitfield definition for register: CPU_PORT_PORT_MAIN_ENNABLE */
/*
 * EN_SF (R/W)
 *
 * only applicable for CPU-Port at egress: '1' to use S&F FIFO and '0' disable S&F FIFO. Changing during frame operation can lead to frame corruption
 */
#define TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_SF_MASK (0x2U)
#define TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_SF_SHIFT (1U)
#define TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_SF_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_SF_SHIFT) & TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_SF_MASK)
#define TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_SF_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_SF_MASK) >> TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_SF_SHIFT)

