RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * EN_QCI (R/W)
 *
 * if QCI is present at selected egress port, '1' to use QCI and '0' disable QCI. Changing during frame operation can lead to frame corruption.
 */
#define TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_QCI_MASK (0x1U)
#define TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_QCI_SHIFT (0U)
#define TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_QCI_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_QCI_SHIFT) & TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_QCI_MASK)
#define TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_QCI_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_QCI_MASK) >> TSW_CPU_PORT_PORT_MAIN_ENNABLE_EN_QCI_SHIFT)

/* Bitfield definition for register: CPU_PORT_EGRESS_STMID_ESELECT */
/*
 * ESEL (RO)
 *
 * Select entry. Selected entry mapped to 0x40 – 0x5C.
 */
#define TSW_CPU_PORT_EGRESS_STMID_ESELECT_ESEL_MASK (0xFFU)
#define TSW_CPU_PORT_EGRESS_STMID_ESELECT_ESEL_SHIFT (0U)
#define TSW_CPU_PORT_EGRESS_STMID_ESELECT_ESEL_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_ESELECT_ESEL_MASK) >> TSW_CPU_PORT_EGRESS_STMID_ESELECT_ESEL_SHIFT)

/* Bitfield definition for register: CPU_PORT_EGRESS_STMID_CONTROL */
/*
 * SID (R/W)
 *
 * Stream ID – inserted to header on match
 */
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_SID_MASK (0xFF00U)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_SID_SHIFT (8U)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_SID_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_CONTROL_SID_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_CONTROL_SID_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_SID_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_CONTROL_SID_MASK) >> TSW_CPU_PORT_EGRESS_STMID_CONTROL_SID_SHIFT)

/*
 * SEQGEN (R/W)
 *
 * Sequence number generation enable
 */
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_SEQGEN_MASK (0x80U)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_SEQGEN_SHIFT (7U)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_SEQGEN_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_CONTROL_SEQGEN_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_CONTROL_SEQGEN_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_SEQGEN_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_CONTROL_SEQGEN_MASK) >> TSW_CPU_PORT_EGRESS_STMID_CONTROL_SEQGEN_SHIFT)

/*
 * ACTCTL (R/W)
 *
 * Active Destination MAC – control. See Table 6-6.
 */
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_ACTCTL_MASK (0x30U)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_ACTCTL_SHIFT (4U)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_ACTCTL_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_CONTROL_ACTCTL_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_CONTROL_ACTCTL_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_ACTCTL_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_CONTROL_ACTCTL_MASK) >> TSW_CPU_PORT_EGRESS_STMID_CONTROL_ACTCTL_SHIFT)

/*
 * SMAC (R/W)
 *
 * 0: Lookup by Destination MAC 1: Lookup by Source MAC
 */
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_SMAC_MASK (0x8U)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_SMAC_SHIFT (3U)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_SMAC_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_CONTROL_SMAC_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_CONTROL_SMAC_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_SMAC_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_CONTROL_SMAC_MASK) >> TSW_CPU_PORT_EGRESS_STMID_CONTROL_SMAC_SHIFT)

/*
 * MODE (R/W)
 *
 * Lookup mode. 1:Priority – a frame must be untagged or priority tagged ; 2:Tagged – a frame must have a VLAN tag ; 3:All – a frame can be tagged or untagged
 */
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_MODE_MASK (0x6U)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_MODE_SHIFT (1U)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_MODE_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_CONTROL_MODE_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_CONTROL_MODE_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_MODE_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_CONTROL_MODE_MASK) >> TSW_CPU_PORT_EGRESS_STMID_CONTROL_MODE_SHIFT)

/*
 * EN (R/W)
 *
 * Enable entry
 */
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_EN_MASK (0x1U)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_EN_SHIFT (0U)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_EN_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_CONTROL_EN_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_CONTROL_EN_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_CONTROL_EN_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_CONTROL_EN_MASK) >> TSW_CPU_PORT_EGRESS_STMID_CONTROL_EN_SHIFT)

/* Bitfield definition for register: CPU_PORT_EGRESS_STMID_SEQNO */
/*
 * SEQNO (R/WC)
 *
 * Sequence number – next number when generating,any write access to clear.
 */
#define TSW_CPU_PORT_EGRESS_STMID_SEQNO_SEQNO_MASK (0xFFFFU)
#define TSW_CPU_PORT_EGRESS_STMID_SEQNO_SEQNO_SHIFT (0U)
#define TSW_CPU_PORT_EGRESS_STMID_SEQNO_SEQNO_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_SEQNO_SEQNO_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_SEQNO_SEQNO_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_SEQNO_SEQNO_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_SEQNO_SEQNO_MASK) >> TSW_CPU_PORT_EGRESS_STMID_SEQNO_SEQNO_SHIFT)

/* Bitfield definition for register: CPU_PORT_EGRESS_STMID_MATCHCNT */
/*
 * MATCH (R/WC)
 *
 * Entry match counter – any write access to clear.
 */
#define TSW_CPU_PORT_EGRESS_STMID_MATCHCNT_MATCH_MASK (0xFFFFFFFFUL)
#define TSW_CPU_PORT_EGRESS_STMID_MATCHCNT_MATCH_SHIFT (0U)
#define TSW_CPU_PORT_EGRESS_STMID_MATCHCNT_MATCH_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_MATCHCNT_MATCH_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_MATCHCNT_MATCH_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_MATCHCNT_MATCH_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_MATCHCNT_MATCH_MASK) >> TSW_CPU_PORT_EGRESS_STMID_MATCHCNT_MATCH_SHIFT)

/* Bitfield definition for register: CPU_PORT_EGRESS_STMID_MACLO */
/*
 * MACL (R/WC)
 *
 * MAC-Address [31:0] used by lookup.
 */
#define TSW_CPU_PORT_EGRESS_STMID_MACLO_MACL_MASK (0xFFFFFFFFUL)
#define TSW_CPU_PORT_EGRESS_STMID_MACLO_MACL_SHIFT (0U)
#define TSW_CPU_PORT_EGRESS_STMID_MACLO_MACL_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_MACLO_MACL_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_MACLO_MACL_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_MACLO_MACL_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_MACLO_MACL_MASK) >> TSW_CPU_PORT_EGRESS_STMID_MACLO_MACL_SHIFT)

