RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/* Bitfield definition for register: CPU_PORT_EGRESS_STMID_MACHI */
/*
 * VID (R/W)
 *
 * VLAN ID used by lookup.
 */
#define TSW_CPU_PORT_EGRESS_STMID_MACHI_VID_MASK (0xFFF0000UL)
#define TSW_CPU_PORT_EGRESS_STMID_MACHI_VID_SHIFT (16U)
#define TSW_CPU_PORT_EGRESS_STMID_MACHI_VID_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_MACHI_VID_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_MACHI_VID_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_MACHI_VID_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_MACHI_VID_MASK) >> TSW_CPU_PORT_EGRESS_STMID_MACHI_VID_SHIFT)

/*
 * MATCH (R/W)
 *
 * MAC-Address [47:31] used by lookup.
 */
#define TSW_CPU_PORT_EGRESS_STMID_MACHI_MATCH_MASK (0xFFFFU)
#define TSW_CPU_PORT_EGRESS_STMID_MACHI_MATCH_SHIFT (0U)
#define TSW_CPU_PORT_EGRESS_STMID_MACHI_MATCH_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_MACHI_MATCH_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_MACHI_MATCH_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_MACHI_MATCH_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_MACHI_MATCH_MASK) >> TSW_CPU_PORT_EGRESS_STMID_MACHI_MATCH_SHIFT)

/* Bitfield definition for register: CPU_PORT_EGRESS_STMID_AMACHI */
/*
 * APCP (R/W)
 *
 * Active Destination MAC, PCP
 */
#define TSW_CPU_PORT_EGRESS_STMID_AMACHI_APCP_MASK (0xF0000000UL)
#define TSW_CPU_PORT_EGRESS_STMID_AMACHI_APCP_SHIFT (28U)
#define TSW_CPU_PORT_EGRESS_STMID_AMACHI_APCP_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_AMACHI_APCP_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_AMACHI_APCP_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_AMACHI_APCP_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_AMACHI_APCP_MASK) >> TSW_CPU_PORT_EGRESS_STMID_AMACHI_APCP_SHIFT)

/*
 * AVID (R/W)
 *
 * Active Destination MAC, VLAN ID
 */
#define TSW_CPU_PORT_EGRESS_STMID_AMACHI_AVID_MASK (0xFFF0000UL)
#define TSW_CPU_PORT_EGRESS_STMID_AMACHI_AVID_SHIFT (16U)
#define TSW_CPU_PORT_EGRESS_STMID_AMACHI_AVID_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_AMACHI_AVID_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_AMACHI_AVID_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_AMACHI_AVID_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_AMACHI_AVID_MASK) >> TSW_CPU_PORT_EGRESS_STMID_AMACHI_AVID_SHIFT)

/*
 * AMACH (R/W)
 *
 * Active Destination MAC, MAC-Address [47:32]
 */
#define TSW_CPU_PORT_EGRESS_STMID_AMACHI_AMACH_MASK (0xFFFFU)
#define TSW_CPU_PORT_EGRESS_STMID_AMACHI_AMACH_SHIFT (0U)
#define TSW_CPU_PORT_EGRESS_STMID_AMACHI_AMACH_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_STMID_AMACHI_AMACH_SHIFT) & TSW_CPU_PORT_EGRESS_STMID_AMACHI_AMACH_MASK)
#define TSW_CPU_PORT_EGRESS_STMID_AMACHI_AMACH_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_STMID_AMACHI_AMACH_MASK) >> TSW_CPU_PORT_EGRESS_STMID_AMACHI_AMACH_SHIFT)

/* Bitfield definition for register: CPU_PORT_EGRESS_FRER_CONTROL */
/*
 * LATER (R/WC)
 *
 * Latent error flag – write 1 to clear
 */
#define TSW_CPU_PORT_EGRESS_FRER_CONTROL_LATER_MASK (0x2U)
#define TSW_CPU_PORT_EGRESS_FRER_CONTROL_LATER_SHIFT (1U)
#define TSW_CPU_PORT_EGRESS_FRER_CONTROL_LATER_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_FRER_CONTROL_LATER_SHIFT) & TSW_CPU_PORT_EGRESS_FRER_CONTROL_LATER_MASK)
#define TSW_CPU_PORT_EGRESS_FRER_CONTROL_LATER_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_FRER_CONTROL_LATER_MASK) >> TSW_CPU_PORT_EGRESS_FRER_CONTROL_LATER_SHIFT)

/*
 * RTENC (R/W)
 *
 * R-TAG encoding enable.
 */
#define TSW_CPU_PORT_EGRESS_FRER_CONTROL_RTENC_MASK (0x1U)
#define TSW_CPU_PORT_EGRESS_FRER_CONTROL_RTENC_SHIFT (0U)
#define TSW_CPU_PORT_EGRESS_FRER_CONTROL_RTENC_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_FRER_CONTROL_RTENC_SHIFT) & TSW_CPU_PORT_EGRESS_FRER_CONTROL_RTENC_MASK)
#define TSW_CPU_PORT_EGRESS_FRER_CONTROL_RTENC_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_FRER_CONTROL_RTENC_MASK) >> TSW_CPU_PORT_EGRESS_FRER_CONTROL_RTENC_SHIFT)

/* Bitfield definition for register: CPU_PORT_EGRESS_FRER_SIDSEL */
/*
 * SID (R/W)
 *
 * Stream ID selection for host access to IRFUNC and SRFUNC.
 */
#define TSW_CPU_PORT_EGRESS_FRER_SIDSEL_SID_MASK (0xFFU)
#define TSW_CPU_PORT_EGRESS_FRER_SIDSEL_SID_SHIFT (0U)
#define TSW_CPU_PORT_EGRESS_FRER_SIDSEL_SID_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_FRER_SIDSEL_SID_SHIFT) & TSW_CPU_PORT_EGRESS_FRER_SIDSEL_SID_MASK)
#define TSW_CPU_PORT_EGRESS_FRER_SIDSEL_SID_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_FRER_SIDSEL_SID_MASK) >> TSW_CPU_PORT_EGRESS_FRER_SIDSEL_SID_SHIFT)

/* Bitfield definition for register: CPU_PORT_EGRESS_FRER_IRFUNC */
/*
 * FEN (R/W)
 *
 * Individual recovery function: FEN – enable function for stream SIDSEL.SID. FIDX – function index for stream SIDSEL.SID If function does not exists (FIDX >= 2**FD), FEN will be set to 0.
 */
#define TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FEN_MASK (0x80000000UL)
#define TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FEN_SHIFT (31U)
#define TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FEN_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FEN_SHIFT) & TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FEN_MASK)
#define TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FEN_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FEN_MASK) >> TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FEN_SHIFT)

/*
 * FIDX (R/W)
 *
 */
#define TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FIDX_MASK (0xFFU)
#define TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FIDX_SHIFT (0U)
#define TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FIDX_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FIDX_SHIFT) & TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FIDX_MASK)
#define TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FIDX_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FIDX_MASK) >> TSW_CPU_PORT_EGRESS_FRER_IRFUNC_FIDX_SHIFT)

/* Bitfield definition for register: CPU_PORT_EGRESS_FRER_SRFUNC */
/*
 * FEN (R/W)
 *
 * Sequence recovery function: FEN – enable function for stream SIDSEL.SID. FIDX – function index for stream SIDSEL.SID If function does not exists (FIDX >= 2**FD), FEN will be set to 0.
 */
#define TSW_CPU_PORT_EGRESS_FRER_SRFUNC_FEN_MASK (0x80000000UL)
#define TSW_CPU_PORT_EGRESS_FRER_SRFUNC_FEN_SHIFT (31U)
#define TSW_CPU_PORT_EGRESS_FRER_SRFUNC_FEN_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_EGRESS_FRER_SRFUNC_FEN_SHIFT) & TSW_CPU_PORT_EGRESS_FRER_SRFUNC_FEN_MASK)
#define TSW_CPU_PORT_EGRESS_FRER_SRFUNC_FEN_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_EGRESS_FRER_SRFUNC_FEN_MASK) >> TSW_CPU_PORT_EGRESS_FRER_SRFUNC_FEN_SHIFT)

