RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * SEQGEN (RW)
 *
 * Sequence number generation enable
 */
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_SEQGEN_MASK (0x80U)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_SEQGEN_SHIFT (7U)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_SEQGEN_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_IGRESS_STMID_CONTROL_SEQGEN_SHIFT) & TSW_CPU_PORT_IGRESS_STMID_CONTROL_SEQGEN_MASK)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_SEQGEN_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_IGRESS_STMID_CONTROL_SEQGEN_MASK) >> TSW_CPU_PORT_IGRESS_STMID_CONTROL_SEQGEN_SHIFT)

/*
 * ACTCTL (RW)
 *
 * Active Destination MAC – control. See Table 6-6.
 */
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_ACTCTL_MASK (0x30U)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_ACTCTL_SHIFT (4U)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_ACTCTL_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_IGRESS_STMID_CONTROL_ACTCTL_SHIFT) & TSW_CPU_PORT_IGRESS_STMID_CONTROL_ACTCTL_MASK)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_ACTCTL_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_IGRESS_STMID_CONTROL_ACTCTL_MASK) >> TSW_CPU_PORT_IGRESS_STMID_CONTROL_ACTCTL_SHIFT)

/*
 * SMAC (RW)
 *
 * 0: Lookup by Destination MAC 1: Lookup by Source MAC
 */
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_SMAC_MASK (0x8U)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_SMAC_SHIFT (3U)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_SMAC_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_IGRESS_STMID_CONTROL_SMAC_SHIFT) & TSW_CPU_PORT_IGRESS_STMID_CONTROL_SMAC_MASK)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_SMAC_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_IGRESS_STMID_CONTROL_SMAC_MASK) >> TSW_CPU_PORT_IGRESS_STMID_CONTROL_SMAC_SHIFT)

/*
 * MODE (RW)
 *
 * Lookup mode. 1:Priority – a frame must be untagged or priority tagged ; 2:Tagged – a frame must have a VLAN tag ; 3:All – a frame can be tagged or untagged
 */
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_MODE_MASK (0x6U)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_MODE_SHIFT (1U)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_MODE_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_IGRESS_STMID_CONTROL_MODE_SHIFT) & TSW_CPU_PORT_IGRESS_STMID_CONTROL_MODE_MASK)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_MODE_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_IGRESS_STMID_CONTROL_MODE_MASK) >> TSW_CPU_PORT_IGRESS_STMID_CONTROL_MODE_SHIFT)

/*
 * EN (RW)
 *
 * Enable entry
 */
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_EN_MASK (0x1U)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_EN_SHIFT (0U)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_EN_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_IGRESS_STMID_CONTROL_EN_SHIFT) & TSW_CPU_PORT_IGRESS_STMID_CONTROL_EN_MASK)
#define TSW_CPU_PORT_IGRESS_STMID_CONTROL_EN_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_IGRESS_STMID_CONTROL_EN_MASK) >> TSW_CPU_PORT_IGRESS_STMID_CONTROL_EN_SHIFT)

/* Bitfield definition for register: CPU_PORT_IGRESS_STMID_SEQNO */
/*
 * SEQNO (RWC)
 *
 * Sequence number – next number when generating,any write access to clear.
 */
#define TSW_CPU_PORT_IGRESS_STMID_SEQNO_SEQNO_MASK (0xFFFFU)
#define TSW_CPU_PORT_IGRESS_STMID_SEQNO_SEQNO_SHIFT (0U)
#define TSW_CPU_PORT_IGRESS_STMID_SEQNO_SEQNO_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_IGRESS_STMID_SEQNO_SEQNO_SHIFT) & TSW_CPU_PORT_IGRESS_STMID_SEQNO_SEQNO_MASK)
#define TSW_CPU_PORT_IGRESS_STMID_SEQNO_SEQNO_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_IGRESS_STMID_SEQNO_SEQNO_MASK) >> TSW_CPU_PORT_IGRESS_STMID_SEQNO_SEQNO_SHIFT)

/* Bitfield definition for register: CPU_PORT_IGRESS_STMID_MATCHCNT */
/*
 * MATCH (RWC)
 *
 * Entry match counter – any write access to clear.
 */
#define TSW_CPU_PORT_IGRESS_STMID_MATCHCNT_MATCH_MASK (0xFFFFFFFFUL)
#define TSW_CPU_PORT_IGRESS_STMID_MATCHCNT_MATCH_SHIFT (0U)
#define TSW_CPU_PORT_IGRESS_STMID_MATCHCNT_MATCH_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_IGRESS_STMID_MATCHCNT_MATCH_SHIFT) & TSW_CPU_PORT_IGRESS_STMID_MATCHCNT_MATCH_MASK)
#define TSW_CPU_PORT_IGRESS_STMID_MATCHCNT_MATCH_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_IGRESS_STMID_MATCHCNT_MATCH_MASK) >> TSW_CPU_PORT_IGRESS_STMID_MATCHCNT_MATCH_SHIFT)

/* Bitfield definition for register: CPU_PORT_IGRESS_STMID_MACLO */
/*
 * MACL (RWC)
 *
 * MAC-Address [31:0] used by lookup.
 */
#define TSW_CPU_PORT_IGRESS_STMID_MACLO_MACL_MASK (0xFFFFFFFFUL)
#define TSW_CPU_PORT_IGRESS_STMID_MACLO_MACL_SHIFT (0U)
#define TSW_CPU_PORT_IGRESS_STMID_MACLO_MACL_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_IGRESS_STMID_MACLO_MACL_SHIFT) & TSW_CPU_PORT_IGRESS_STMID_MACLO_MACL_MASK)
#define TSW_CPU_PORT_IGRESS_STMID_MACLO_MACL_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_IGRESS_STMID_MACLO_MACL_MASK) >> TSW_CPU_PORT_IGRESS_STMID_MACLO_MACL_SHIFT)

/* Bitfield definition for register: CPU_PORT_IGRESS_STMID_MACHI */
/*
 * VID (RW)
 *
 * VLAN ID used by lookup.
 */
#define TSW_CPU_PORT_IGRESS_STMID_MACHI_VID_MASK (0xFFF0000UL)
#define TSW_CPU_PORT_IGRESS_STMID_MACHI_VID_SHIFT (16U)
#define TSW_CPU_PORT_IGRESS_STMID_MACHI_VID_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_IGRESS_STMID_MACHI_VID_SHIFT) & TSW_CPU_PORT_IGRESS_STMID_MACHI_VID_MASK)
#define TSW_CPU_PORT_IGRESS_STMID_MACHI_VID_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_IGRESS_STMID_MACHI_VID_MASK) >> TSW_CPU_PORT_IGRESS_STMID_MACHI_VID_SHIFT)

/*
 * MATCH (RW)
 *
 * MAC-Address [47:31] used by lookup.
 */
#define TSW_CPU_PORT_IGRESS_STMID_MACHI_MATCH_MASK (0xFFFFU)
#define TSW_CPU_PORT_IGRESS_STMID_MACHI_MATCH_SHIFT (0U)
#define TSW_CPU_PORT_IGRESS_STMID_MACHI_MATCH_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_IGRESS_STMID_MACHI_MATCH_SHIFT) & TSW_CPU_PORT_IGRESS_STMID_MACHI_MATCH_MASK)
#define TSW_CPU_PORT_IGRESS_STMID_MACHI_MATCH_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_IGRESS_STMID_MACHI_MATCH_MASK) >> TSW_CPU_PORT_IGRESS_STMID_MACHI_MATCH_SHIFT)

/* Bitfield definition for register: CPU_PORT_IGRESS_STMID_AMACHI */
/*
 * APCP (RW)
 *
 * Active Destination MAC, PCP
 */
#define TSW_CPU_PORT_IGRESS_STMID_AMACHI_APCP_MASK (0xF0000000UL)
#define TSW_CPU_PORT_IGRESS_STMID_AMACHI_APCP_SHIFT (28U)
#define TSW_CPU_PORT_IGRESS_STMID_AMACHI_APCP_SET(x) (((uint32_t)(x) << TSW_CPU_PORT_IGRESS_STMID_AMACHI_APCP_SHIFT) & TSW_CPU_PORT_IGRESS_STMID_AMACHI_APCP_MASK)
#define TSW_CPU_PORT_IGRESS_STMID_AMACHI_APCP_GET(x) (((uint32_t)(x) & TSW_CPU_PORT_IGRESS_STMID_AMACHI_APCP_MASK) >> TSW_CPU_PORT_IGRESS_STMID_AMACHI_APCP_SHIFT)

