RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * RCA (R)
 *
 * <ref_clk> active
 * 0 – not active
 * 1 – active
 * See chapter 11.2.3 for details.
 */
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RCA_MASK (0x100000UL)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RCA_SHIFT (20U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RCA_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_RCA_MASK) >> TSW_TSNPORT_MAC_MAC_MAC_CTRL_RCA_SHIFT)

/*
 * MCA (R)
 *
 * <mii_clk> active
 * 0 – not active
 * 1 – active
 * See chapter 11.2.3 for details.
 */
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_MCA_MASK (0x80000UL)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_MCA_SHIFT (19U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_MCA_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_MCA_MASK) >> TSW_TSNPORT_MAC_MAC_MAC_CTRL_MCA_SHIFT)

/*
 * SEN (R/W)
 *
 * Safety Enable
 * 0 – disabled
 * 1 – enabled
 * If enabled, then two instances of the logic core of LLEMAC-1G are compared at
 * runtime to each other.
 * SEN can only be changed if RX_EN and TX_EN can be read as 0. Deactivation delays
 * of RX_EN and TX_EN have to be considered. It is possible to change SEN together
 * with the activation of RX_EN and TX_EN.
 */
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_SEN_MASK (0x10000UL)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_SEN_SHIFT (16U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_SEN_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MAC_CTRL_SEN_SHIFT) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_SEN_MASK)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_SEN_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_SEN_MASK) >> TSW_TSNPORT_MAC_MAC_MAC_CTRL_SEN_SHIFT)

/*
 * CSA (R)
 *
 * Clock switching active (<tx_clk>)
 * 0 – not active
 * 1 – active
 * Switching of <tx_clk> is commanded if CLKSEL or FSTIM (see Table 11-1) are
 * written. Clock switching takes a few clock cycles and this is signaled with CSA=1.
 * When CSA=1 then CLKSEL and FSTIM are write-locked and cannot be changed.
 */
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_CSA_MASK (0x2000U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_CSA_SHIFT (13U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_CSA_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_CSA_MASK) >> TSW_TSNPORT_MAC_MAC_MAC_CTRL_CSA_SHIFT)

/*
 * RCE (R/W)
 *
 * <ref_clk> enable
 * 0 – disabled
 * 1 – enabled
 * RCE can only be modified if CLKSEL=111. See Chapter 7.3.3 for further details.
 */
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RCE_MASK (0x1000U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RCE_SHIFT (12U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RCE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MAC_CTRL_RCE_SHIFT) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_RCE_MASK)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RCE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_RCE_MASK) >> TSW_TSNPORT_MAC_MAC_MAC_CTRL_RCE_SHIFT)

/*
 * MCE (R/W)
 *
 * <mii_clk> enable
 * 0 – disabled
 * 1 – enabled
 * MCE can only be modified if CLKSEL=111. See Chapter 7.3.3 for further details.
 */
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_MCE_MASK (0x800U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_MCE_SHIFT (11U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_MCE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MAC_CTRL_MCE_SHIFT) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_MCE_MASK)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_MCE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_MCE_MASK) >> TSW_TSNPORT_MAC_MAC_MAC_CTRL_MCE_SHIFT)

/*
 * CLKSEL (R/W)
 *
 * TX path clock selector
 * 000 – <mii_clk>
 * 001 – <ref_clk> (recommended setting for this selection)
 * 010 – <ref_clk> divided by 5
 * 011 – <ref_clk> divided by 10
 * 100 – <ref_clk> divided by 50
 * 111 – <ref_clk> and enables modification of RCE and MCE
 * others – <ref_clk>
 * See Chapter 7 for further details.
 * CLKSEL is write-locked if CSA=1.
 */
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_CLKSEL_MASK (0x700U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_CLKSEL_SHIFT (8U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_CLKSEL_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MAC_CTRL_CLKSEL_SHIFT) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_CLKSEL_MASK)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_CLKSEL_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_CLKSEL_MASK) >> TSW_TSNPORT_MAC_MAC_MAC_CTRL_CLKSEL_SHIFT)

/*
 * PHYSEL (R/W)
 *
 * Selection of the PHY (See Chapter 4.6.)
 * 00 – MII
 * 01 – GMII
 * 10 – RGMII
 * 11 – reserved
 * PHYSEL can only be changed if RX_EN=0 and TX_EN=0. Deactivation delays of
 * RX_EN and TX_EN have to be considered. PHYSEL can only be changed, if these
 * register bits can be read as 0. It is possible to change PHYSEL together with the
 * activation of RX_EN and TX_EN.
 * PHYSEL drives the output <rx_physel>.
 */
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_PHYSEL_MASK (0x60U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_PHYSEL_SHIFT (5U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_PHYSEL_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MAC_CTRL_PHYSEL_SHIFT) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_PHYSEL_MASK)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_PHYSEL_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_PHYSEL_MASK) >> TSW_TSNPORT_MAC_MAC_MAC_CTRL_PHYSEL_SHIFT)

/*
 * GMIIMODE (R/W)
 *
 * GMII mode / Ethernet speed selection (See Chapter 4.5.)
 * 0 – MII: 10Mbit/s or 100Mbit/s
 * 1 – GMII: 1GBit/s
 * GMIIMODE can only be changed if RX_EN=0 and TX_EN=0. Deactivation delays of
 * RX_EN and TX_EN have to be considered. GMIIMODE can only be changed, if these
 * register bits can be read as 0. It is possible to change GMIIMODE together with the
 * activation of RX_EN and TX_EN.
 * GMIIMODE drives the outputs <tx_gmiimode> and <rx_gmiimode>.
 */
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_GMIIMODE_MASK (0x10U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_GMIIMODE_SHIFT (4U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_GMIIMODE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MAC_CTRL_GMIIMODE_SHIFT) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_GMIIMODE_MASK)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_GMIIMODE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_GMIIMODE_MASK) >> TSW_TSNPORT_MAC_MAC_MAC_CTRL_GMIIMODE_SHIFT)

/*
 * JUMBO (R/W)
 *
 * Jumbo frame support
 * 0 – jumbo frames not supported
 * 1 – jumbo frame supported (not recommended)
 * Jumbo frames are non-standard Ethernet frames with a size bigger than envelope
 * frames (which contain 1982 payload bytes). If jumbo frames are not supported, then
 * LLEMAC-1G generates the appropriate error signals (<tx_gmii_er> for the TX path
 * and <rx_avst_err> for the RX path).
 * Although jumbo frames typically contain up to 9000 bytes, the LLEMAC-1G can handle
 * an infinite frame size. The problem of jumbo frames is the necessary storage space in
 * transmission and reception buffers. LLEMAC-1G does not include storage buffers.
 * JUMBO can be activated or deactivated at any time. The new setting becomes valid
 * immediately after clock domain crossing.
 */
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_JUMBO_MASK (0x8U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_JUMBO_SHIFT (3U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_JUMBO_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MAC_CTRL_JUMBO_SHIFT) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_JUMBO_MASK)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_JUMBO_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_JUMBO_MASK) >> TSW_TSNPORT_MAC_MAC_MAC_CTRL_JUMBO_SHIFT)

