RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * TX_EN (R/W)
 *
 * TX path enable
 * 0 – transmission disabled - Avalon-ST READY for the TX path will be set to 0.
 * 1 – transmission enabled
 * TX_EN can be activated or deactivated at any time. Deactivation may take some time.
 * If during deactivation there is a frame in transmission, then this frame will be
 * completed fist. Afterwards bit TX_EN can be read as 0.
 * After the transmission is disabled there may be pending frames left, waiting at the TX
 * stream interface.
 */
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_TX_EN_MASK (0x4U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_TX_EN_SHIFT (2U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_TX_EN_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MAC_CTRL_TX_EN_SHIFT) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_TX_EN_MASK)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_TX_EN_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_TX_EN_MASK) >> TSW_TSNPORT_MAC_MAC_MAC_CTRL_TX_EN_SHIFT)

/*
 * RX_EN (R/W)
 *
 * RX path enable
 * 0 – reception disabled – no frames fed to Avalon-ST RX path
 * 1 – reception enabled
 * RX_EN can be activated or deactivated at any time. Deactivation may take some time.
 * If during deactivation there is a frame in reception, then this frame will be completed
 * first. Afterwards bit RX_EN can be read as 0.
 */
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RX_EN_MASK (0x2U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RX_EN_SHIFT (1U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RX_EN_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MAC_CTRL_RX_EN_SHIFT) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_RX_EN_MASK)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RX_EN_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_RX_EN_MASK) >> TSW_TSNPORT_MAC_MAC_MAC_CTRL_RX_EN_SHIFT)

/*
 * RESSTAT (R/W)
 *
 * Software reset of the statistic counters (see Table 3-8)
 * 0 – no reset
 * 1 – reset active
 * RESSTAT will be automatically set to 0 after the counters have been reset
 */
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RESSTAT_MASK (0x1U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RESSTAT_SHIFT (0U)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RESSTAT_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MAC_CTRL_RESSTAT_SHIFT) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_RESSTAT_MASK)
#define TSW_TSNPORT_MAC_MAC_MAC_CTRL_RESSTAT_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MAC_CTRL_RESSTAT_MASK) >> TSW_TSNPORT_MAC_MAC_MAC_CTRL_RESSTAT_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: MAC_TX_FRAMES */
/*
 * TX_FRAMES (R)
 *
 * Number of successfully transmitted frames.
 */
#define TSW_TSNPORT_MAC_MAC_TX_FRAMES_TX_FRAMES_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_MAC_MAC_TX_FRAMES_TX_FRAMES_SHIFT (0U)
#define TSW_TSNPORT_MAC_MAC_TX_FRAMES_TX_FRAMES_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_TX_FRAMES_TX_FRAMES_MASK) >> TSW_TSNPORT_MAC_MAC_TX_FRAMES_TX_FRAMES_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: MAC_RX_FRAMES */
/*
 * RX_FRAMES (R)
 *
 * Number of successfully received frames.
 */
#define TSW_TSNPORT_MAC_MAC_RX_FRAMES_RX_FRAMES_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_MAC_MAC_RX_FRAMES_RX_FRAMES_SHIFT (0U)
#define TSW_TSNPORT_MAC_MAC_RX_FRAMES_RX_FRAMES_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_RX_FRAMES_RX_FRAMES_MASK) >> TSW_TSNPORT_MAC_MAC_RX_FRAMES_RX_FRAMES_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: MAC_TX_OCTETS */
/*
 * TX_OCTETS (R)
 *
 * Number of successfully transmitted payload and padding octets.
 */
#define TSW_TSNPORT_MAC_MAC_TX_OCTETS_TX_OCTETS_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_MAC_MAC_TX_OCTETS_TX_OCTETS_SHIFT (0U)
#define TSW_TSNPORT_MAC_MAC_TX_OCTETS_TX_OCTETS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_TX_OCTETS_TX_OCTETS_MASK) >> TSW_TSNPORT_MAC_MAC_TX_OCTETS_TX_OCTETS_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: MAC_RX_OCTETS */
/*
 * RX_OCTETS (R)
 *
 * Number of successfully received payload and padding octets.
 */
#define TSW_TSNPORT_MAC_MAC_RX_OCTETS_RX_OCTETS_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_MAC_MAC_RX_OCTETS_RX_OCTETS_SHIFT (0U)
#define TSW_TSNPORT_MAC_MAC_RX_OCTETS_RX_OCTETS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_RX_OCTETS_RX_OCTETS_MASK) >> TSW_TSNPORT_MAC_MAC_RX_OCTETS_RX_OCTETS_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: MAC_MDIO_CFG */
/*
 * NPRE (R/W)
 *
 * No Preamble
 * With NPRE=1 the preamble generation is suppressed and frames are initiated with
 * Start of Frame pattern directly. Suitable in case that all connected PHYs accept
 * management frames without a preamble pattern. Recommended to be used if only
 * one PHY is connected.
 */
#define TSW_TSNPORT_MAC_MAC_MDIO_CFG_NPRE_MASK (0x8000U)
#define TSW_TSNPORT_MAC_MAC_MDIO_CFG_NPRE_SHIFT (15U)
#define TSW_TSNPORT_MAC_MAC_MDIO_CFG_NPRE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MDIO_CFG_NPRE_SHIFT) & TSW_TSNPORT_MAC_MAC_MDIO_CFG_NPRE_MASK)
#define TSW_TSNPORT_MAC_MAC_MDIO_CFG_NPRE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MDIO_CFG_NPRE_MASK) >> TSW_TSNPORT_MAC_MAC_MDIO_CFG_NPRE_SHIFT)

/*
 * ENABLE (R/W)
 *
 * Enable the MDIO controller. If the controller is enabled then MDC will be toggled.
 * ENABLE can only be read as 1 if a valid MDC_CLKDIV value is set.
 */
#define TSW_TSNPORT_MAC_MAC_MDIO_CFG_ENABLE_MASK (0x100U)
#define TSW_TSNPORT_MAC_MAC_MDIO_CFG_ENABLE_SHIFT (8U)
#define TSW_TSNPORT_MAC_MAC_MDIO_CFG_ENABLE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MDIO_CFG_ENABLE_SHIFT) & TSW_TSNPORT_MAC_MAC_MDIO_CFG_ENABLE_MASK)
#define TSW_TSNPORT_MAC_MAC_MDIO_CFG_ENABLE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MDIO_CFG_ENABLE_MASK) >> TSW_TSNPORT_MAC_MAC_MDIO_CFG_ENABLE_SHIFT)

/*
 * MDC_CLKDIV (R/W)
 *
 * Clock Divider to configure MDC clock frequency. Refer to 10.1 Clock Divider for more
 * details.
 */
#define TSW_TSNPORT_MAC_MAC_MDIO_CFG_MDC_CLKDIV_MASK (0xFFU)
#define TSW_TSNPORT_MAC_MAC_MDIO_CFG_MDC_CLKDIV_SHIFT (0U)
#define TSW_TSNPORT_MAC_MAC_MDIO_CFG_MDC_CLKDIV_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MDIO_CFG_MDC_CLKDIV_SHIFT) & TSW_TSNPORT_MAC_MAC_MDIO_CFG_MDC_CLKDIV_MASK)
#define TSW_TSNPORT_MAC_MAC_MDIO_CFG_MDC_CLKDIV_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MDIO_CFG_MDC_CLKDIV_MASK) >> TSW_TSNPORT_MAC_MAC_MDIO_CFG_MDC_CLKDIV_SHIFT)

