RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/* Bitfield definition for register of struct array TSNPORT: MAC_MDIO_CTRL */
/*
 * OP (R/W)
 *
 * Opcode to determine transfer type
 * 01 – Write Access
 * 10 – Read Access
 */
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_OP_MASK (0xC0000000UL)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_OP_SHIFT (30U)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_OP_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MDIO_CTRL_OP_SHIFT) & TSW_TSNPORT_MAC_MAC_MDIO_CTRL_OP_MASK)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_OP_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MDIO_CTRL_OP_MASK) >> TSW_TSNPORT_MAC_MAC_MDIO_CTRL_OP_SHIFT)

/*
 * PHYAD (R/W)
 *
 * Management Frame PHY Address.
 */
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_PHYAD_MASK (0x1F000000UL)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_PHYAD_SHIFT (24U)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_PHYAD_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MDIO_CTRL_PHYAD_SHIFT) & TSW_TSNPORT_MAC_MAC_MDIO_CTRL_PHYAD_MASK)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_PHYAD_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MDIO_CTRL_PHYAD_MASK) >> TSW_TSNPORT_MAC_MAC_MDIO_CTRL_PHYAD_SHIFT)

/*
 * REGAD (R/W)
 *
 * Management Frame Register Address.
 */
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_REGAD_MASK (0x1F0000UL)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_REGAD_SHIFT (16U)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_REGAD_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MDIO_CTRL_REGAD_SHIFT) & TSW_TSNPORT_MAC_MAC_MDIO_CTRL_REGAD_MASK)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_REGAD_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MDIO_CTRL_REGAD_MASK) >> TSW_TSNPORT_MAC_MAC_MDIO_CTRL_REGAD_SHIFT)

/*
 * INIT (R/W)
 *
 * INIT=1 results in a MDIO write/read transfer if READY=1. If READY=0 while a
 * transfer is already pending or if ENABLE=0 then settings INIT=1 has no effect and
 * the current transaction is withdrawn.
 */
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_INIT_MASK (0x100U)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_INIT_SHIFT (8U)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_INIT_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MDIO_CTRL_INIT_SHIFT) & TSW_TSNPORT_MAC_MAC_MDIO_CTRL_INIT_MASK)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_INIT_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MDIO_CTRL_INIT_MASK) >> TSW_TSNPORT_MAC_MAC_MDIO_CTRL_INIT_SHIFT)

/*
 * READY (R)
 *
 * READY=1 indicates a finished transfer and also shows that the controller is ready for a
 * new transfer. READY=1 is only possible if ENABLE=1.
 * If READY=1 is signaled after a read transfer, then RD_DATA is valid until a new
 * transfer is started.
 */
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_READY_MASK (0x1U)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_READY_SHIFT (0U)
#define TSW_TSNPORT_MAC_MAC_MDIO_CTRL_READY_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MDIO_CTRL_READY_MASK) >> TSW_TSNPORT_MAC_MAC_MDIO_CTRL_READY_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: MAC_MDIO_RD_DATA */
/*
 * RD_DATA (R)
 *
 * Read Data is available if READY=1 after a transfer has been started. RD_DATA represents the content of the management data field of the read transfer.
 */
#define TSW_TSNPORT_MAC_MAC_MDIO_RD_DATA_RD_DATA_MASK (0xFFFFU)
#define TSW_TSNPORT_MAC_MAC_MDIO_RD_DATA_RD_DATA_SHIFT (0U)
#define TSW_TSNPORT_MAC_MAC_MDIO_RD_DATA_RD_DATA_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MDIO_RD_DATA_RD_DATA_MASK) >> TSW_TSNPORT_MAC_MAC_MDIO_RD_DATA_RD_DATA_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: MAC_MDIO_WR_DATA */
/*
 * WR_DATA (R/W)
 *
 * Data is used for the management data field after a write transfer has been started
 */
#define TSW_TSNPORT_MAC_MAC_MDIO_WR_DATA_WR_DATA_MASK (0xFFFFU)
#define TSW_TSNPORT_MAC_MAC_MDIO_WR_DATA_WR_DATA_SHIFT (0U)
#define TSW_TSNPORT_MAC_MAC_MDIO_WR_DATA_WR_DATA_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_MDIO_WR_DATA_WR_DATA_SHIFT) & TSW_TSNPORT_MAC_MAC_MDIO_WR_DATA_WR_DATA_MASK)
#define TSW_TSNPORT_MAC_MAC_MDIO_WR_DATA_WR_DATA_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_MDIO_WR_DATA_WR_DATA_MASK) >> TSW_TSNPORT_MAC_MAC_MDIO_WR_DATA_WR_DATA_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: MAC_IRQ_CTRL */
/*
 * CAIF (R/W)
 *
 * Clock activity interrupt flag
 * 0 – no interrupt
 * 1 – interrupt pending
 * See Chapter 11.2.3 for details.
 */
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIF_MASK (0x800U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIF_SHIFT (11U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIF_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIF_SHIFT) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIF_MASK)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIF_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIF_MASK) >> TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIF_SHIFT)

/*
 * SWIF (R/W)
 *
 * Safety warning interrupt flag
 * 0 – no interrupt
 * 1 – interrupt pending
 * See Chapter 11.2.2 for details
 */
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIF_MASK (0x400U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIF_SHIFT (10U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIF_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIF_SHIFT) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIF_MASK)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIF_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIF_MASK) >> TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIF_SHIFT)

/*
 * SEIF (R/W)
 *
 * Safety Error Interrupt Flag
 * 0 – no interrupt
 * 1 – interrupt pending
 * If SEN=1 and if there is a mismatch between both instances of the logic core of
 * LLEMAC-1G then this results in SEIF=1, TX_EN=0 and RX_EN=0.
 */
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SEIF_MASK (0x200U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SEIF_SHIFT (9U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SEIF_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SEIF_SHIFT) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SEIF_MASK)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SEIF_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SEIF_MASK) >> TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SEIF_SHIFT)

/*
 * MDIF (R/W)
 *
 * MDIO Interrupt Flag
 * 1 – A transfer has been finished
 * 0 – No transfer done
 */
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIF_MASK (0x100U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIF_SHIFT (8U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIF_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIF_SHIFT) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIF_MASK)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIF_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIF_MASK) >> TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIF_SHIFT)

