RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * CAIE (R/W)
 *
 * Clock activity interrupt enable
 * 0 – CAIF disabled
 * 1 – CAIF enabled
 */
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIE_MASK (0x8U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIE_SHIFT (3U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIE_SHIFT) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIE_MASK)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIE_MASK) >> TSW_TSNPORT_MAC_MAC_IRQ_CTRL_CAIE_SHIFT)

/*
 * SWIE (R/W)
 *
 * Safety warning interrupt enable
 * 0 – SWIF disabled
 * 1 – SWIF enabled
 */
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIE_MASK (0x4U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIE_SHIFT (2U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIE_SHIFT) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIE_MASK)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIE_MASK) >> TSW_TSNPORT_MAC_MAC_IRQ_CTRL_SWIE_SHIFT)

/*
 * MDIE (R/W)
 *
 * MDIO Interrupt Enable
 * 0 – Disabled
 * 1 – Enabled
 */
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIE_MASK (0x1U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIE_SHIFT (0U)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIE_SHIFT) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIE_MASK)
#define TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIE_MASK) >> TSW_TSNPORT_MAC_MAC_IRQ_CTRL_MDIE_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: RTC_CR */
/*
 * TAIE (R/W)
 *
 * Timer A interrupt enable: interrupt enabled when 1
 */
#define TSW_TSNPORT_RTC_CR_TAIE_MASK (0x8U)
#define TSW_TSNPORT_RTC_CR_TAIE_SHIFT (3U)
#define TSW_TSNPORT_RTC_CR_TAIE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_CR_TAIE_SHIFT) & TSW_TSNPORT_RTC_CR_TAIE_MASK)
#define TSW_TSNPORT_RTC_CR_TAIE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_CR_TAIE_MASK) >> TSW_TSNPORT_RTC_CR_TAIE_SHIFT)

/*
 * TAEN (R/W)
 *
 * Timer A enable: timer enabled when 1
 */
#define TSW_TSNPORT_RTC_CR_TAEN_MASK (0x4U)
#define TSW_TSNPORT_RTC_CR_TAEN_SHIFT (2U)
#define TSW_TSNPORT_RTC_CR_TAEN_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_CR_TAEN_SHIFT) & TSW_TSNPORT_RTC_CR_TAEN_MASK)
#define TSW_TSNPORT_RTC_CR_TAEN_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_CR_TAEN_MASK) >> TSW_TSNPORT_RTC_CR_TAEN_SHIFT)

/*
 * ALIE (R/W)
 *
 * Alarm interrupt enable: alarm interrupt enabled when 1
 */
#define TSW_TSNPORT_RTC_CR_ALIE_MASK (0x2U)
#define TSW_TSNPORT_RTC_CR_ALIE_SHIFT (1U)
#define TSW_TSNPORT_RTC_CR_ALIE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_CR_ALIE_SHIFT) & TSW_TSNPORT_RTC_CR_ALIE_MASK)
#define TSW_TSNPORT_RTC_CR_ALIE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_CR_ALIE_MASK) >> TSW_TSNPORT_RTC_CR_ALIE_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: RTC_SR */
/*
 * TAIS (R/WC)
 *
 * Timer A Interrupt Status: set at rising edge of “timer_clk_a”, write 1 to clear
 */
#define TSW_TSNPORT_RTC_SR_TAIS_MASK (0x8U)
#define TSW_TSNPORT_RTC_SR_TAIS_SHIFT (3U)
#define TSW_TSNPORT_RTC_SR_TAIS_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_SR_TAIS_SHIFT) & TSW_TSNPORT_RTC_SR_TAIS_MASK)
#define TSW_TSNPORT_RTC_SR_TAIS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_SR_TAIS_MASK) >> TSW_TSNPORT_RTC_SR_TAIS_SHIFT)

/*
 * ALIS (RO)
 *
 * ALIS ro Alarm Interrupt Status: Always set while RTC-Time >= Alarm-Time
 */
#define TSW_TSNPORT_RTC_SR_ALIS_MASK (0x2U)
#define TSW_TSNPORT_RTC_SR_ALIS_SHIFT (1U)
#define TSW_TSNPORT_RTC_SR_ALIS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_SR_ALIS_MASK) >> TSW_TSNPORT_RTC_SR_ALIS_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: RTC_CT_CURTIME_NS */
/*
 * CT_NS (RO/WU)
 *
 * Local Time (nanosecond part): Update can be triggered by write access to this register. Value range from 0 – 999999999.
 */
#define TSW_TSNPORT_RTC_CT_CURTIME_NS_CT_NS_MASK (0x3FFFFFFFUL)
#define TSW_TSNPORT_RTC_CT_CURTIME_NS_CT_NS_SHIFT (0U)
#define TSW_TSNPORT_RTC_CT_CURTIME_NS_CT_NS_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_CT_CURTIME_NS_CT_NS_SHIFT) & TSW_TSNPORT_RTC_CT_CURTIME_NS_CT_NS_MASK)
#define TSW_TSNPORT_RTC_CT_CURTIME_NS_CT_NS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_CT_CURTIME_NS_CT_NS_MASK) >> TSW_TSNPORT_RTC_CT_CURTIME_NS_CT_NS_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: RTC_CT_CURTIME_SEC */
/*
 * CT_SEC (RO)
 *
 * Current Time (second part): Update can be triggered by write access to register CURTIME_NS.
 */
#define TSW_TSNPORT_RTC_CT_CURTIME_SEC_CT_SEC_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_RTC_CT_CURTIME_SEC_CT_SEC_SHIFT (0U)
#define TSW_TSNPORT_RTC_CT_CURTIME_SEC_CT_SEC_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_CT_CURTIME_SEC_CT_SEC_MASK) >> TSW_TSNPORT_RTC_CT_CURTIME_SEC_CT_SEC_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: RTC_CT_TIMER_INCR */
/*
 * NS (RW)
 *
 * Local time increment – nanoseconds (integer)
 */
#define TSW_TSNPORT_RTC_CT_TIMER_INCR_NS_MASK (0xFF000000UL)
#define TSW_TSNPORT_RTC_CT_TIMER_INCR_NS_SHIFT (24U)
#define TSW_TSNPORT_RTC_CT_TIMER_INCR_NS_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_CT_TIMER_INCR_NS_SHIFT) & TSW_TSNPORT_RTC_CT_TIMER_INCR_NS_MASK)
#define TSW_TSNPORT_RTC_CT_TIMER_INCR_NS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_CT_TIMER_INCR_NS_MASK) >> TSW_TSNPORT_RTC_CT_TIMER_INCR_NS_SHIFT)

/*
 * FNS (RW)
 *
 * Local time increment – fractional ns, unsigned, in (1 / 2^24) n
 */
#define TSW_TSNPORT_RTC_CT_TIMER_INCR_FNS_MASK (0xFFFFFFUL)
#define TSW_TSNPORT_RTC_CT_TIMER_INCR_FNS_SHIFT (0U)
#define TSW_TSNPORT_RTC_CT_TIMER_INCR_FNS_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_CT_TIMER_INCR_FNS_SHIFT) & TSW_TSNPORT_RTC_CT_TIMER_INCR_FNS_MASK)
#define TSW_TSNPORT_RTC_CT_TIMER_INCR_FNS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_CT_TIMER_INCR_FNS_MASK) >> TSW_TSNPORT_RTC_CT_TIMER_INCR_FNS_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: RTC_OFS_NS */
/*
 * OFS_NS (R/W)
 *
 * Real Time Offset (nanoseconds part). Valid value range from 0 – 999999999.
 */
#define TSW_TSNPORT_RTC_OFS_NS_OFS_NS_MASK (0x3FFFFFFFUL)
#define TSW_TSNPORT_RTC_OFS_NS_OFS_NS_SHIFT (0U)
#define TSW_TSNPORT_RTC_OFS_NS_OFS_NS_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_OFS_NS_OFS_NS_SHIFT) & TSW_TSNPORT_RTC_OFS_NS_OFS_NS_MASK)
#define TSW_TSNPORT_RTC_OFS_NS_OFS_NS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_OFS_NS_OFS_NS_MASK) >> TSW_TSNPORT_RTC_OFS_NS_OFS_NS_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: RTC_OFS_SL */
/*
 * OFS_SL (R/W)
 *
 * 48 Bit Real Time Offset (seconds lo part)
 */
#define TSW_TSNPORT_RTC_OFS_SL_OFS_SL_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_RTC_OFS_SL_OFS_SL_SHIFT (0U)
#define TSW_TSNPORT_RTC_OFS_SL_OFS_SL_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_OFS_SL_OFS_SL_SHIFT) & TSW_TSNPORT_RTC_OFS_SL_OFS_SL_MASK)
#define TSW_TSNPORT_RTC_OFS_SL_OFS_SL_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_OFS_SL_OFS_SL_MASK) >> TSW_TSNPORT_RTC_OFS_SL_OFS_SL_SHIFT)

