RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/* Bitfield definition for register of struct array TSNPORT: RTC_OFS_SH */
/*
 * OFS_SH (R/W)
 *
 * 48 Bit Real Time Offset (seconds hi part)
 */
#define TSW_TSNPORT_RTC_OFS_SH_OFS_SH_MASK (0xFFFFU)
#define TSW_TSNPORT_RTC_OFS_SH_OFS_SH_SHIFT (0U)
#define TSW_TSNPORT_RTC_OFS_SH_OFS_SH_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_OFS_SH_OFS_SH_SHIFT) & TSW_TSNPORT_RTC_OFS_SH_OFS_SH_MASK)
#define TSW_TSNPORT_RTC_OFS_SH_OFS_SH_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_OFS_SH_OFS_SH_MASK) >> TSW_TSNPORT_RTC_OFS_SH_OFS_SH_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: RTC_OFS_CH */
/*
 * SEXT (RO)
 *
 * Real Time Offset Change – sign extension of SFNS (Bit 23)
 */
#define TSW_TSNPORT_RTC_OFS_CH_SEXT_MASK (0xFF000000UL)
#define TSW_TSNPORT_RTC_OFS_CH_SEXT_SHIFT (24U)
#define TSW_TSNPORT_RTC_OFS_CH_SEXT_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_OFS_CH_SEXT_MASK) >> TSW_TSNPORT_RTC_OFS_CH_SEXT_SHIFT)

/*
 * SFNS (R/W)
 *
 * Real Time Offset Change in fractional nanoseconds, signed value; value range from -2^23 / 2^24 to (2^23-1) / 2^24 nanoseconds.
 */
#define TSW_TSNPORT_RTC_OFS_CH_SFNS_MASK (0xFFFFFFUL)
#define TSW_TSNPORT_RTC_OFS_CH_SFNS_SHIFT (0U)
#define TSW_TSNPORT_RTC_OFS_CH_SFNS_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_OFS_CH_SFNS_SHIFT) & TSW_TSNPORT_RTC_OFS_CH_SFNS_MASK)
#define TSW_TSNPORT_RTC_OFS_CH_SFNS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_OFS_CH_SFNS_MASK) >> TSW_TSNPORT_RTC_OFS_CH_SFNS_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: RTC_ALARM_NS */
/*
 * AL_NS (R/W)
 *
 * Alarm Time (nanoseconds part). Valid value range from 0 – 999999999.
 */
#define TSW_TSNPORT_RTC_ALARM_NS_AL_NS_MASK (0x3FFFFFFFUL)
#define TSW_TSNPORT_RTC_ALARM_NS_AL_NS_SHIFT (0U)
#define TSW_TSNPORT_RTC_ALARM_NS_AL_NS_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_ALARM_NS_AL_NS_SHIFT) & TSW_TSNPORT_RTC_ALARM_NS_AL_NS_MASK)
#define TSW_TSNPORT_RTC_ALARM_NS_AL_NS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_ALARM_NS_AL_NS_MASK) >> TSW_TSNPORT_RTC_ALARM_NS_AL_NS_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: RTC_ALARM_SL */
/*
 * AL_SL (R/W)
 *
 * Alarm Time (seconds lo part)
 */
#define TSW_TSNPORT_RTC_ALARM_SL_AL_SL_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_RTC_ALARM_SL_AL_SL_SHIFT (0U)
#define TSW_TSNPORT_RTC_ALARM_SL_AL_SL_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_ALARM_SL_AL_SL_SHIFT) & TSW_TSNPORT_RTC_ALARM_SL_AL_SL_MASK)
#define TSW_TSNPORT_RTC_ALARM_SL_AL_SL_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_ALARM_SL_AL_SL_MASK) >> TSW_TSNPORT_RTC_ALARM_SL_AL_SL_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: RTC_ALARM_SH */
/*
 * AL_SH (R/W)
 *
 * Alarm Time (seconds hi part)
 */
#define TSW_TSNPORT_RTC_ALARM_SH_AL_SH_MASK (0xFFFFU)
#define TSW_TSNPORT_RTC_ALARM_SH_AL_SH_SHIFT (0U)
#define TSW_TSNPORT_RTC_ALARM_SH_AL_SH_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_ALARM_SH_AL_SH_SHIFT) & TSW_TSNPORT_RTC_ALARM_SH_AL_SH_MASK)
#define TSW_TSNPORT_RTC_ALARM_SH_AL_SH_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_ALARM_SH_AL_SH_MASK) >> TSW_TSNPORT_RTC_ALARM_SH_AL_SH_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: RTC_TIMER_A_PERIOD */
/*
 * PERIOD_NS (R/W)
 *
 * Timer A Period in ns. This is the period of the timer until the next event, but the half-period of the signal “timer_a_clk”.
 */
#define TSW_TSNPORT_RTC_TIMER_A_PERIOD_PERIOD_NS_MASK (0x1FFFFFFFUL)
#define TSW_TSNPORT_RTC_TIMER_A_PERIOD_PERIOD_NS_SHIFT (0U)
#define TSW_TSNPORT_RTC_TIMER_A_PERIOD_PERIOD_NS_SET(x) (((uint32_t)(x) << TSW_TSNPORT_RTC_TIMER_A_PERIOD_PERIOD_NS_SHIFT) & TSW_TSNPORT_RTC_TIMER_A_PERIOD_PERIOD_NS_MASK)
#define TSW_TSNPORT_RTC_TIMER_A_PERIOD_PERIOD_NS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RTC_TIMER_A_PERIOD_PERIOD_NS_MASK) >> TSW_TSNPORT_RTC_TIMER_A_PERIOD_PERIOD_NS_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_CR */
/*
 * TMR_ALD (R/W)
 *
 * Timer Auto Load: automatic reloading of timer when reaching 0. Done flag stays set after countdown. Used for periodic events, when following event shall not be delayed by host interaction.
 */
#define TSW_TSNPORT_TSYN_CR_TMR_ALD_MASK (0x1F0000UL)
#define TSW_TSNPORT_TSYN_CR_TMR_ALD_SHIFT (16U)
#define TSW_TSNPORT_TSYN_CR_TMR_ALD_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSYN_CR_TMR_ALD_SHIFT) & TSW_TSNPORT_TSYN_CR_TMR_ALD_MASK)
#define TSW_TSNPORT_TSYN_CR_TMR_ALD_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_CR_TMR_ALD_MASK) >> TSW_TSNPORT_TSYN_CR_TMR_ALD_SHIFT)

/*
 * TMR_EN (R/W)
 *
 * Timer Enable: every bit corresponds to Timer 0 – 4
 */
#define TSW_TSNPORT_TSYN_CR_TMR_EN_MASK (0x1F00U)
#define TSW_TSNPORT_TSYN_CR_TMR_EN_SHIFT (8U)
#define TSW_TSNPORT_TSYN_CR_TMR_EN_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSYN_CR_TMR_EN_SHIFT) & TSW_TSNPORT_TSYN_CR_TMR_EN_MASK)
#define TSW_TSNPORT_TSYN_CR_TMR_EN_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_CR_TMR_EN_MASK) >> TSW_TSNPORT_TSYN_CR_TMR_EN_SHIFT)

/*
 * TMRIE (R/W)
 *
 * Timer Interrupt Enable
 */
#define TSW_TSNPORT_TSYN_CR_TMRIE_MASK (0x4U)
#define TSW_TSNPORT_TSYN_CR_TMRIE_SHIFT (2U)
#define TSW_TSNPORT_TSYN_CR_TMRIE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSYN_CR_TMRIE_SHIFT) & TSW_TSNPORT_TSYN_CR_TMRIE_MASK)
#define TSW_TSNPORT_TSYN_CR_TMRIE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_CR_TMRIE_MASK) >> TSW_TSNPORT_TSYN_CR_TMRIE_SHIFT)

/*
 * RXIE (R/W)
 *
 * Rx Interrupt Enable
 */
#define TSW_TSNPORT_TSYN_CR_RXIE_MASK (0x2U)
#define TSW_TSNPORT_TSYN_CR_RXIE_SHIFT (1U)
#define TSW_TSNPORT_TSYN_CR_RXIE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSYN_CR_RXIE_SHIFT) & TSW_TSNPORT_TSYN_CR_RXIE_MASK)
#define TSW_TSNPORT_TSYN_CR_RXIE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_CR_RXIE_MASK) >> TSW_TSNPORT_TSYN_CR_RXIE_SHIFT)

/*
 * TXIE (R/W)
 *
 * Tx Interrupt Enable
 */
#define TSW_TSNPORT_TSYN_CR_TXIE_MASK (0x1U)
#define TSW_TSNPORT_TSYN_CR_TXIE_SHIFT (0U)
#define TSW_TSNPORT_TSYN_CR_TXIE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSYN_CR_TXIE_SHIFT) & TSW_TSNPORT_TSYN_CR_TXIE_MASK)
#define TSW_TSNPORT_TSYN_CR_TXIE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_CR_TXIE_MASK) >> TSW_TSNPORT_TSYN_CR_TXIE_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_SR */
/*
 * TMR_DN (R/WC)
 *
 * Timer Done: 1 when timer reached 0
 */
#define TSW_TSNPORT_TSYN_SR_TMR_DN_MASK (0x1F00U)
#define TSW_TSNPORT_TSYN_SR_TMR_DN_SHIFT (8U)
#define TSW_TSNPORT_TSYN_SR_TMR_DN_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSYN_SR_TMR_DN_SHIFT) & TSW_TSNPORT_TSYN_SR_TMR_DN_MASK)
#define TSW_TSNPORT_TSYN_SR_TMR_DN_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_SR_TMR_DN_MASK) >> TSW_TSNPORT_TSYN_SR_TMR_DN_SHIFT)

