RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * TMRIS (RO)
 *
 * Timer Interrupt Status: OR’ed (TMR_DN AND TMR_EN) flags. 1 when timer is enabled and countdown is done
 */
#define TSW_TSNPORT_TSYN_SR_TMRIS_MASK (0x4U)
#define TSW_TSNPORT_TSYN_SR_TMRIS_SHIFT (2U)
#define TSW_TSNPORT_TSYN_SR_TMRIS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_SR_TMRIS_MASK) >> TSW_TSNPORT_TSYN_SR_TMRIS_SHIFT)

/*
 * RXIS (RO)
 *
 * Rx Interrupt Status, RX buffer data available equal to PTP_RX_STS.AV)
 */
#define TSW_TSNPORT_TSYN_SR_RXIS_MASK (0x2U)
#define TSW_TSNPORT_TSYN_SR_RXIS_SHIFT (1U)
#define TSW_TSNPORT_TSYN_SR_RXIS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_SR_RXIS_MASK) >> TSW_TSNPORT_TSYN_SR_RXIS_SHIFT)

/*
 * TXIS (RO)
 *
 * Tx Done Interrupt Status: OR’ed PTP_TX_DONE
 */
#define TSW_TSNPORT_TSYN_SR_TXIS_MASK (0x1U)
#define TSW_TSNPORT_TSYN_SR_TXIS_SHIFT (0U)
#define TSW_TSNPORT_TSYN_SR_TXIS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_SR_TXIS_MASK) >> TSW_TSNPORT_TSYN_SR_TXIS_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_PTP_TX_STS */
/*
 * STS (RO)
 *
 * Transmission status of PTP TX bin n (bit 0 – 7 correspond to tx bin 0 – 7). 1: transmission pending
 */
#define TSW_TSNPORT_TSYN_PTP_TX_STS_STS_MASK (0xFFU)
#define TSW_TSNPORT_TSYN_PTP_TX_STS_STS_SHIFT (0U)
#define TSW_TSNPORT_TSYN_PTP_TX_STS_STS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_PTP_TX_STS_STS_MASK) >> TSW_TSNPORT_TSYN_PTP_TX_STS_STS_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_PTP_TX_DONE */
/*
 * DONE (R/WC)
 *
 * Transmission done status of PTP TX bin n (bit 0 – 7 correspond to tx bin 0 – 7). 1: transmission done.
 * Writing a ‘1’ clears corresponding bit..
 */
#define TSW_TSNPORT_TSYN_PTP_TX_DONE_DONE_MASK (0xFFU)
#define TSW_TSNPORT_TSYN_PTP_TX_DONE_DONE_SHIFT (0U)
#define TSW_TSNPORT_TSYN_PTP_TX_DONE_DONE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSYN_PTP_TX_DONE_DONE_SHIFT) & TSW_TSNPORT_TSYN_PTP_TX_DONE_DONE_MASK)
#define TSW_TSNPORT_TSYN_PTP_TX_DONE_DONE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_PTP_TX_DONE_DONE_MASK) >> TSW_TSNPORT_TSYN_PTP_TX_DONE_DONE_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_PTP_TX_TRIG */
/*
 * TRIG (WO)
 *
 * Trigger PTP TX bin n (bit 0 – 7 correspond to tx bin 0 –7). Writing ‘1’ will trigger transmission. Corresponding bit PTP_TX_STS.STS(n) will be set immediately.
 */
#define TSW_TSNPORT_TSYN_PTP_TX_TRIG_TRIG_MASK (0xFFU)
#define TSW_TSNPORT_TSYN_PTP_TX_TRIG_TRIG_SHIFT (0U)
#define TSW_TSNPORT_TSYN_PTP_TX_TRIG_TRIG_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSYN_PTP_TX_TRIG_TRIG_SHIFT) & TSW_TSNPORT_TSYN_PTP_TX_TRIG_TRIG_MASK)
#define TSW_TSNPORT_TSYN_PTP_TX_TRIG_TRIG_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_PTP_TX_TRIG_TRIG_MASK) >> TSW_TSNPORT_TSYN_PTP_TX_TRIG_TRIG_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_PTP_RX_STS */
/*
 * OV (R/WC)
 *
 * FIFO overflow flag. PTP frame has been received and there was no free buffer available. Data has been lost.
 */
#define TSW_TSNPORT_TSYN_PTP_RX_STS_OV_MASK (0x80000000UL)
#define TSW_TSNPORT_TSYN_PTP_RX_STS_OV_SHIFT (31U)
#define TSW_TSNPORT_TSYN_PTP_RX_STS_OV_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSYN_PTP_RX_STS_OV_SHIFT) & TSW_TSNPORT_TSYN_PTP_RX_STS_OV_MASK)
#define TSW_TSNPORT_TSYN_PTP_RX_STS_OV_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_PTP_RX_STS_OV_MASK) >> TSW_TSNPORT_TSYN_PTP_RX_STS_OV_SHIFT)

/*
 * AV_NXT (R/W)
 *
 * Read access: buffer data available – reading data from RX_BUF is valid.
 * Write access: switch to next RX buffer – shall only be done when buffer not empty (AV=1). Use field RX_SEL as indication when rx buffer switch has been done.
 */
#define TSW_TSNPORT_TSYN_PTP_RX_STS_AV_NXT_MASK (0x40000000UL)
#define TSW_TSNPORT_TSYN_PTP_RX_STS_AV_NXT_SHIFT (30U)
#define TSW_TSNPORT_TSYN_PTP_RX_STS_AV_NXT_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSYN_PTP_RX_STS_AV_NXT_SHIFT) & TSW_TSNPORT_TSYN_PTP_RX_STS_AV_NXT_MASK)
#define TSW_TSNPORT_TSYN_PTP_RX_STS_AV_NXT_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_PTP_RX_STS_AV_NXT_MASK) >> TSW_TSNPORT_TSYN_PTP_RX_STS_AV_NXT_SHIFT)

/*
 * RX_SEL (RO)
 *
 * Current selected RX buffer for reading (0-7). Can be used to determine when RX buffer has been switched after setting PTP_RX_STS.NXT
 */
#define TSW_TSNPORT_TSYN_PTP_RX_STS_RX_SEL_MASK (0x7U)
#define TSW_TSNPORT_TSYN_PTP_RX_STS_RX_SEL_SHIFT (0U)
#define TSW_TSNPORT_TSYN_PTP_RX_STS_RX_SEL_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_PTP_RX_STS_RX_SEL_MASK) >> TSW_TSNPORT_TSYN_PTP_RX_STS_RX_SEL_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_TMR0 */
/*
 * PERIOD (R/W)
 *
 * Period in ticks, ticks based on register HCLKDIV and host clock <sys_clk>.
 */
#define TSW_TSNPORT_TSYNTMR_PERIOD_MASK (0xFFFFFUL)
#define TSW_TSNPORT_TSYNTMR_PERIOD_SHIFT (0U)
#define TSW_TSNPORT_TSYNTMR_PERIOD_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSYNTMR_PERIOD_SHIFT) & TSW_TSNPORT_TSYNTMR_PERIOD_MASK)
#define TSW_TSNPORT_TSYNTMR_PERIOD_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYNTMR_PERIOD_MASK) >> TSW_TSNPORT_TSYNTMR_PERIOD_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_HCLKDIV */
/*
 * PERIOD (R/W)
 *
 * Period in host clocks <sys_clk>. Host clock shall be scaled to ticks of 1/1024th second. Ticks are used by timer TMR0 – TMR4.
 */
#define TSW_TSNPORT_TSYN_HCLKDIV_PERIOD_MASK (0xFFFFFUL)
#define TSW_TSNPORT_TSYN_HCLKDIV_PERIOD_SHIFT (0U)
#define TSW_TSNPORT_TSYN_HCLKDIV_PERIOD_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSYN_HCLKDIV_PERIOD_SHIFT) & TSW_TSNPORT_TSYN_HCLKDIV_PERIOD_MASK)
#define TSW_TSNPORT_TSYN_HCLKDIV_PERIOD_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_HCLKDIV_PERIOD_MASK) >> TSW_TSNPORT_TSYN_HCLKDIV_PERIOD_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_RXBUF_RX_FRAME_LENGTH_BYTES */
/*
 * RX_FRAME_LENGTH_BYTES (RO)
 *
 * RX frame length bytes [11:0]
 */
#define TSW_TSNPORT_TSYN_RXBUF_RX_FRAME_LENGTH_BYTES_RX_FRAME_LENGTH_BYTES_MASK (0xFFFU)
#define TSW_TSNPORT_TSYN_RXBUF_RX_FRAME_LENGTH_BYTES_RX_FRAME_LENGTH_BYTES_SHIFT (0U)
#define TSW_TSNPORT_TSYN_RXBUF_RX_FRAME_LENGTH_BYTES_RX_FRAME_LENGTH_BYTES_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_RXBUF_RX_FRAME_LENGTH_BYTES_RX_FRAME_LENGTH_BYTES_MASK) >> TSW_TSNPORT_TSYN_RXBUF_RX_FRAME_LENGTH_BYTES_RX_FRAME_LENGTH_BYTES_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_RXBUF_RX_TIME_STAMP_L */
/*
 * RX_TIMESTAMP_LOW (RO)
 *
 * RX Timestamp [31:0]
 */
#define TSW_TSNPORT_TSYN_RXBUF_RX_TIME_STAMP_L_RX_TIMESTAMP_LOW_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_TSYN_RXBUF_RX_TIME_STAMP_L_RX_TIMESTAMP_LOW_SHIFT (0U)
#define TSW_TSNPORT_TSYN_RXBUF_RX_TIME_STAMP_L_RX_TIMESTAMP_LOW_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_RXBUF_RX_TIME_STAMP_L_RX_TIMESTAMP_LOW_MASK) >> TSW_TSNPORT_TSYN_RXBUF_RX_TIME_STAMP_L_RX_TIMESTAMP_LOW_SHIFT)

