RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/* Bitfield definition for register of struct array TSNPORT: TSYN_RXBUF_RX_TIME_STAMP_H */
/*
 * RX_TIMESTAMP_HIGH (RO)
 *
 * RX Timestamp [63:32]
 */
#define TSW_TSNPORT_TSYN_RXBUF_RX_TIME_STAMP_H_RX_TIMESTAMP_HIGH_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_TSYN_RXBUF_RX_TIME_STAMP_H_RX_TIMESTAMP_HIGH_SHIFT (0U)
#define TSW_TSNPORT_TSYN_RXBUF_RX_TIME_STAMP_H_RX_TIMESTAMP_HIGH_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSYN_RXBUF_RX_TIME_STAMP_H_RX_TIMESTAMP_HIGH_MASK) >> TSW_TSNPORT_TSYN_RXBUF_RX_TIME_STAMP_H_RX_TIMESTAMP_HIGH_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_RXBUF_DATA_WORD0 */
/*
 * RXBUF_DATA_WORD (RO)
 *
 * RXBUF_DATA_WORD
 */
#define TSW_TSNPORT_RXDATA_RXBUF_DATA_WORD_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_RXDATA_RXBUF_DATA_WORD_SHIFT (0U)
#define TSW_TSNPORT_RXDATA_RXBUF_DATA_WORD_GET(x) (((uint32_t)(x) & TSW_TSNPORT_RXDATA_RXBUF_DATA_WORD_MASK) >> TSW_TSNPORT_RXDATA_RXBUF_DATA_WORD_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_TXBUF_BIN0_DATA_WORD0 */
/*
 * TXBUF_BIN0_DATA_WORD0 (WO/RO)
 *
 * TXBUF_BIN0_DATA_WORD0
 */
#define TSW_TSNPORT_BIN_TXDATA_TXBUF_BIN0_DATA_WORD0_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_BIN_TXDATA_TXBUF_BIN0_DATA_WORD0_SHIFT (0U)
#define TSW_TSNPORT_BIN_TXDATA_TXBUF_BIN0_DATA_WORD0_SET(x) (((uint32_t)(x) << TSW_TSNPORT_BIN_TXDATA_TXBUF_BIN0_DATA_WORD0_SHIFT) & TSW_TSNPORT_BIN_TXDATA_TXBUF_BIN0_DATA_WORD0_MASK)
#define TSW_TSNPORT_BIN_TXDATA_TXBUF_BIN0_DATA_WORD0_GET(x) (((uint32_t)(x) & TSW_TSNPORT_BIN_TXDATA_TXBUF_BIN0_DATA_WORD0_MASK) >> TSW_TSNPORT_BIN_TXDATA_TXBUF_BIN0_DATA_WORD0_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN */
/*
 * TXBUF_BIN0_TQUE (WO/RO)
 *
 * TXBUF_BIN0_TQUE
 */
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TQUE_MASK (0x7000000UL)
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TQUE_SHIFT (24U)
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TQUE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TQUE_SHIFT) & TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TQUE_MASK)
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TQUE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TQUE_MASK) >> TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TQUE_SHIFT)

/*
 * TXBUF_BIN0_TX_LEN (WO/RO)
 *
 * TXBUF_BIN0_TX_LEN
 */
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TX_LEN_MASK (0xFFU)
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TX_LEN_SHIFT (0U)
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TX_LEN_SET(x) (((uint32_t)(x) << TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TX_LEN_SHIFT) & TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TX_LEN_MASK)
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TX_LEN_GET(x) (((uint32_t)(x) & TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TX_LEN_MASK) >> TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TQUE_AND_TX_LEN_TXBUF_BIN0_TX_LEN_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_TXBUF_BIN0_TX_TIMESTAMP_L */
/*
 * TXBUF_BIN0_TX_TIMESTAMP_L (WO/RO)
 *
 * TXBUF_BIN0_TX_TIMESTAMP_L
 */
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_L_TXBUF_BIN0_TX_TIMESTAMP_L_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_L_TXBUF_BIN0_TX_TIMESTAMP_L_SHIFT (0U)
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_L_TXBUF_BIN0_TX_TIMESTAMP_L_SET(x) (((uint32_t)(x) << TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_L_TXBUF_BIN0_TX_TIMESTAMP_L_SHIFT) & TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_L_TXBUF_BIN0_TX_TIMESTAMP_L_MASK)
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_L_TXBUF_BIN0_TX_TIMESTAMP_L_GET(x) (((uint32_t)(x) & TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_L_TXBUF_BIN0_TX_TIMESTAMP_L_MASK) >> TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_L_TXBUF_BIN0_TX_TIMESTAMP_L_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSYN_TXBUF_BIN0_TX_TIMESTAMP_H */
/*
 * TXBUF_BIN0_TX_TIMESTAMP_H (WO/RO)
 *
 * TXBUF_BIN0TX_TIMESTAMP_H
 */
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_H_TXBUF_BIN0_TX_TIMESTAMP_H_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_H_TXBUF_BIN0_TX_TIMESTAMP_H_SHIFT (0U)
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_H_TXBUF_BIN0_TX_TIMESTAMP_H_SET(x) (((uint32_t)(x) << TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_H_TXBUF_BIN0_TX_TIMESTAMP_H_SHIFT) & TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_H_TXBUF_BIN0_TX_TIMESTAMP_H_MASK)
#define TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_H_TXBUF_BIN0_TX_TIMESTAMP_H_GET(x) (((uint32_t)(x) & TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_H_TXBUF_BIN0_TX_TIMESTAMP_H_MASK) >> TSW_TSNPORT_BIN_TSYN_TXBUF_BIN0_TX_TIMESTAMP_H_TXBUF_BIN0_TX_TIMESTAMP_H_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_SHAPER_HWCFG1 */
/*
 * LWIDTH (RO)
 *
 * Scheduler list address width (IP core parameter LWIDTH)
 */
#define TSW_TSNPORT_TSN_SHAPER_HWCFG1_LWIDTH_MASK (0xFF000000UL)
#define TSW_TSNPORT_TSN_SHAPER_HWCFG1_LWIDTH_SHIFT (24U)
#define TSW_TSNPORT_TSN_SHAPER_HWCFG1_LWIDTH_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_SHAPER_HWCFG1_LWIDTH_MASK) >> TSW_TSNPORT_TSN_SHAPER_HWCFG1_LWIDTH_SHIFT)

/*
 * TQC (RO)
 *
 * Traffic queue count (IP core parameter TQC)
 */
#define TSW_TSNPORT_TSN_SHAPER_HWCFG1_TQC_MASK (0xFF0000UL)
#define TSW_TSNPORT_TSN_SHAPER_HWCFG1_TQC_SHIFT (16U)
#define TSW_TSNPORT_TSN_SHAPER_HWCFG1_TQC_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_SHAPER_HWCFG1_TQC_MASK) >> TSW_TSNPORT_TSN_SHAPER_HWCFG1_TQC_SHIFT)

/*
 * TQD (RO)
 *
 * Traffic queue depth (IP core parameter TQD)
 */
#define TSW_TSNPORT_TSN_SHAPER_HWCFG1_TQD_MASK (0xFF00U)
#define TSW_TSNPORT_TSN_SHAPER_HWCFG1_TQD_SHIFT (8U)
#define TSW_TSNPORT_TSN_SHAPER_HWCFG1_TQD_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_SHAPER_HWCFG1_TQD_MASK) >> TSW_TSNPORT_TSN_SHAPER_HWCFG1_TQD_SHIFT)

