RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * DW (RO)
 *
 * Traffic queue data width (Bytes); fixed to value 4 within
 * IP core
 */
#define TSW_TSNPORT_TSN_SHAPER_HWCFG1_DW_MASK (0xFFU)
#define TSW_TSNPORT_TSN_SHAPER_HWCFG1_DW_SHIFT (0U)
#define TSW_TSNPORT_TSN_SHAPER_HWCFG1_DW_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_SHAPER_HWCFG1_DW_MASK) >> TSW_TSNPORT_TSN_SHAPER_HWCFG1_DW_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_SHAPER_TQAV */
/*
 * AVIE (R/W)
 *
 * Traffic queue interrupt enable on buffer space available,
 * one bit per traffic queue
 * Bit[i] = 0: no interrupt
 * Bit[i] = 1: interrupt, when AVAIL[i]=1
 */
#define TSW_TSNPORT_TSN_SHAPER_TQAV_AVIE_MASK (0xFF00U)
#define TSW_TSNPORT_TSN_SHAPER_TQAV_AVIE_SHIFT (8U)
#define TSW_TSNPORT_TSN_SHAPER_TQAV_AVIE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSN_SHAPER_TQAV_AVIE_SHIFT) & TSW_TSNPORT_TSN_SHAPER_TQAV_AVIE_MASK)
#define TSW_TSNPORT_TSN_SHAPER_TQAV_AVIE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_SHAPER_TQAV_AVIE_MASK) >> TSW_TSNPORT_TSN_SHAPER_TQAV_AVIE_SHIFT)

/*
 * AVAIL (RO)
 *
 * Traffic queue buffer space available for complete packet of size MaxSDU (register MXSDUi)
 * Bit[i] = 1: space available
 * Bit[i] = 0: no space available or TQ not implemented (I >= TQC)
 */
#define TSW_TSNPORT_TSN_SHAPER_TQAV_AVAIL_MASK (0xFFU)
#define TSW_TSNPORT_TSN_SHAPER_TQAV_AVAIL_SHIFT (0U)
#define TSW_TSNPORT_TSN_SHAPER_TQAV_AVAIL_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_SHAPER_TQAV_AVAIL_MASK) >> TSW_TSNPORT_TSN_SHAPER_TQAV_AVAIL_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_SHAPER_TQEM */
/*
 * EMPTY (RO)
 *
 * Traffic queue empty
 * Bit[i] = 1: traffic queue i is empty
 */
#define TSW_TSNPORT_TSN_SHAPER_TQEM_EMPTY_MASK (0xFFU)
#define TSW_TSNPORT_TSN_SHAPER_TQEM_EMPTY_SHIFT (0U)
#define TSW_TSNPORT_TSN_SHAPER_TQEM_EMPTY_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_SHAPER_TQEM_EMPTY_MASK) >> TSW_TSNPORT_TSN_SHAPER_TQEM_EMPTY_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_SHAPER_FPST */
/*
 * TABLE (R/W)
 *
 * Frame Preemption Status Table,
 * Bit[i] = 1: Preemptable traffic in TQ[i], otherwise
 * Express traffic (default)
 */
#define TSW_TSNPORT_TSN_SHAPER_FPST_TABLE_MASK (0xFFU)
#define TSW_TSNPORT_TSN_SHAPER_FPST_TABLE_SHIFT (0U)
#define TSW_TSNPORT_TSN_SHAPER_FPST_TABLE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSN_SHAPER_FPST_TABLE_SHIFT) & TSW_TSNPORT_TSN_SHAPER_FPST_TABLE_MASK)
#define TSW_TSNPORT_TSN_SHAPER_FPST_TABLE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_SHAPER_FPST_TABLE_MASK) >> TSW_TSNPORT_TSN_SHAPER_FPST_TABLE_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_SHAPER_MMCT */
/*
 * RQREL (R/W)
 *
 * Request HOLD-Signal release operation. Will be automatically set to <0>
 */
#define TSW_TSNPORT_TSN_SHAPER_MMCT_RQREL_MASK (0x2U)
#define TSW_TSNPORT_TSN_SHAPER_MMCT_RQREL_SHIFT (1U)
#define TSW_TSNPORT_TSN_SHAPER_MMCT_RQREL_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSN_SHAPER_MMCT_RQREL_SHIFT) & TSW_TSNPORT_TSN_SHAPER_MMCT_RQREL_MASK)
#define TSW_TSNPORT_TSN_SHAPER_MMCT_RQREL_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_SHAPER_MMCT_RQREL_MASK) >> TSW_TSNPORT_TSN_SHAPER_MMCT_RQREL_SHIFT)

/*
 * RQHLD (R/W)
 *
 * Request HOLD-Signal hold operation. Will be automatically set to <0>.
 */
#define TSW_TSNPORT_TSN_SHAPER_MMCT_RQHLD_MASK (0x1U)
#define TSW_TSNPORT_TSN_SHAPER_MMCT_RQHLD_SHIFT (0U)
#define TSW_TSNPORT_TSN_SHAPER_MMCT_RQHLD_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSN_SHAPER_MMCT_RQHLD_SHIFT) & TSW_TSNPORT_TSN_SHAPER_MMCT_RQHLD_MASK)
#define TSW_TSNPORT_TSN_SHAPER_MMCT_RQHLD_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_SHAPER_MMCT_RQHLD_MASK) >> TSW_TSNPORT_TSN_SHAPER_MMCT_RQHLD_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_SHAPER_HOLDADV */
/*
 * VALUE (R/W)
 *
 * holdAdvance time for TAS operation Set-And-Hold-MAC in <sys_clk> cycles
 */
#define TSW_TSNPORT_TSN_SHAPER_HOLDADV_VALUE_MASK (0xFFFFU)
#define TSW_TSNPORT_TSN_SHAPER_HOLDADV_VALUE_SHIFT (0U)
#define TSW_TSNPORT_TSN_SHAPER_HOLDADV_VALUE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSN_SHAPER_HOLDADV_VALUE_SHIFT) & TSW_TSNPORT_TSN_SHAPER_HOLDADV_VALUE_MASK)
#define TSW_TSNPORT_TSN_SHAPER_HOLDADV_VALUE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_SHAPER_HOLDADV_VALUE_MASK) >> TSW_TSNPORT_TSN_SHAPER_HOLDADV_VALUE_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_SHAPER_MXSDU0 */
/*
 * SDU (R/W)
 *
 * Maximum SDU size for traffic queue n (n = 0 – 7)Returns 0 when n > TQC. Value is size in words (32 bit word size).
 */
#define TSW_TSNPORT_MXSDU_SDU_MASK (0xFFFFU)
#define TSW_TSNPORT_MXSDU_SDU_SHIFT (0U)
#define TSW_TSNPORT_MXSDU_SDU_SET(x) (((uint32_t)(x) << TSW_TSNPORT_MXSDU_SDU_SHIFT) & TSW_TSNPORT_MXSDU_SDU_MASK)
#define TSW_TSNPORT_MXSDU_SDU_GET(x) (((uint32_t)(x) & TSW_TSNPORT_MXSDU_SDU_MASK) >> TSW_TSNPORT_MXSDU_SDU_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_SHAPER_TXSEL0 */
/*
 * CBS_EN (R/W)
 *
 * CBS enable traffic queue n (n = 0 – 7). Returns 0 when n > TQC. Must be 0 when changing register IDSLPi.
 */
#define TSW_TSNPORT_TXSEL_CBS_EN_MASK (0xFFFFU)
#define TSW_TSNPORT_TXSEL_CBS_EN_SHIFT (0U)
#define TSW_TSNPORT_TXSEL_CBS_EN_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TXSEL_CBS_EN_SHIFT) & TSW_TSNPORT_TXSEL_CBS_EN_MASK)
#define TSW_TSNPORT_TXSEL_CBS_EN_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TXSEL_CBS_EN_MASK) >> TSW_TSNPORT_TXSEL_CBS_EN_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_SHAPER_IDSEL0 */
/*
 * INT (R/W)
 *
 * CBS idle slope for traffic queue n (n = 0 – 7). Returns
 * 0 when n > TQC. The register must only be written
 * when TXSELi.CBE_EN=0.
 * The idle slope value is defined as (INT + FRACT /
 * 65536). The idle slope is set in bits per tick related to
 * <tx_clk>.
 */
#define TSW_TSNPORT_IDSEL_INT_MASK (0xF0000UL)
#define TSW_TSNPORT_IDSEL_INT_SHIFT (16U)
#define TSW_TSNPORT_IDSEL_INT_SET(x) (((uint32_t)(x) << TSW_TSNPORT_IDSEL_INT_SHIFT) & TSW_TSNPORT_IDSEL_INT_MASK)
#define TSW_TSNPORT_IDSEL_INT_GET(x) (((uint32_t)(x) & TSW_TSNPORT_IDSEL_INT_MASK) >> TSW_TSNPORT_IDSEL_INT_SHIFT)

