RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/* Bitfield definition for register of struct array TSNPORT: TSN_SHAPER_TXOV0 */
/*
 * VALUE (R/WC)
 *
 * Transmission overrun counter; increments on transmission when gate is closed; any write access will clear register to 0. TXOVi is only supported when TQC > i.
 */
#define TSW_TSNPORT_TXOV_VALUE_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_TXOV_VALUE_SHIFT (0U)
#define TSW_TSNPORT_TXOV_VALUE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TXOV_VALUE_SHIFT) & TSW_TSNPORT_TXOV_VALUE_MASK)
#define TSW_TSNPORT_TXOV_VALUE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TXOV_VALUE_MASK) >> TSW_TSNPORT_TXOV_VALUE_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_SHAPER_ACLIST_ENTRY0_L */
/*
 * TAS_GPIO (R/W)
 *
 * gate states for qch and ptp event source
 */
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_TAS_GPIO_MASK (0x3FC00UL)
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_TAS_GPIO_SHIFT (10U)
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_TAS_GPIO_SET(x) (((uint32_t)(x) << TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_TAS_GPIO_SHIFT) & TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_TAS_GPIO_MASK)
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_TAS_GPIO_GET(x) (((uint32_t)(x) & TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_TAS_GPIO_MASK) >> TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_TAS_GPIO_SHIFT)

/*
 * OP (R/W)
 *
 * gate operation:
 * 0 – SetGateStates
 * 1 – Set-And-Hold-MAC
 * 2 – Set-And-Release-MAC
 * 3 – undefined
 */
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_OP_MASK (0x300U)
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_OP_SHIFT (8U)
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_OP_SET(x) (((uint32_t)(x) << TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_OP_SHIFT) & TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_OP_MASK)
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_OP_GET(x) (((uint32_t)(x) & TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_OP_MASK) >> TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_OP_SHIFT)

/*
 * STATE (R/W)
 *
 * gate state vector;
 * 1 – Gate is open
 */
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_STATE_MASK (0xFFU)
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_STATE_SHIFT (0U)
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_STATE_SET(x) (((uint32_t)(x) << TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_STATE_SHIFT) & TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_STATE_MASK)
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_STATE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_STATE_MASK) >> TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_L_STATE_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_SHAPER_ACLIST_ENTRY0_H */
/*
 * TIME (R/W)
 *
 * Time interval, entry execution in in host clock ticks (<sys_clk>)
 */
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_H_TIME_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_H_TIME_SHIFT (0U)
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_H_TIME_SET(x) (((uint32_t)(x) << TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_H_TIME_SHIFT) & TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_H_TIME_MASK)
#define TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_H_TIME_GET(x) (((uint32_t)(x) & TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_H_TIME_MASK) >> TSW_TSNPORT_SHACL_TSN_SHAPER_ACLIST_ENTRY0_H_TIME_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_EP_VER */
/*
 * VER_HI (RO)
 *
 * major version number
 */
#define TSW_TSNPORT_TSN_EP_VER_VER_HI_MASK (0xFF000000UL)
#define TSW_TSNPORT_TSN_EP_VER_VER_HI_SHIFT (24U)
#define TSW_TSNPORT_TSN_EP_VER_VER_HI_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_VER_VER_HI_MASK) >> TSW_TSNPORT_TSN_EP_VER_VER_HI_SHIFT)

/*
 * VER_LO (RO)
 *
 * minor version number
 */
#define TSW_TSNPORT_TSN_EP_VER_VER_LO_MASK (0xFF0000UL)
#define TSW_TSNPORT_TSN_EP_VER_VER_LO_SHIFT (16U)
#define TSW_TSNPORT_TSN_EP_VER_VER_LO_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_VER_VER_LO_MASK) >> TSW_TSNPORT_TSN_EP_VER_VER_LO_SHIFT)

/*
 * VER_REV (RO)
 *
 * revision number
 */
#define TSW_TSNPORT_TSN_EP_VER_VER_REV_MASK (0xFFU)
#define TSW_TSNPORT_TSN_EP_VER_VER_REV_SHIFT (0U)
#define TSW_TSNPORT_TSN_EP_VER_VER_REV_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_VER_VER_REV_MASK) >> TSW_TSNPORT_TSN_EP_VER_VER_REV_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_EP_CTRL */
/*
 * FILTDIS (R/W)
 *
 * Disable filtering of PTP frames (Ethertype = 0x88F7)
 */
#define TSW_TSNPORT_TSN_EP_CTRL_FILTDIS_MASK (0x80000000UL)
#define TSW_TSNPORT_TSN_EP_CTRL_FILTDIS_SHIFT (31U)
#define TSW_TSNPORT_TSN_EP_CTRL_FILTDIS_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSN_EP_CTRL_FILTDIS_SHIFT) & TSW_TSNPORT_TSN_EP_CTRL_FILTDIS_MASK)
#define TSW_TSNPORT_TSN_EP_CTRL_FILTDIS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_CTRL_FILTDIS_MASK) >> TSW_TSNPORT_TSN_EP_CTRL_FILTDIS_SHIFT)

/*
 * PTP_1S_EN (R/W)
 *
 * Enable PTPv2 1-step synchronization suppor
 */
#define TSW_TSNPORT_TSN_EP_CTRL_PTP_1S_EN_MASK (0x40000000UL)
#define TSW_TSNPORT_TSN_EP_CTRL_PTP_1S_EN_SHIFT (30U)
#define TSW_TSNPORT_TSN_EP_CTRL_PTP_1S_EN_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSN_EP_CTRL_PTP_1S_EN_SHIFT) & TSW_TSNPORT_TSN_EP_CTRL_PTP_1S_EN_MASK)
#define TSW_TSNPORT_TSN_EP_CTRL_PTP_1S_EN_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_CTRL_PTP_1S_EN_MASK) >> TSW_TSNPORT_TSN_EP_CTRL_PTP_1S_EN_SHIFT)

/*
 * IE_TSF (R/W)
 *
 * TxTimestampFifo interrupt enable; interrupt will be set when IE_TSF=<1> and TSF_SR.USED>0
 */
#define TSW_TSNPORT_TSN_EP_CTRL_IE_TSF_MASK (0x1U)
#define TSW_TSNPORT_TSN_EP_CTRL_IE_TSF_SHIFT (0U)
#define TSW_TSNPORT_TSN_EP_CTRL_IE_TSF_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSN_EP_CTRL_IE_TSF_SHIFT) & TSW_TSNPORT_TSN_EP_CTRL_IE_TSF_MASK)
#define TSW_TSNPORT_TSN_EP_CTRL_IE_TSF_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_CTRL_IE_TSF_MASK) >> TSW_TSNPORT_TSN_EP_CTRL_IE_TSF_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_EP_TXUF */
/*
 * COUNTER (R/WC)
 *
 * TX buffer underflow counter; incremented when any MAC runs out of data during transmission. The counter is cleared at any write access. The counter is shared by pMAC and eMAC. If underflow event occurs at the same time for pMAC and eMAC, it will be counted as one event.
 */
#define TSW_TSNPORT_TSN_EP_TXUF_COUNTER_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_TSN_EP_TXUF_COUNTER_SHIFT (0U)
#define TSW_TSNPORT_TSN_EP_TXUF_COUNTER_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSN_EP_TXUF_COUNTER_SHIFT) & TSW_TSNPORT_TSN_EP_TXUF_COUNTER_MASK)
#define TSW_TSNPORT_TSN_EP_TXUF_COUNTER_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_TXUF_COUNTER_MASK) >> TSW_TSNPORT_TSN_EP_TXUF_COUNTER_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_EP_IPCFG */
/*
 * INCL_RTC (RO)
 *
 * IP core parameter “INCL_RTC”
 */
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_RTC_MASK (0x80000000UL)
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_RTC_SHIFT (31U)
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_RTC_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_IPCFG_INCL_RTC_MASK) >> TSW_TSNPORT_TSN_EP_IPCFG_INCL_RTC_SHIFT)

