RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * INCL_SHAP (RO)
 *
 * IP core parameter “INCL_SHAPER”
 */
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_SHAP_MASK (0x40000000UL)
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_SHAP_SHIFT (30U)
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_SHAP_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_IPCFG_INCL_SHAP_MASK) >> TSW_TSNPORT_TSN_EP_IPCFG_INCL_SHAP_SHIFT)

/*
 * INCL_FPE (RO)
 *
 * IP core parameter “INCL_FPE”
 */
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_FPE_MASK (0x20000000UL)
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_FPE_SHIFT (29U)
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_FPE_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_IPCFG_INCL_FPE_MASK) >> TSW_TSNPORT_TSN_EP_IPCFG_INCL_FPE_SHIFT)

/*
 * INCL_TSF (RO)
 *
 * IP core parameter “INCL_TSF”
 */
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_TSF_MASK (0x10000000UL)
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_TSF_SHIFT (28U)
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_TSF_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_IPCFG_INCL_TSF_MASK) >> TSW_TSNPORT_TSN_EP_IPCFG_INCL_TSF_SHIFT)

/*
 * INCL_TSYNC (RO)
 *
 * IP core parameter “INCL_TSYNC”
 */
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_TSYNC_MASK (0x8000000UL)
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_TSYNC_SHIFT (27U)
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_TSYNC_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_IPCFG_INCL_TSYNC_MASK) >> TSW_TSNPORT_TSN_EP_IPCFG_INCL_TSYNC_SHIFT)

/*
 * INCL_1STEP (RO)
 *
 * IP core parameter “INCL_1STEP”
 */
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_1STEP_MASK (0x4000000UL)
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_1STEP_SHIFT (26U)
#define TSW_TSNPORT_TSN_EP_IPCFG_INCL_1STEP_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_IPCFG_INCL_1STEP_MASK) >> TSW_TSNPORT_TSN_EP_IPCFG_INCL_1STEP_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_EP_TSF_D0 */
/*
 * TSF_NS (RO)
 *
 * Tx-Timestamp-Fifo, lower 32 bit part of local time (<curtime>) at the start of transmission of the packet. Usually nanoseconds part when used with included RTC.
 */
#define TSW_TSNPORT_TSN_EP_TSF_D0_TSF_NS_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_TSN_EP_TSF_D0_TSF_NS_SHIFT (0U)
#define TSW_TSNPORT_TSN_EP_TSF_D0_TSF_NS_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_TSF_D0_TSF_NS_MASK) >> TSW_TSNPORT_TSN_EP_TSF_D0_TSF_NS_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_EP_TSF_D1 */
/*
 * TSF_SEC (RO)
 *
 * Tx-Timestamp-Fifo, upper 32 bit part of the local time (<curtime>) at the start of the transmission of the packet. Usually seconds part when used with included RTC.
 */
#define TSW_TSNPORT_TSN_EP_TSF_D1_TSF_SEC_MASK (0xFFFFFFFFUL)
#define TSW_TSNPORT_TSN_EP_TSF_D1_TSF_SEC_SHIFT (0U)
#define TSW_TSNPORT_TSN_EP_TSF_D1_TSF_SEC_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_TSF_D1_TSF_SEC_MASK) >> TSW_TSNPORT_TSN_EP_TSF_D1_TSF_SEC_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_EP_TSF_D2 */
/*
 * TSF_TQ (RO)
 *
 * Tx-Timestamp-Fifo, traffic queue <tx_tqueue> of sent packet
 */
#define TSW_TSNPORT_TSN_EP_TSF_D2_TSF_TQ_MASK (0xE0000000UL)
#define TSW_TSNPORT_TSN_EP_TSF_D2_TSF_TQ_SHIFT (29U)
#define TSW_TSNPORT_TSN_EP_TSF_D2_TSF_TQ_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_TSF_D2_TSF_TQ_MASK) >> TSW_TSNPORT_TSN_EP_TSF_D2_TSF_TQ_SHIFT)

/*
 * TSF_USR (RO)
 *
 * Tx-Timestamp-Fifo, user sideband <tx_tuser> of sent packet; Note: any read to register will remove actual value from FIFO
 */
#define TSW_TSNPORT_TSN_EP_TSF_D2_TSF_USR_MASK (0x7U)
#define TSW_TSNPORT_TSN_EP_TSF_D2_TSF_USR_SHIFT (0U)
#define TSW_TSNPORT_TSN_EP_TSF_D2_TSF_USR_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_TSF_D2_TSF_USR_MASK) >> TSW_TSNPORT_TSN_EP_TSF_D2_TSF_USR_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_EP_TSF_SR */
/*
 * TSF_OV (R/WC)
 *
 * Overflow of Tx-Timestamp-Fifo. At least one transmitted packet has been sent and timestamp was not stored; write bit to clear flag
 */
#define TSW_TSNPORT_TSN_EP_TSF_SR_TSF_OV_MASK (0x80000000UL)
#define TSW_TSNPORT_TSN_EP_TSF_SR_TSF_OV_SHIFT (31U)
#define TSW_TSNPORT_TSN_EP_TSF_SR_TSF_OV_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSN_EP_TSF_SR_TSF_OV_SHIFT) & TSW_TSNPORT_TSN_EP_TSF_SR_TSF_OV_MASK)
#define TSW_TSNPORT_TSN_EP_TSF_SR_TSF_OV_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_TSF_SR_TSF_OV_MASK) >> TSW_TSNPORT_TSN_EP_TSF_SR_TSF_OV_SHIFT)

/*
 * TSF_USED (RO)
 *
 * Tx-Timestamp-Fifo currently used entries counter; reading of TSF_Dx is only valid if field value > 0. Any read from TSF_D2 will decrement counter (unless already 0).
 */
#define TSW_TSNPORT_TSN_EP_TSF_SR_TSF_USED_MASK (0xFFU)
#define TSW_TSNPORT_TSN_EP_TSF_SR_TSF_USED_SHIFT (0U)
#define TSW_TSNPORT_TSN_EP_TSF_SR_TSF_USED_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_TSF_SR_TSF_USED_MASK) >> TSW_TSNPORT_TSN_EP_TSF_SR_TSF_USED_SHIFT)

/* Bitfield definition for register of struct array TSNPORT: TSN_EP_MMS_CTRL */
/*
 * STATSEL (R/W)
 *
 * MMS statistic counter selection, value can be read in register
 * MMS_STAT
 * <000>: Frame reassembly error counter (802.3br, 30.14.1.8)
 * <001>: Frames rejected due to wrong SMD (802.3br, 30.14.1.9)
 * <010>: Frame assembly ok counter (802.3br, 30.14.1.10)
 * <011>: Fragment rx counter (802.3br, 30.14.1.11)
 * <100>: Fragment tx counter (802.3br, 30.14.1.12)
 * <101>: Hold request counter (802.3br, 30.14.1.13)
 * otherwise: <0>
 */
#define TSW_TSNPORT_TSN_EP_MMS_CTRL_STATSEL_MASK (0xE0U)
#define TSW_TSNPORT_TSN_EP_MMS_CTRL_STATSEL_SHIFT (5U)
#define TSW_TSNPORT_TSN_EP_MMS_CTRL_STATSEL_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSN_EP_MMS_CTRL_STATSEL_SHIFT) & TSW_TSNPORT_TSN_EP_MMS_CTRL_STATSEL_MASK)
#define TSW_TSNPORT_TSN_EP_MMS_CTRL_STATSEL_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_MMS_CTRL_STATSEL_MASK) >> TSW_TSNPORT_TSN_EP_MMS_CTRL_STATSEL_SHIFT)

/*
 * FRAGSZ (R/W)
 *
 * Minimum non-final fragment size: 64 x (1 + FRAGSZ) – 4 octets
 */
#define TSW_TSNPORT_TSN_EP_MMS_CTRL_FRAGSZ_MASK (0x18U)
#define TSW_TSNPORT_TSN_EP_MMS_CTRL_FRAGSZ_SHIFT (3U)
#define TSW_TSNPORT_TSN_EP_MMS_CTRL_FRAGSZ_SET(x) (((uint32_t)(x) << TSW_TSNPORT_TSN_EP_MMS_CTRL_FRAGSZ_SHIFT) & TSW_TSNPORT_TSN_EP_MMS_CTRL_FRAGSZ_MASK)
#define TSW_TSNPORT_TSN_EP_MMS_CTRL_FRAGSZ_GET(x) (((uint32_t)(x) & TSW_TSNPORT_TSN_EP_MMS_CTRL_FRAGSZ_MASK) >> TSW_TSNPORT_TSN_EP_MMS_CTRL_FRAGSZ_SHIFT)

