RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/*
 * PHY_INTF_SEL (RW)
 *
 * phy interface select
 */
#define TSW_TSNPORT_GPR_CTRL2_PHY_INTF_SEL_MASK (0xE000U)
#define TSW_TSNPORT_GPR_CTRL2_PHY_INTF_SEL_SHIFT (13U)
#define TSW_TSNPORT_GPR_CTRL2_PHY_INTF_SEL_SET(x) (((uint32_t)(x) << TSW_TSNPORT_GPR_CTRL2_PHY_INTF_SEL_SHIFT) & TSW_TSNPORT_GPR_CTRL2_PHY_INTF_SEL_MASK)
#define TSW_TSNPORT_GPR_CTRL2_PHY_INTF_SEL_GET(x) (((uint32_t)(x) & TSW_TSNPORT_GPR_CTRL2_PHY_INTF_SEL_MASK) >> TSW_TSNPORT_GPR_CTRL2_PHY_INTF_SEL_SHIFT)

/*
 * RMII_TXCLK_SEL (RW)
 *
 * txclk select control for RMII
 */
#define TSW_TSNPORT_GPR_CTRL2_RMII_TXCLK_SEL_MASK (0x400U)
#define TSW_TSNPORT_GPR_CTRL2_RMII_TXCLK_SEL_SHIFT (10U)
#define TSW_TSNPORT_GPR_CTRL2_RMII_TXCLK_SEL_SET(x) (((uint32_t)(x) << TSW_TSNPORT_GPR_CTRL2_RMII_TXCLK_SEL_SHIFT) & TSW_TSNPORT_GPR_CTRL2_RMII_TXCLK_SEL_MASK)
#define TSW_TSNPORT_GPR_CTRL2_RMII_TXCLK_SEL_GET(x) (((uint32_t)(x) & TSW_TSNPORT_GPR_CTRL2_RMII_TXCLK_SEL_MASK) >> TSW_TSNPORT_GPR_CTRL2_RMII_TXCLK_SEL_SHIFT)



/* HITMEM register group index macro definition */
#define TSW_HITMEM_HITMEM_REG_1 (0UL)
#define TSW_HITMEM_HITMEM_REG_2 (1UL)
#define TSW_HITMEM_HITMEM_REG_3 (2UL)
#define TSW_HITMEM_HITMEM_REG_4 (3UL)

/* QCI_CNT register group index macro definition */
#define TSW_QCI_CNT_CENTRAL_QCI_CNT0 (0UL)
#define TSW_QCI_CNT_CENTRAL_QCI_CNT1 (1UL)
#define TSW_QCI_CNT_CENTRAL_QCI_CNT2 (2UL)
#define TSW_QCI_CNT_CENTRAL_QCI_CNT3 (3UL)
#define TSW_QCI_CNT_CENTRAL_QCI_CNT4 (4UL)
#define TSW_QCI_CNT_CENTRAL_QCI_CNT5 (5UL)

/* EGFRCNT register group index macro definition */
#define TSW_EGFRCNT_CPU_PORT_EGRESS_FRER_CNT0 (0UL)
#define TSW_EGFRCNT_CPU_PORT_EGRESS_FRER_CNT1 (1UL)
#define TSW_EGFRCNT_CPU_PORT_EGRESS_FRER_CNT2 (2UL)
#define TSW_EGFRCNT_CPU_PORT_EGRESS_FRER_CNT3 (3UL)
#define TSW_EGFRCNT_CPU_PORT_EGRESS_FRER_CNT4 (4UL)
#define TSW_EGFRCNT_CPU_PORT_EGRESS_FRER_CNT5 (5UL)
#define TSW_EGFRCNT_CPU_PORT_EGRESS_FRER_CNT6 (6UL)
#define TSW_EGFRCNT_CPU_PORT_EGRESS_FRER_CNT7 (7UL)

/* IGFRCNT register group index macro definition */
#define TSW_IGFRCNT_CPU_PORT_IGRESS_FRER_CNT0 (0UL)
#define TSW_IGFRCNT_CPU_PORT_IGRESS_FRER_CNT1 (1UL)
#define TSW_IGFRCNT_CPU_PORT_IGRESS_FRER_CNT2 (2UL)
#define TSW_IGFRCNT_CPU_PORT_IGRESS_FRER_CNT3 (3UL)
#define TSW_IGFRCNT_CPU_PORT_IGRESS_FRER_CNT4 (4UL)
#define TSW_IGFRCNT_CPU_PORT_IGRESS_FRER_CNT5 (5UL)
#define TSW_IGFRCNT_CPU_PORT_IGRESS_FRER_CNT6 (6UL)
#define TSW_IGFRCNT_CPU_PORT_IGRESS_FRER_CNT7 (7UL)

/* MAC register group index macro definition */
#define TSW_MAC_EM1 (0UL)
#define TSW_MAC_PM1 (1UL)

/* TSYNTMR register group index macro definition */
#define TSW_TSNPORT_TSYNTMR_TSYN_TMR0 (0UL)
#define TSW_TSNPORT_TSYNTMR_TSYN_TMR1 (1UL)
#define TSW_TSNPORT_TSYNTMR_TSYN_TMR2 (2UL)
#define TSW_TSNPORT_TSYNTMR_TSYN_TMR3 (3UL)
#define TSW_TSNPORT_TSYNTMR_TSYN_TMR4 (4UL)

/* RXDATA register group index macro definition */
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD0 (0UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD1 (1UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD2 (2UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD3 (3UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD4 (4UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD5 (5UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD6 (6UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD7 (7UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD8 (8UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD9 (9UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD10 (10UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD11 (11UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD12 (12UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD13 (13UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD14 (14UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD15 (15UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD16 (16UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD17 (17UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD18 (18UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD19 (19UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD20 (20UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD21 (21UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD22 (22UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD23 (23UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD24 (24UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD25 (25UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD26 (26UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD27 (27UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD28 (28UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD29 (29UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD30 (30UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD31 (31UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD32 (32UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD33 (33UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD34 (34UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD35 (35UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD36 (36UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD37 (37UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD38 (38UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD39 (39UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD40 (40UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD41 (41UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD42 (42UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD43 (43UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD44 (44UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD45 (45UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD46 (46UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD47 (47UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD48 (48UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD49 (49UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD50 (50UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD51 (51UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD52 (52UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD53 (53UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD54 (54UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD55 (55UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD56 (56UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD57 (57UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD58 (58UL)
#define TSW_TSNPORT_RXDATA_TSYN_RXBUF_DATA_WORD59 (59UL)

/* TXDATA register group index macro definition */
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD0 (0UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD1 (1UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD2 (2UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD3 (3UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD4 (4UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD5 (5UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD6 (6UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD7 (7UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD8 (8UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD9 (9UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD10 (10UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD11 (11UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD12 (12UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD13 (13UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD14 (14UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD15 (15UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD16 (16UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD17 (17UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD18 (18UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD19 (19UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD20 (20UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD21 (21UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD22 (22UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD23 (23UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD24 (24UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD25 (25UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD26 (26UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD27 (27UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD28 (28UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD29 (29UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD30 (30UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD31 (31UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD32 (32UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD33 (33UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD34 (34UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD35 (35UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD36 (36UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD37 (37UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD38 (38UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD39 (39UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD40 (40UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD41 (41UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD42 (42UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD43 (43UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD44 (44UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD45 (45UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD46 (46UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD47 (47UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD48 (48UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD49 (49UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD50 (50UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD51 (51UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD52 (52UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD53 (53UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD54 (54UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD55 (55UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD56 (56UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD57 (57UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD58 (58UL)
#define TSW_TSNPORT_BIN_TXDATA_TSYN_TXBUF_BIN0_DATA_WORD59 (59UL)

