RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_tsw_regs.h
/* BIN register group index macro definition */
#define TSW_BIN_TX0 (0UL)
#define TSW_BIN_TX1 (1UL)
#define TSW_BIN_TX2 (2UL)
#define TSW_BIN_TX3 (3UL)
#define TSW_BIN_TX4 (4UL)
#define TSW_BIN_TX5 (5UL)
#define TSW_BIN_TX6 (6UL)
#define TSW_BIN_TX7 (7UL)

/* MXSDU register group index macro definition */
#define TSW_TSNPORT_MXSDU_TSN_SHAPER_MXSDU0 (0UL)
#define TSW_TSNPORT_MXSDU_TSN_SHAPER_MXSDU1 (1UL)
#define TSW_TSNPORT_MXSDU_TSN_SHAPER_MXSDU2 (2UL)
#define TSW_TSNPORT_MXSDU_TSN_SHAPER_MXSDU3 (3UL)
#define TSW_TSNPORT_MXSDU_TSN_SHAPER_MXSDU4 (4UL)
#define TSW_TSNPORT_MXSDU_TSN_SHAPER_MXSDU5 (5UL)
#define TSW_TSNPORT_MXSDU_TSN_SHAPER_MXSDU6 (6UL)
#define TSW_TSNPORT_MXSDU_TSN_SHAPER_MXSDU7 (7UL)

/* TXSEL register group index macro definition */
#define TSW_TSNPORT_TXSEL_TSN_SHAPER_TXSEL0 (0UL)
#define TSW_TSNPORT_TXSEL_TSN_SHAPER_TXSEL1 (1UL)
#define TSW_TSNPORT_TXSEL_TSN_SHAPER_TXSEL2 (2UL)
#define TSW_TSNPORT_TXSEL_TSN_SHAPER_TXSEL3 (3UL)
#define TSW_TSNPORT_TXSEL_TSN_SHAPER_TXSEL4 (4UL)
#define TSW_TSNPORT_TXSEL_TSN_SHAPER_TXSEL5 (5UL)
#define TSW_TSNPORT_TXSEL_TSN_SHAPER_TXSEL6 (6UL)
#define TSW_TSNPORT_TXSEL_TSN_SHAPER_TXSEL7 (7UL)

/* IDSEL register group index macro definition */
#define TSW_TSNPORT_IDSEL_TSN_SHAPER_IDSEL0 (0UL)
#define TSW_TSNPORT_IDSEL_TSN_SHAPER_IDSEL1 (1UL)
#define TSW_TSNPORT_IDSEL_TSN_SHAPER_IDSEL2 (2UL)
#define TSW_TSNPORT_IDSEL_TSN_SHAPER_IDSEL3 (3UL)
#define TSW_TSNPORT_IDSEL_TSN_SHAPER_IDSEL04 (4UL)
#define TSW_TSNPORT_IDSEL_TSN_SHAPER_IDSEL5 (5UL)
#define TSW_TSNPORT_IDSEL_TSN_SHAPER_IDSEL6 (6UL)
#define TSW_TSNPORT_IDSEL_TSN_SHAPER_IDSEL7 (7UL)

/* MXTK register group index macro definition */
#define TSW_TSNPORT_MXTK_TSN_SHAPER_MXTK0 (0UL)
#define TSW_TSNPORT_MXTK_TSN_SHAPER_MXTK1 (1UL)
#define TSW_TSNPORT_MXTK_TSN_SHAPER_MXTK2 (2UL)
#define TSW_TSNPORT_MXTK_TSN_SHAPER_MXTK3 (3UL)
#define TSW_TSNPORT_MXTK_TSN_SHAPER_MXTK4 (4UL)
#define TSW_TSNPORT_MXTK_TSN_SHAPER_MXTK5 (5UL)
#define TSW_TSNPORT_MXTK_TSN_SHAPER_MXTK6 (6UL)
#define TSW_TSNPORT_MXTK_TSN_SHAPER_MXTK7 (7UL)

/* TXOV register group index macro definition */
#define TSW_TSNPORT_TXOV_TSN_SHAPER_TXOV0 (0UL)
#define TSW_TSNPORT_TXOV_TSN_SHAPER_TXOV1 (1UL)
#define TSW_TSNPORT_TXOV_TSN_SHAPER_TXOV2 (2UL)
#define TSW_TSNPORT_TXOV_TSN_SHAPER_TXOV3 (3UL)
#define TSW_TSNPORT_TXOV_TSN_SHAPER_TXOV4 (4UL)
#define TSW_TSNPORT_TXOV_TSN_SHAPER_TXOV5 (5UL)
#define TSW_TSNPORT_TXOV_TSN_SHAPER_TXOV6 (6UL)
#define TSW_TSNPORT_TXOV_TSN_SHAPER_TXOV7 (7UL)

/* SHACL register group index macro definition */
#define TSW_SHACL_ENT0 (0UL)
#define TSW_SHACL_ENT1 (1UL)
#define TSW_SHACL_ENT2 (2UL)
#define TSW_SHACL_ENT3 (3UL)
#define TSW_SHACL_ENT4 (4UL)
#define TSW_SHACL_ENT5 (5UL)
#define TSW_SHACL_ENT6 (6UL)
#define TSW_SHACL_ENT7 (7UL)
#define TSW_SHACL_ENT8 (8UL)
#define TSW_SHACL_ENT9 (9UL)
#define TSW_SHACL_ENT10 (10UL)
#define TSW_SHACL_ENT11 (11UL)
#define TSW_SHACL_ENT12 (12UL)
#define TSW_SHACL_ENT13 (13UL)
#define TSW_SHACL_ENT14 (14UL)
#define TSW_SHACL_ENT15 (15UL)
#define TSW_SHACL_ENT16 (16UL)
#define TSW_SHACL_ENT17 (17UL)
#define TSW_SHACL_ENT18 (18UL)
#define TSW_SHACL_ENT19 (19UL)
#define TSW_SHACL_ENT20 (20UL)
#define TSW_SHACL_ENT21 (21UL)
#define TSW_SHACL_ENT22 (22UL)
#define TSW_SHACL_ENT23 (23UL)
#define TSW_SHACL_ENT24 (24UL)
#define TSW_SHACL_ENT25 (25UL)
#define TSW_SHACL_ENT26 (26UL)
#define TSW_SHACL_ENT27 (27UL)
#define TSW_SHACL_ENT28 (28UL)
#define TSW_SHACL_ENT29 (29UL)
#define TSW_SHACL_ENT30 (30UL)
#define TSW_SHACL_ENT31 (31UL)
#define TSW_SHACL_ENT32 (32UL)
#define TSW_SHACL_ENT33 (33UL)
#define TSW_SHACL_ENT34 (34UL)
#define TSW_SHACL_ENT35 (35UL)
#define TSW_SHACL_ENT36 (36UL)
#define TSW_SHACL_ENT37 (37UL)
#define TSW_SHACL_ENT38 (38UL)
#define TSW_SHACL_ENT39 (39UL)
#define TSW_SHACL_ENT40 (40UL)
#define TSW_SHACL_ENT41 (41UL)
#define TSW_SHACL_ENT42 (42UL)
#define TSW_SHACL_ENT43 (43UL)
#define TSW_SHACL_ENT44 (44UL)
#define TSW_SHACL_ENT45 (45UL)
#define TSW_SHACL_ENT46 (46UL)
#define TSW_SHACL_ENT47 (47UL)
#define TSW_SHACL_ENT48 (48UL)
#define TSW_SHACL_ENT49 (49UL)
#define TSW_SHACL_ENT50 (50UL)
#define TSW_SHACL_ENT51 (51UL)
#define TSW_SHACL_ENT52 (52UL)
#define TSW_SHACL_ENT53 (53UL)
#define TSW_SHACL_ENT54 (54UL)
#define TSW_SHACL_ENT55 (55UL)
#define TSW_SHACL_ENT56 (56UL)
#define TSW_SHACL_ENT57 (57UL)
#define TSW_SHACL_ENT58 (58UL)
#define TSW_SHACL_ENT59 (59UL)
#define TSW_SHACL_ENT60 (60UL)
#define TSW_SHACL_ENT61 (61UL)
#define TSW_SHACL_ENT62 (62UL)
#define TSW_SHACL_ENT63 (63UL)
#define TSW_SHACL_ENT64 (64UL)
#define TSW_SHACL_ENT65 (65UL)
#define TSW_SHACL_ENT66 (66UL)
#define TSW_SHACL_ENT67 (67UL)
#define TSW_SHACL_ENT68 (68UL)
#define TSW_SHACL_ENT69 (69UL)
#define TSW_SHACL_ENT70 (70UL)
#define TSW_SHACL_ENT71 (71UL)
#define TSW_SHACL_ENT72 (72UL)
#define TSW_SHACL_ENT73 (73UL)
#define TSW_SHACL_ENT74 (74UL)
#define TSW_SHACL_ENT75 (75UL)
#define TSW_SHACL_ENT76 (76UL)
#define TSW_SHACL_ENT77 (77UL)
#define TSW_SHACL_ENT78 (78UL)
#define TSW_SHACL_ENT79 (79UL)
#define TSW_SHACL_ENT80 (80UL)
#define TSW_SHACL_ENT81 (81UL)
#define TSW_SHACL_ENT82 (82UL)
#define TSW_SHACL_ENT83 (83UL)
#define TSW_SHACL_ENT84 (84UL)
#define TSW_SHACL_ENT85 (85UL)
#define TSW_SHACL_ENT86 (86UL)
#define TSW_SHACL_ENT87 (87UL)
#define TSW_SHACL_ENT88 (88UL)
#define TSW_SHACL_ENT89 (89UL)
#define TSW_SHACL_ENT90 (90UL)
#define TSW_SHACL_ENT91 (91UL)
#define TSW_SHACL_ENT92 (92UL)
#define TSW_SHACL_ENT93 (93UL)
#define TSW_SHACL_ENT94 (94UL)
#define TSW_SHACL_ENT95 (95UL)
#define TSW_SHACL_ENT96 (96UL)
#define TSW_SHACL_ENT97 (97UL)
#define TSW_SHACL_ENT98 (98UL)
#define TSW_SHACL_ENT99 (99UL)
#define TSW_SHACL_ENT100 (100UL)
#define TSW_SHACL_ENT101 (101UL)
#define TSW_SHACL_ENT102 (102UL)
#define TSW_SHACL_ENT103 (103UL)
#define TSW_SHACL_ENT104 (104UL)
#define TSW_SHACL_ENT105 (105UL)
#define TSW_SHACL_ENT106 (106UL)
#define TSW_SHACL_ENT107 (107UL)
#define TSW_SHACL_ENT108 (108UL)
#define TSW_SHACL_ENT109 (109UL)
#define TSW_SHACL_ENT110 (110UL)
#define TSW_SHACL_ENT111 (111UL)
#define TSW_SHACL_ENT112 (112UL)
#define TSW_SHACL_ENT113 (113UL)
#define TSW_SHACL_ENT114 (114UL)
#define TSW_SHACL_ENT115 (115UL)
#define TSW_SHACL_ENT116 (116UL)
#define TSW_SHACL_ENT117 (117UL)
#define TSW_SHACL_ENT118 (118UL)
#define TSW_SHACL_ENT119 (119UL)
#define TSW_SHACL_ENT120 (120UL)
#define TSW_SHACL_ENT121 (121UL)
#define TSW_SHACL_ENT122 (122UL)
#define TSW_SHACL_ENT123 (123UL)
#define TSW_SHACL_ENT124 (124UL)
#define TSW_SHACL_ENT125 (125UL)
#define TSW_SHACL_ENT126 (126UL)
#define TSW_SHACL_ENT127 (127UL)
#define TSW_SHACL_ENT128 (128UL)
#define TSW_SHACL_ENT129 (129UL)
#define TSW_SHACL_ENT130 (130UL)
#define TSW_SHACL_ENT131 (131UL)
#define TSW_SHACL_ENT132 (132UL)
#define TSW_SHACL_ENT133 (133UL)
#define TSW_SHACL_ENT134 (134UL)
#define TSW_SHACL_ENT135 (135UL)
#define TSW_SHACL_ENT136 (136UL)
#define TSW_SHACL_ENT137 (137UL)
#define TSW_SHACL_ENT138 (138UL)
#define TSW_SHACL_ENT139 (139UL)
#define TSW_SHACL_ENT140 (140UL)
#define TSW_SHACL_ENT141 (141UL)
#define TSW_SHACL_ENT142 (142UL)
#define TSW_SHACL_ENT143 (143UL)
#define TSW_SHACL_ENT144 (144UL)
#define TSW_SHACL_ENT145 (145UL)
#define TSW_SHACL_ENT146 (146UL)
#define TSW_SHACL_ENT147 (147UL)
#define TSW_SHACL_ENT148 (148UL)
#define TSW_SHACL_ENT149 (149UL)
#define TSW_SHACL_ENT150 (150UL)
#define TSW_SHACL_ENT151 (151UL)
#define TSW_SHACL_ENT152 (152UL)
#define TSW_SHACL_ENT153 (153UL)
#define TSW_SHACL_ENT154 (154UL)
#define TSW_SHACL_ENT155 (155UL)
#define TSW_SHACL_ENT156 (156UL)
#define TSW_SHACL_ENT157 (157UL)
#define TSW_SHACL_ENT158 (158UL)
#define TSW_SHACL_ENT159 (159UL)
#define TSW_SHACL_ENT160 (160UL)
#define TSW_SHACL_ENT161 (161UL)
#define TSW_SHACL_ENT162 (162UL)
#define TSW_SHACL_ENT163 (163UL)
#define TSW_SHACL_ENT164 (164UL)
#define TSW_SHACL_ENT165 (165UL)
#define TSW_SHACL_ENT166 (166UL)
#define TSW_SHACL_ENT167 (167UL)
#define TSW_SHACL_ENT168 (168UL)
#define TSW_SHACL_ENT169 (169UL)
#define TSW_SHACL_ENT170 (170UL)
#define TSW_SHACL_ENT171 (171UL)
#define TSW_SHACL_ENT172 (172UL)
#define TSW_SHACL_ENT173 (173UL)
#define TSW_SHACL_ENT174 (174UL)
#define TSW_SHACL_ENT175 (175UL)
#define TSW_SHACL_ENT176 (176UL)
#define TSW_SHACL_ENT177 (177UL)
#define TSW_SHACL_ENT178 (178UL)
#define TSW_SHACL_ENT179 (179UL)
#define TSW_SHACL_ENT180 (180UL)
#define TSW_SHACL_ENT181 (181UL)
#define TSW_SHACL_ENT182 (182UL)
#define TSW_SHACL_ENT183 (183UL)
#define TSW_SHACL_ENT184 (184UL)
#define TSW_SHACL_ENT185 (185UL)
#define TSW_SHACL_ENT186 (186UL)
#define TSW_SHACL_ENT187 (187UL)
#define TSW_SHACL_ENT188 (188UL)
#define TSW_SHACL_ENT189 (189UL)
#define TSW_SHACL_ENT190 (190UL)
#define TSW_SHACL_ENT191 (191UL)
#define TSW_SHACL_ENT192 (192UL)
#define TSW_SHACL_ENT193 (193UL)
#define TSW_SHACL_ENT194 (194UL)
#define TSW_SHACL_ENT195 (195UL)
#define TSW_SHACL_ENT196 (196UL)
#define TSW_SHACL_ENT197 (197UL)
#define TSW_SHACL_ENT198 (198UL)
#define TSW_SHACL_ENT199 (199UL)
#define TSW_SHACL_ENT200 (200UL)
#define TSW_SHACL_ENT201 (201UL)
#define TSW_SHACL_ENT202 (202UL)
#define TSW_SHACL_ENT203 (203UL)
#define TSW_SHACL_ENT204 (204UL)
#define TSW_SHACL_ENT205 (205UL)
#define TSW_SHACL_ENT206 (206UL)
#define TSW_SHACL_ENT207 (207UL)
#define TSW_SHACL_ENT208 (208UL)
#define TSW_SHACL_ENT209 (209UL)
#define TSW_SHACL_ENT210 (210UL)
#define TSW_SHACL_ENT211 (211UL)
#define TSW_SHACL_ENT212 (212UL)
#define TSW_SHACL_ENT213 (213UL)
#define TSW_SHACL_ENT214 (214UL)
#define TSW_SHACL_ENT215 (215UL)
#define TSW_SHACL_ENT216 (216UL)
#define TSW_SHACL_ENT217 (217UL)
#define TSW_SHACL_ENT218 (218UL)
#define TSW_SHACL_ENT219 (219UL)
#define TSW_SHACL_ENT220 (220UL)
#define TSW_SHACL_ENT221 (221UL)
#define TSW_SHACL_ENT222 (222UL)
#define TSW_SHACL_ENT223 (223UL)
#define TSW_SHACL_ENT224 (224UL)
#define TSW_SHACL_ENT225 (225UL)
#define TSW_SHACL_ENT226 (226UL)
#define TSW_SHACL_ENT227 (227UL)
#define TSW_SHACL_ENT228 (228UL)
#define TSW_SHACL_ENT229 (229UL)
#define TSW_SHACL_ENT230 (230UL)
#define TSW_SHACL_ENT231 (231UL)
#define TSW_SHACL_ENT232 (232UL)
#define TSW_SHACL_ENT233 (233UL)
#define TSW_SHACL_ENT234 (234UL)
#define TSW_SHACL_ENT235 (235UL)
#define TSW_SHACL_ENT236 (236UL)
#define TSW_SHACL_ENT237 (237UL)
#define TSW_SHACL_ENT238 (238UL)
#define TSW_SHACL_ENT239 (239UL)
#define TSW_SHACL_ENT240 (240UL)
#define TSW_SHACL_ENT241 (241UL)
#define TSW_SHACL_ENT242 (242UL)
#define TSW_SHACL_ENT243 (243UL)
#define TSW_SHACL_ENT244 (244UL)
#define TSW_SHACL_ENT245 (245UL)
#define TSW_SHACL_ENT246 (246UL)
#define TSW_SHACL_ENT247 (247UL)
#define TSW_SHACL_ENT248 (248UL)
#define TSW_SHACL_ENT249 (249UL)
#define TSW_SHACL_ENT250 (250UL)
#define TSW_SHACL_ENT251 (251UL)
#define TSW_SHACL_ENT252 (252UL)
#define TSW_SHACL_ENT253 (253UL)
#define TSW_SHACL_ENT254 (254UL)
#define TSW_SHACL_ENT255 (255UL)

/* RXFIFO register group index macro definition */
#define TSW_RXFIFO_E1 (0UL)
#define TSW_RXFIFO_P1 (1UL)

/* TSNPORT register group index macro definition */
#define TSW_TSNPORT_PORT1 (0UL)
#define TSW_TSNPORT_PORT2 (1UL)
#define TSW_TSNPORT_PORT3 (2UL)


#endif /* HPM_TSW_H */
